{
	"id" : "53486",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Mechanical Engineer",
	"job_location" : "Calgary, AB",
	"number_of_positions" : "1",
	"salary" : "TBC",
	"frequency" : "Hourly",
	"industry" : "Hardware",
	"company_type" : "Private Business",
	"job_description" : "Work at SMART Technologies, and you will be part of a team that redefines the way the world works and learns. SMART creates leading edge collaborative solutions for both the education and enterprise markets. We are connected, curious and courageous. Join us and work for a true technology company where your ideas can make a difference.&nbsp;SMART is recruiting a Mechanical Engineering Intern for our Calgary office.As part of SMART’s mechanical engineering team, you will be responsible for mechanical components in SMART products. You will assist in the development of new products by supporting design, assembly, testing and documentation activities. Your term will represent real-world experience using the latest tools and techniques.&nbsp;Your responsibilities will include the following:• Support mechanical engineers in the design, assembly, testing and documenting new products• Generating and executing test plans and reports• Assisting in design and verification testing and troubleshooting• Completing design analysis, engineering calculations and tolerance reviews• Creating documentation including part drawings, assembly drawings and technical market drawings• Contributing to the ongoing optimization of design processes• Collaborating with other product development groups to achieve project goals",
	"job_requirements" : "You have the following qualifications:• Completed at least two years in a bachelor of science program in mechanical engineering• Mechanical product design skills and knowledge of related manufacturing technologies• Eagerness to learn and desire for challenges• Excellent troubleshooting and problem-solving abilities• Excellent organization skills, including the ability to multitask in a dynamic research and development environment• Solid teamwork abilities• Strong oral and written communication skills• Computer literacy, and a demonstrated proficiency in SolidWorks® and Microsoft® OfficeWorking conditions• This position would split time between the office and prototype shop. Time in the shop would be spent to assist in creating, modifying and testing prototypes.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in MechanicalMaster of Engineering MechanicalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalUBC OkanaganUBC Okanagan MechanicalStart Date:05/04/2015",
	"end_date" : "12/18/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "SMART Technologies",
	"division" : "SMART Technologies",
	"website" : "smarttech.com/ca"
}