{
	"id" : "53517",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Development of an underwater laser-cutting process",
	"job_location" : "Hanover, Germany",
	"number_of_positions" : "1",
	"salary" : "755:30 euro",
	"frequency" : "Monthly",
	"industry" : "Academic Research",
	"company_type" : "Non-Profit Organization",
	"job_description" : "During the two work terms you will learn the basics of laser processing and how to handle the needed equipment. You will be involved in planning and performing the cutting experiments and in qualifying the results. An extremely important part of the job is the documentation of the experiments and also the summarizing of the results. The results will be discussed and it will be up to you to suggest improvements. The process will be used for cutting sheet pile walls in maritime environments.Fields of Work:laser and optics installation and adjustmentperforming practical investigationsdocumentationqualifying the results",
	"job_requirements" : "highly organized and very exact in documenting experimental dataexperience in optics and lasers (preferable)basic knowledge in physicspractical approach to work and solving problemsinterested to work in a challenging fieldindependent workmotivation to work in GermanyOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical &amp; ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:05/01/2015",
	"end_date" : "12/31/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Laser Zentrum Hannover e.V.",
	"division" : "Laser Zentrum Hannover",
	"website" : "www.lzh.de"
}