{
	"id" : "53533",
	"application_deadline" : "Jan 21, 2015 1000PM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Information Technology Co-op Student",
	"job_location" : "Calgary",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"industry" : "Oil & Gas",
	"company_type" : "Private Business",
	"job_description" : "Devon Canada Corporation is an experienced player in heavy oil, with more than 20 years of cold flow heavy oil production in Lloydminster and Bonnyville, Alberta, and steam assisted gravity drainage (SAGD) heavy oil operations in the Athabasca region of northeastern Alberta. Exponential growth in our Jackfish 1, 2 and 3 operations has led to 100,000 BOED of best-in-class production. Devon Canada knows heavy oil – and it’s what we do best. We pioneered using saline water in the SAGD process, completely eliminating the use of fresh water in our operations and we have the most vigorous wildlife monitoring program in the industry. Our almost 1500 employees are committed to maximizing our assets and finding solutions to help us work faster, safer and better. We’ve made the list of Fortune 100’s Best Companies to Work For for seven straight years. Just watch where we go from here. www.devonenergy.com.This 8-month co-op student position will commence in May 4, 2015 and is based Calgary, Alberta.Devon is pleased to provide relocation services to eligible students who do not reside in the location of the job posting.",
	"job_requirements" : "Duties & Responsibilities• Provide application or technical support as requested or as directed• Assisting with developing code• Developing internal reports• Assisting with testing and quality assurance• Liaise with Calgary and Oklahoma City to help resolve service tickets as required• Learn and apply skills with productivity tools such as MS-Excel, MS-Access and SQL• Provide training, documentation and support to application and technology users as required• Select and execute a business improvement project leveraging information technology for presentation at term end• Participate in requirement gathering sessions with the Business• Creation of Project documentation (Opportunity Evaluations, Business Case, Requirements, Process Flows)Qualifications• Currently enrolled in an Information Technology, Computer Science, Electrical/Computer Engineering or Commerce program returning to school in Winter 2016• Personal commitment to safety• Exceptional communication and interpersonal skills• Ability to present thoughts and ideas clearly and effectively• Strong analytical skills• Oil & Gas industry experience is beneficial but not required• Enjoys working in a team environment• Be a self-starter and recognize when issues need to be raised• Time management and task prioritization skills.• Willingness to travel to field site locations.Why work for Devon?Devon Energy’s core values emphasize openness, teamwork and results. Employees who work at Devon Energy experience:• work-life balance,• a fun working environment,• consideration for long-term employment,• an “open-door” office environment,• the opportunity to learn and enhance skills, and• working for a successful company that maintains a “small company” work environment.For more information on Devon Energy visit devonenergy.com.&nbsp; To see our students at work, visit on us on Instagram, #devonenergized.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://careers.devonenergy.com/calgary/information-technology/jobid6569554-information-technology-co-op-student-(8-months)-jobs",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Application Process:Individuals interested in pursuing this opportunity are encouraged to submit their resume, cover letter and transcripts at devonenergy.com. Applicants must be legally eligible to work in Canada.UBC Engineering Coop Deadline: January 21, 2015This posting may close earlier than the deadline indicated if a suitable candidate is identified.&nbsp; We thank all applicants for their interest, however, only those selected for interviews will be contacted.Company:Devon Energy Corporation",
	"division" : "Devon Energy - Canadian Division"
}