{
	"id" : "53540",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Field Engineering Summer Student",
	"job_location" : "Bonnyville or Lloydminster, Alberta",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"industry" : "Oil & Gas",
	"company_type" : "Private Business",
	"job_description" : "Devon Canada Corporation is an experienced player in heavy oil, with more than 20 years of cold flow heavy oil production in Lloydminster and Bonnyville, Alberta, and steam assisted gravity drainage (SAGD) heavy oil operations in the Athabasca region of northeastern Alberta. Exponential growth in our Jackfish 1, 2 and 3 operations has led to 100,000 BOED of best-in-class production. Devon Canada knows heavy oil – and it’s what we do best. We pioneered using saline water in the SAGD process, completely eliminating the use of fresh water in our operations and we have the most vigorous wildlife monitoring program in the industry. Our almost 1500 employees are committed to maximizing our assets and finding solutions to help us work faster, safer and better. We’ve made the list of Fortune 100’s Best Companies to Work For for seven straight years. Just watch where we go from here. www.devonenergy.com.Devon is seeking Jr. Maintenance/Operator Assistants within our Canadian production field locations. Worker safety, regulatory compliance, environmental sensitivities and community engagement are our top priorities and key to maintaining our social license to operate. All new students receive well-site safety, driving and regulatory training upon hire. Positions will start in Calgary on May 4, 2015 for 5 days of orientation and training prior to continuing to Bonnyville, Alberta or Lloydminster, Alberta.Devon is pleased to provide relocation services to eligible students who do not reside in the location of the job posting.Duties & Responsibilities:• Optimize and maintain oil and gas production equipment. This includes, preparing, maintaining and submitting daily reports and records maintenance support, inventory logs and scheduled service, etc.• Optimize and maintain oil and gas production and lease expenses. This includes, preparing, maintaining and submitting daily reports and records of daily gas and/or liquid volume, well pressure and volume of chemicals used, etc.• Start up or shut down operational equipment as required• Troubleshoot operational problems as required• Pigging of flow lines as required• Ensure all wells and associated facilities are kept in safe, environmentally friendly and tidy condition",
	"job_requirements" : "Qualifications:• Second or third year engineering students with strong desire to build a career in the oil and gas industry• Personal commitment to safety• Keen learner possessing effective skills in observation and communication• Demonstrated positive attitude and strong ability to effectively work within a diverse, team-first environment• Willingness to accept new challenges and seek growth within a supportive learning environment• Must be physically fit, have valid driver’s license with a clean driving recordWhy work for Devon?Devon Energy’s core values emphasize openness, teamwork and results. Employees who work at Devon Energy experience:• work-life balance,• a fun working environment,• consideration for long-term employment,• an “open-door” office environment,• the opportunity to learn and enhance skills, and• working for a successful company that maintains a “small company” work environment.For more information on Devon Energy visit devonenergy.com.&nbsp; To see our students at work, visit on us on Instagram, #devonenergized.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaster of Applied Science in BiomedicalMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science in GeologicalMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering CivilMaster of Engineering Clean EnergyMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in BiomedicalMaster of Engineering in GeologicalMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaster of Software SystemsMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:05/04/2015",
	"hours_per_week" : "0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://careers.devonenergy.com/calgary/engineering/jobid6569550-field-engineering-summer-student-jobs",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Application Process:Individuals interested in pursuing this opportunity are encouraged to submit their resume, cover letter and transcripts at devonenergy.com. Applicants must be legally eligible to work in Canada.This posting may close earlier than the deadline indicated if a suitable candidate is identified.&nbsp; We thank all applicants for their interest, however, only those selected for interviews will be contacted.Company:Devon Energy Corporation",
	"division" : "Devon Energy - Canadian Division"
}