{
	"id" : "53546",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Internship in Dynamics and Control",
	"job_location" : "Zurich Switzerland",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "The group of Prof. Raffaello D'Andrea at the Institute for Dynamic Systems and Control (IDSC) at ETH Zurich, Switzerland, is seeking interns who will assist with research projects on the dynamics and control of autonomous systems. More information about the research projects at the Institute may be found at http://www.idsc.ethz.ch/Research_DAndrea/index including photos of the technology.A list of current student projects offered by the Institute may be found here:&nbsp; http://www.idsc.ethz.ch/Projects/index; this list is representative of projects done by interns. The project details for the next interns will be defined based on the successful applicant's experience and aptitude, and the current needs of the institute.The interns are supported by a generous stipend that covers the living costs in Zurich, and limited funds to support the student's travel costs are also available.Preference will be given to students who are able to stay for longer periods of time (i.e. 8 or 12 months).",
	"job_requirements" : "Applicants must be enrolled full-time both before and after the internship, and the internship must be an integral part of the course of study.&nbsp;Prerequisites:Excellent engineering students with backgrounds in any of: control design, mechanical design, electrical design, programming (esp. C++), or systems analysis.Posted with UBC Engineering Physics Co-op, UBC Engineering Co-opOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Institute for Dynamic Systems and Control: ETH - IDSC",
	"division" : "Main"
}