{
	"id" : "53555",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "RUBY ON RAILS DEVELOPER (FULL STACK)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "COOP POSITION - RUBY ON RAILS DEVELOPER (FULL STACK)Vancouver, BC – 4 or 8 month placementsWE ARE FAMILYTo us, you are more than an employee.&nbsp; You are family.&nbsp; And we value family.&nbsp; People matter, and our team is key to our collective success - so we have assembled a pretty cool cast of characters who work hard and play hard according to our own version of Barney's Bro code.&nbsp; So expect no senseless hierarchies, but rather lots of opportunities to take initiative and use your brain - we want your ideas! If you want to join our team, get ready to learn a lot, laugh a lot, go beyond what you thought possible – and change the world with us.AN INSPIRING PLACE TO WORK FROMWe are in the best neighborhood in the best city - yes, you are correct if you are thinking about Gastown in Vancouver. The charm of small cafes and bars has become attractive for many young tech startups and rising tech giants alike - from Hootsuite to GrandRelay. And it gets better - our sunlight filled office is in the Penthouse (yes, you read that correctly) of a newly renovated building with great views over mountains and city, a bike room with showers and a large deck with a picnic table.THE SHORT VERSION OF EVERYTHING ELSEWe - are an award winning company with real users and huge market - and want to dent the universeYou - appreciate Agile development and beautiful/efficient code - and really want know and learn Ruby on Rails 3+&nbsp; Do you have a passion for making beautiful software and using real usage data to discover the triggers that push a product from great to amazing? Do you work on it until its easy enough that even your Grandma could use it?&nbsp; If this sounds like you keep reading.WHAT YOU WILL DO:Developing our application and processes to support critical business needs• Rapidly developing new features both server-side (RoR) and client-side (jQuery and soon angular)• Proposing/exploring new tools and technologies to use to support our rapid growth• Engineering, experimenting with and measuring the success of your own ideas• Watching your code get used by hundreds of people the day you build itABOUT MYBESTHELPER:myBestHelper is a place for parents to quickly and efficiently find caregivers they can trust.&nbsp; Our team uses the Lean Startup model and agile development.&nbsp; We are committed to provide our customers with what they want and need.&nbsp; We care about our customers, commitment, hard work, learning and excellence.&nbsp; We want to deliver a great experience to our clients.Our CEO co-founder is one of the WXN’s Top 100 Most Powerful Women in Canada and recently awarded the Queen’s Jubilee Medal.&nbsp; We won Startup Weekend Vancouver 2011, placed 10th in the Global Startup Battle, the Canadian Innovation Exchange (CIX) selected us for the Canadian Technology Accelerator program (CTA) at Rocket Space in San Francisco and we were awarded Third Place at NVBC 2012, second place at Launch Academy Demo Day 2012.",
	"job_requirements" : "WHAT WE ARE LOOKING FOR:We are looking for developers who are passionate about their craft.&nbsp; It helps if you have the following areas of knowledge or competency, but it is not required:• Appreciation for Agile development and simple, beautiful and efficient code• Knowledge of Ruby on Rails 3+ and related technologies• HTML5, CoffeeScript/Javascript, jQuery and CSS3 experience• Knowledge of Git, pragmatic BDD testing• Excellent communication and presentation skills (English)• Willingness to learn from & teach your new colleagues• Ability to work in a close-knit team and under pressureWe prefer third or fourth year students, but will consider all applications.&nbsp; We also prefer 8-month placements, but are open to a 4-month term.WE OFFER:• Competitive compensation based on your Coop program guidelines• A highly experienced team of co-workers• Flexible work schedule• An office in the center of Vancouver’s hi-tech community• Membership to Launch AcademyOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "myBestHelper",
	"division" : "Corporate Head Office",
	"website" : "www.mybesthelper.com"
}