{
	"id" : "53559",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 or 12 months",
	"job_title" : "Science and Engineering R&D Intern",
	"job_location" : "Squamish, BC",
	"number_of_positions" : "2",
	"salary" : "3500",
	"frequency" : "Monthly",
	"industry" : "Manufacturing/R&D - Various",
	"company_type" : "Private Business",
	"job_description" : "Carbon Engineering Ltd. is a unique and ambitious Clean-Tech start-up based in Calgary, Alberta. Our mission is to commercialize technology to capture CO2directly from atmospheric air at industrial scale. Harvard Kennedy School professor David Keith founded Carbon Engineering in 2009 with seed investment from private investors, including Bill Gates. The company has since grown to 10 FTE's, and has received global recognition as a leader in the new and exciting air capture field, particularly through being a current short-list candidate for the Virgin Group's $25M Virgin Earth Challenge prize.Carbon Engineering has recently secured funding to engineer, build, and operate a full end-to-end pilot plant. This pilot plant, located in Squamish, BC, will be the key demonstration step in commercialization of our technology, it will run through 2014-2015 to provide&nbsp;the key component testing and validation for key equipment vendors. Working with Carbon Engineering is an opportunity to be part of the solution and to make an impact on one of the key challenges of our time. If you are interested in working in the environmental field, clean energy, or in technology development, an internship at Carbon Engineering is a high-intensity and fast paced opportunity to gain valuable skills and perspective for future use in these fields.As part of the upcoming Pilot plant project, Carbon Engineering has 2 positions available for 2 Science & Engineering R&D interns. These positions will likely&nbsp;include activities such as:* Assist Project Manager with daily construction phase tasks, including equipment inspections, design change and As-Built documentation, management of vendors and trades* Assist Engineering team with development of testing and sampling procedures* Manage and/or execute smaller scale optimization experiments* Tracking progress of equipment installation, updating equipment and inventory lists and ordering replacements as required* Assisting operations and R&D teams with start-up phase of plant, as well as daily pilot activities, including data management, sampling and analysis, troubleshooting, plant maintenance and monitoring of process* Review of data collection system requirements* Running specific procedures and tests on samples, such as solids separation and processing, particle size distribution, titrations, total suspended solids measurement, solids composition analysis* Work with the team to develop process advancements/changes based on data from the pilot* Modelling of aspects of the process with simulation software such as Aspen Plus* Tracking pilot activities across shift changes and assisting with effective dissemination of information between the groups* Collaboration wiht onsite and offsite team members and communicating verbally and in writing regarding work progress* Management of sampling and test data and assistance in analysis of data&nbsp;",
	"job_requirements" : "* Engineering, chemistry or physics background required* Modelling experience with mathematical and engineering software such as Matlab, Python, Aspen Plus, Hysys* Self-starter; ability to work independently towards multiple deadlines with minimum supervision in a fast paced environment* Strong communication and interpersonal skills* Strong analytical skills required for sample and testing activities* Experience with experimental design* Attention to details* Hands-on experience with building or maintaining mechanical equipment is not mandatory but highly beneficial* Computer programming skills are beneficialMust have either landed immigrant status or Canadian Citizenship.Open To All Majors:Yes",
	"start_date" : "01/01/2015",
	"end_date" : "12/23/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):CV, Transcripts, cover letter",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Must have either landed immigrant status or Canadian Citizenship.Company:Carbon Engineering Ltd",
	"division" : "Research and Development, Engineering",
	"website" : "www.carbonengineering.com"
}