{
	"id" : "53552",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Mobile & Web Developer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Title: Mobile & Web DeveloperCover Letter (Required): Mr. Darshan KalerLocation: Vancouver, BCDuration: 4 or 8 monthsTradable Bits is a downtown Vancouver technology company that creates products forbusinesses using social media. We empower brands - from startup to Fortune 500 - by givingtheir audience a voice. We are seeking a talented, creative and highly motivated mobile andweb developers to join our powerhouse team. Our developers take pride in their work becauseit’s impactful, lasting and experienced by millions of people worldwide. Be on the cutting edgeof social media app technologies!We’re currently working with major leaders in the Sports, Entertainment, Retail and Travelindustries and we need some passionate people to help accelerate our growth and polish ourplatform. We’ve got cool stuff in the works and are on the edge of massive expansion, so ifyou’re committed to high quality craftsmanship and constant innovation, you’re who we want.About the JobAs an integral part of the development team, you will be responsible for creating code that willbe seen by millions of people around the world. Attention to detail and passion for well-writtenscalable code are paramount. You may not have a CS degree, but you need to be fired up towork in a fast paced environment and a sense of humour is a must.",
	"job_requirements" : "Requirements• Knowledge of at least one of scripting languages: Python, Ruby, Perl, Php• Experience working in Unix environment ( Linux, Solaris, Mac OS, etc. )• Basic understanding of HTTP protocol options ( GET vs POST, headers, SSL )• Ability to write hand-coded, clean and commented html and css that works cross-browserand cross-device• Knowledge of Javascript and JS frameworks ( jQuery, Dojo, etc. )• Excellent verbal and written communication skills• Ability to work independently and take ownership of featuresBonus Points• Experience with CSS grid frameworks (e.g. bootstrap)• Experience with Django framework• Any form of native mobile development iOS or Android.• Experience with OpenGraph API• Understanding of RDBMS concepts• Experience developing mobile web apps• Active with social media with a solid understanding of the space• Experience working in a start-up environment• Sense of humour and irreverenceCompensation & Benefits• We provide a competitive salary• Fun working environment and a great team to work withOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Tradablebits",
	"division" : "Tradablebits"
}