{
	"id" : "53550",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Coop Software Engineer (Gameplay)",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "$2200 - 3300 (depending on skills and experience)",
	"frequency" : "Monthly",
	"job_description" : "Company Name: Blackbird Interactive IncWebsite URL: http://blackbirdinteractive.comCompany Profile: Blackbird is a small Vancouver video game startup working on an exciting new realtimestrategy game. Founded by four industry veterans from Relic and Electronic Arts, our team has grown toover twenty developers working out of a warehouse space on Great Northern Way in Vancouver. Our firstproduct is Homeworld:Shipbreakers, a groundbasedrealtimestrategy game for PC’s set in the Homeworld",
	"job_requirements" : "Responsibilities & Duties:Focus will be on gameplay systems, graphics, tools and user interface programming in C# using theUnity game engine. Specific tasks will be assigned based on skills, interests and project needs. Youwill be responsible for full life cycle of development, from requirements analysis with the design andart team through technical design, implementation, testing and bug fixing.Required Qualifications:C# programming experience, or knowledge of C++ or Java and a willingness to learn quickly. Abilityto refine loose requirements and work independently in a fastpacedcollaborative environment.Brains, enthusiasm, and a desire to innovate. This position is best suited to an experienced student.Other Desirable Qualifications:Linear algebra and trigonometry; profiling and optimization; game development experience; RTSgame playing experience.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Blackbird Interactive",
	"division" : "Main"
}