{
	"id" : "53564",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op Student Mechanical/Electrical",
	"job_location" : "Vancouver",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Flow Consulting Group provides mechanical and electrical engineering services for commercial,institutional, Data Centres, and Health Care projects. We are also an approved vendor for BC Hydro’sPower Smart and Continuous Building Optimization programs. Our projects vary from tenantimprovements to new buildings’ mechanical and electrical systems design. A point summary is as follows:• Mechanical and electrical systems upgrades triggered by either end of equipment service life orby the owner’s plans to reduce energy consumption.• Energy studies to identify possible energy savings measures that would qualify for BC Hydro’sincentives.• Design for modifications of mechanical and electrical systems and components to suit new floorslayouts in office buildings where new tenants replace existing.• Troubleshooting systems malfunctions or operations problems and providing recommendationsfor solutions.• Data Centres cooling systems design and optimization.• Mechanical and electrical systems design for new buildings.",
	"job_requirements" : "The co-op student role would be to perform the following:Mechanical:• Heating and cooling loads calculations.• Assist in selecting suitable and efficient HVAC systems.• Assist in the design process using CAD.• Duct and pipe sizing and design.• Coordination with other disciplines.• Communication with equipment suppliers and the design team.Electrical:• 2D electrical CAD design (AutoCad 2007 or later)• Performing site surveys to observe and trace existing building electrical and fire alarm systems.• Performing site surveys to review construction and implantation of electrical design.• Preparing documents pertaining to electrical projects.• Reviewing electrical equipment shop drawings.• Communicating with Architects and Clients for electrical design requirements.• Communicating with suppliers and sales engineers for equipment information.• Coordinating with other design disciplines.The challenges would be, in addition to technical accuracy, meeting tight timelines for projects delivery.The proposed employment period would be for the Winter term.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Flow Consulting Group Inc",
	"division" : "Flow Consulting",
	"website" : "flowgroup.ca"
}