{
	"id" : "53565",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Electrical Co-op",
	"job_location" : "Kelowna, BC",
	"number_of_positions" : "1",
	"salary" : "$25/hr",
	"frequency" : "Hourly",
	"industry" : "Utility Company",
	"company_type" : "Private Business",
	"job_description" : "Electrical Co-op – Cima+ Kelowna, BCCIMA+ is currently seeking a co-op, Electrical Engineering for a 4-month (possible to extend to an 8,or 12 month) starting Jan 1st, 2015. Your tasks and responsibilities will primarily consist of acting as support to the Sr., Intermediate and Jr. Electrical Engineers in Kelowna, BC.&nbsp; Your main task will be to participate in the execution of multi-disciplinary projects of various size and nature; you will be working on generation, substation, or distribution electrical power systems throughout BC.Responsibilities• Develop scope definition, design criteria, technical specifications;• Perform Power systems studies in steady state mode such as Short-circuit, load flow, coordination and arc flash studies;• Equipment selection and single line drawings;• Planning, scheduling and estimating (Engineering and Construction);• Engineering coordination with other disciplines;• Perform regular documented reviews, maintain monthly progress report, and issue updates accordingly;• Produce power system models and operate them for studies;• Design distribution line systems – overhead and underground;• Create drawings in AutoCAD;",
	"job_requirements" : "Qualifications• Successfully completed first semester of 3rd year of Electrical Engineering courses• Excellent verbal and written communication skills in both official languages are preferred. Must be proficient (verbal and writing) in English;• Exceptional time-management skills and the ability to prioritize and execute multiple tasks quickly;• Excellent leadership, positive attitude and communication skills;• Knowledge in power system studies and design;• Knowledge of AutoCAD;• Excellent decision making skills and is open minded to alternative solutions;• Maintain effective working relationships with clients, staff, and other employees.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:37.5",
	"application_receipt_procedure" : "Online via system",
	"company" : "CIMA Partners in Excellence",
	"division" : "Kelowna Office",
	"website" : "http://www.cima.ca/"
}