{
	"id" : "53569",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op Student",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Duration4 monthsSPECIALISTS IN ROTATING MACHINERY - HVAC/R, ELECTRIC MOTORS, GENSETS, MARINE ENGINES, INDUSTRIAL / PROCESS /MFG. / PRODUCTION / ROTORS & DRIVES. HEALTH CONDITION MONITORING, TRENDING & DIAGNOSTIC EVALUATIONS: VIBRATION, NOISE, IR THERMAL IMAGING, CURRENT SIGNATURES ANALYSIS, LASER SHAFT & DRIVE ALIGNMENTS, FIELD & SHOP DYNAMIC BALANCING & ELECTRO-MECHANICAL (FANS, PUMPS & MOTOR REPAIRS).This position requires a person with some mechanical experience or co-op term, excellent communication skills, physically fit and willing to work in Reverse Engineering, Replacement Equipment, Fabrications & Machined Parts (All types of Fans, Blowers and Pumps). Testing, Balancing, Drive Alignment, Complete Service & Repairs, for all above types. Axial Fans VPM / CP Models Conversions = VFD & Start Up Tests. Retrofits/Overhauls/Replacements/Upgrades / Modernization. ACCU-GUARD PdM PROGRAMS (TM) Monitoring Contracts/Technical Training Courses. Due Diligence Verification Studies (Rotating Equipment & System Issues Resolution).Job Description1) Work on job sites with Garrett Sandwell, President.2) Record vibration data on rotating equipment.3) Dynamic balance rotating equipment.4) Help improve / upgrade Vibes Corp computer skills.5) Mechanical repair equipment such as air movement fans and motors.6) Assist with marketing Vibes Corp services and product sales.",
	"job_requirements" : "Job RequirementsStudent must have a driver’s license, neat and tidy in appearance, 3rd. or 4th. year mechanical, electrical or environmental engineering. Working hours will vary from day shifts to night shifts as the need arises.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalEnvironmentalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Vibration Industrial Balancing & Equipment Services",
	"division" : "Vibration Industrial Balancing & Equipment Services"
}