{
	"id" : "53571",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "LABORATORY STUDENT RESEARCHER",
	"job_location" : "UNIVERSITY OF OTTAWA",
	"number_of_positions" : "4",
	"salary" : "$11.00 - $13.25",
	"frequency" : "Hourly",
	"industry" : "Academic Research",
	"job_description" : "The University of Ottawa’s Canada Excellence Research Chair in Quantum Nonlinear Optics is offering 4-8 month Undergraduate co-op placements in three specific research themes in this field. Depending on your background and interests, we will develop with you a meaningful role in one or more of these research tracks:1. Quantum Computing and Cryptography using photonic microchips, optical orbital angular momentum, and entangled quantum states of light.2. Design and characterisation of metamaterials for applications in nonlinear optics and biosensing3. Enhancing non-linear optical effects in slow light nanostructures&nbsp;",
	"job_requirements" : "Research students’ are involved at all stages of planning, executing and understanding of our various research projects including:•Conceptualizing and modelling optics experiments•Designing nanostructures and modeling their interaction with the electromagnetic fields•Building and running experiments involving structured light, such as orbital angular momentum for quantum key distribution, or nanophotonic devices, such as slow light enhancement of nonlinear optical effects.•Analysis of the acquired dataA research students’ contributions are valued in our group, therefore co-op students often appear as co-authors in our scientific publications.We are particularly interested in students with experience in optics or photonics laboratories or a background in quantum mechanics. Familiarity with Matlab, LabVIEW, Mathematica or numerical simulations is also considered an asset. Preferred programs of study are Physics or Electrical Engineering and Computer Science.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:35",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Transcripts",
	"company" : "University of Ottawa",
	"division" : "Quantum Photonics",
	"website" : "hugo.begin@uottawa.ca"
}