{
	"id" : "53607",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Software Developer/Bioinformatician",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "JOB DESCRIPTIONThe project: Building an interactive site to facilitate linking clinical characteristics to molecular signatures.Environment: Embedded within St Paul's Hospital the Centre for Heart Lung Innovation provides wet and dry lab space able toprocess and biobank clinical samples as well as access to facility cores such as molecular phenotyping and informatics.",
	"job_requirements" : "Duties: With the bio-informatics team the individual will participate in the construction and population of a site to host clinicaldata in concert with genotype, epigenetic and Next Generation Sequencing-derived microbiome and gene expression data. Wework in Linux environment primarily in Python for web development using the Django Project open-source web framework and Rfor statistical analysis. Workers skilled in these languages are especially encouraged to apply but those with other relevantexperience and interested in learning these languages are also encouraged to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalComputerElectricalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering Chemical & BiologicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "St. Paul's Hospital",
	"division" : "The James Hogg Research Centre, Institute for Heart and Lung Health"
}