{
	"id" : "53601",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Summer Outreach Assistant",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "(a) Assist the Summer Camp Coordinator in running the Physics Summer Camp Program (http://outreach.phas.ubc.ca/SummerCamps/)Responsibilities include:- Develop, build and deliver physics activities for groups of 18-20 students in grades 2-10, as defined on our website.- Work with summer camp teachers to supervise and lead students.- Be responsible for the keeping the students on-task and learning, and for their safety.- Clean-up and catalog camp materials and demos.- Prepare documentation/print-outs required for the camps.(b) Assist in running the Canadian Physics Olympiad National Camp in May(c) Other relevant duties will be assigned by the Communications Coordinator or Faculty Supervisors (Dr. Chris Waltham and Dr. Andrzej Kotlicki, Dept of Physics & Astronomy).",
	"job_requirements" : "Good grasp of physics concepts and practical lab experiences are essential.Ability to explain physics at all levels K-12.Computer/office skills (must possess or be willing to learn): word, excel, mail-merge, SQL, php, winfax, website creation/design/management.Good people and organizational skills.Experience working directly with K-12 students, and/or experience working for summer camps (science or non-science) in the past, would be an asset.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "UBC, Dept. of Physics and Astronomy",
	"division" : "Default Division"
}