{
	"id" : "53604",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "PLANNING ASSISTANT-PLANNING & DEVELOPMENT DEPARTMENT",
	"job_location" : "BC",
	"number_of_positions" : "1",
	"salary" : "$22.82",
	"frequency" : "Hourly",
	"job_description" : "Position:A temporary Planning Assistant student position is available for the summer of 2015 in the Community and Regional Planning Division at the Cowichan Valley Regional District. Reporting to the Manager, Community and Regional Planning, the Planning Assistant provides assistance to the division’s long-range planning and will primarily work on expanding the CVRD Community Heritage Register. Specifically, the Planning Assistant will: identify and document heritage resources; prepare statements of significance; prepare related communications materials; and, liaise with the CVRD GIS Division to map heritage resources. The Planning Assistant may also assist with preparing staff reports; making presentations to the CVRD Electoral Area Services Committee to recommend the addition of heritage resources to the Register; developing a public information brochure; and, the process for adding heritage resources to the Register.",
	"job_requirements" : "Qualifications: Preferred candidates will be enrolled in a Community Planning, Geography or a related program, and have demonstrated interest, involvement or experience in heritage planning and research oriented initiatives. A valid Class 5 BC driver’s license as well as a satisfactory Criminal Record Check and driver’s abstract are required. The successful candidate is proficient with Microsoft Office and possesses the ability to: communicate effectively both verbally and in writing; and, exercise tact and diplomacy in dealing with members of the public, CVRD staff and CVRD Board members. Expertise in Geographic Information Systems (GIS) and Adobe Creative Suite products would be considered assets.To qualify for this position candidates must be a student currently attending a community college or university and planning to return to school in the fall.Hours of Work: This position is available for a period of 17 weeks commencing on May 4, 2015 and continuing until August 28, 2015, subject to funding. Hours of work are 35 hours per week, Monday to Friday. Occasional evening and weekend work may be required.Salary: This temporary position is unionized (CUPE Local 358), anOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalEnvironmentalGeologicalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in GeologicalMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):letter of application and resume",
	"company" : "Cowichan Valley Regional District",
	"division" : "Cowichan Valley Regional District"
}