{
	"id" : "53628",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Junior Technician",
	"job_location" : "Vancouver, UBC Campus",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Job summaryThe Junior Technician is supervised by the Hardware Facilities Manager and Computer EngineeringTechnologists in all work related to installation and maintenance of all computer laboratories owned bythe Computer Science Department. He/She assists with equipment and components related to computers,network and presentation hardware. He/She must be willing to help moving equipment and furniture inorder to organize the undergraduate & departmental laboratories and offices. Prepare and update any related documentation.Major ResponsibilitiesThe Junior Technician will1) Assist with equipment installation and setup in undergrad, grad and faculty space, includingpositioning furniture and securing the computer equipment.2) Assist on implementing network connectivity.3) Perform maintenance and troubleshooting procedure for basic departmental equipment.4) Assist in setting up the undergrads laboratory.5) Help Hardware Facilities Manager and Engineering Technologists to work on various hardware dutiesas required.6) Assist on hardware inventory and normal operations.Organizational RelationshipThe Junior Technician reports to the department Hardware Facilities Manager and/or ComputerEngineering Technologist.Supervision ReceivedThe Junior Technician is supervised by the Computer Engineering Technologists, but is expected to needminimal supervision on some tasks with high standard and quality work.",
	"job_requirements" : "QualificationsThe Junior Technician should be at least 2nd year student in University or with strongknowledge in electronic/electrical systems. Experience with installing hardware, knowledge ofnetworking and basic hand tools will be an asset.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "UBC, Dept. of Computer Science",
	"division" : "Computer Science"
}