{
	"id" : "53627",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Engineer, Intern/Co-Op",
	"job_location" : "Menlo Park, CA/New York, NY/Seattle, WA",
	"number_of_positions" : "5",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Facebook was built to help people connect and share, and over the last decade our tools have played a critical part in changing how people around the world communicate with one another. With over a billion people using the service and more than fifty offices around the globe, a career at Facebook offers countless ways to make an impact in a fast growing organization.Want to build new features and products that touch more than a billion people around the world? Want to build new features that improve existing products like Photos, Video, Groups, NewsFeed, Search, Mobile and Messaging? Want to solve unique, large-scale, highly complex technical problems?Our development cycle is extremely fast, and we've built tools to keep it that way. It's common to write code and have it running live on the site just a few days later. If you work for us, you will make an impact, immediately.Facebook is seeking interns/co-ops to join our engineering team. You can help build the next generation of systems behind Facebook's products, create web applications that reach millions of people, build high volume servers and be a part of a team that’s working to help connect people around the globe. This internship/co-op has a minimum twelve (12) week duration.Responsibilities: Code high-volume software using primarily C++ and Java Create web applications using primarily PHP Implement web interfaces using XHTML, CSS, and JavaScript Build report interfaces and data feeds",
	"job_requirements" : "Requirements:▪&nbsp;&nbsp; Pursuing BS, MS or PhD in Computer Science or related field▪&nbsp;&nbsp; Expertise with C++ or Java▪&nbsp;&nbsp; Knowledge of Perl or PHP or Python▪&nbsp;&nbsp; Knowledge of relational databases and SQL▪&nbsp;&nbsp; High levels of creativity and quick problem solving capabilitiesOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://www.facebook.com/careers/apply?job_id=a0IA000000G3FVmMAN",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Application Method:Please apply directly here.Company:Facebook",
	"division" : "Facebook",
	"website" : "www.facebook.com"
}