{
	"id" : "53635",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Engineer Coop Student",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "n/a",
	"frequency" : "Monthly",
	"industry" : "Academic Research",
	"company_type" : "Private Business",
	"job_description" : "• Either 4 or 8 month work term available• 3rd and 4th year Co-op students preferredAbout the Brain Behavior Lab:The Brain Behavior Laboratory is dedicated to furthering the knowledge of brain behavior; specifically towards expanding our understanding of what therapies positively alter patterns of brain activity after injury or with neurological disease processes. The lab is comprised of dedicated students and staff who in collaboration with senior scientists and volunteers from the community work to answer these important questions in relation to optimizing rehabilitation techniques. The lab works with transcranial magnetic stimulation (TMS), functional MRI, EEG, EMG, and numerous behavioral testing paradigms.Further, software support is available in Matlab, Labview, Presentation, SPSS, and other brain imaging specific platforms. The successful candidate should have experience in both software and hardware development, gaming and programming, and be willing to work with lab trainees and staff to continue project development. Projects will include programming a novel rehabilitation gaming system, setting up and optimizing a new EEG unit, and working to optimize programs written in either Matlab or LabView software.For more information, visit http://www.brain.rehab.med.ubc.ca",
	"job_requirements" : "Skills required:• Experience in programming Microsoft Kinect is an asset• Programming in Matlab or Labview• Willingness to learn new programming approaches• Ability to write data processing scripts in Matlab and Labview• Ability to troubleshoot hardware and software issues as they arise• Understanding of signal processing theory is desired. The Brain Behavior Lab is recording some raw EMG traces associated with Brain stimulation.• Time self managementThe ideal candidate must have strong interpersonal and communications skills and a strong interest in the medical research field. The student must be self-motivated and able to work under minimal supervision.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalComputerElectricalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"company" : "UBC, Brain Behavior Laboratory",
	"division" : "UBC, Brain Behavior Laboratory"
}