{
	"id" : "53632",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Web Developer - Internship REQ#Intern",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "3300-3600",
	"frequency" : "Monthly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "Fortinet (NASDAQ: FTNT) helps protect networks, users and data from continually evolving threats. As a global leader in high-performance network security and a market leader in unified threat management (UTM), we enable businesses and governments to consolidate and integrate stand-alone technologies without suffering performance penalties. Unlike costly, inflexible and low-performance alternatives, Fortinet solutions empower customers to embrace new technologies and business opportunities while protecting essential systems and content. Fortinet is headquartered in Sunnyvale, California with offices around the world.&nbsp; We are an equal opportunity employer offering a challenging and rewarding environment for the best and the brightest to join our highly motivated team. Learn more at&nbsp;www.fortinet.com.&nbsp;Position Overview The Fortinet's web development team is looking for a student interested in an eight month internship or co-op placement. You will be creating web interfaces that enable network administrators to configure, secure and monitor their networks as easily as possible.&nbsp;&nbsp;As a web developer at Fortinet, you will:Implement and maintain web-based user interfaces for Fortinet security and management productsCollaborate with product, design and development teams to create easy to use and powerful web applicationsStay on top of new developments in web application and UI design&nbsp;",
	"job_requirements" : "Job Skills Required:&nbsp;HTML, CSS, JavaScript coding capabilitiesHands-on work experience with Python and DjangoExperience using at least one Javascript framework such as jQuery/YUI/EXT2JSAbility to build user interfaces using modern web standardsKnowledgeable on C/C++Comfortable using a Linux development environmentDesign patterns knowledge an assetExperience using source control software (SVN, git)Apache module programming an assetExcellent problem solving and troubleshooting skillsAbility to clearly communicate your ideas and opinionsUnderstanding of networking and security concepts an assetMust be able to work well in a team development environment&nbsp;Educational Requirements:Preferred - recent graduate, or student in his or her last academic year studying for a&nbsp;degree in&nbsp;Computer SciencePlease provide a copy of your transcript when applyingOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalStart Date:01/05/2015",
	"end_date" : "01/05/2016",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.fortinet.com/careers/",
	"company" : "Fortinet Inc.",
	"division" : "R&D",
	"website" : "www.fortinet.com"
}