{
	"id" : "53634",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Engineering Co-op",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "1",
	"salary" : "$12.58 to $19.91",
	"frequency" : "Hourly",
	"job_description" : "Environment Canada is looking for a self-motivated co-op student to provide on-site information technology (IT) support to Environment Canada s staff at the Monitoring Operations Center (MOC) in Richmond, BC. The Monitoring Staff are responsible for the provision of accurate and timely weather data to a variety of internal and external users clients. The group is responsible for the installation and maintenance of various types of atmospheric monitoring platforms throughout BC and the Yukon. The co-op student will be responsible for maintaining the staff s computers and ensuring the correct operation of all IT equipment at the MOC. He/she will also work closely with the local Corporate Services Branch (CSB) Service Desk, assisting with technical support for Environment Canada employees. Typical tasks include hardware and software installations, repairs, and setups as well as running or maintaining some existing processes. The student must demonstrate the following technical skills: Proficiency with the Windows XP and Windows 7 operating system at the administrator level Experience with Windows networking and multi-user environments Knowledge of the Linux operating system including installation, configuration, and administration A solid understanding of TCP IP networks and routing Experience with providing technical support would be a strong asset Candidates must be comfortable working with their hands",
	"job_requirements" : "In addition to the IT support role, the student will be working with the Remote Video Acquisition System (RVAS) located at various sites in BC. This system is responsible for taking images from remote locations and transmitting them via satellite or other communication links back to the head office for further processing. The student’s role will encompass the research, setup, and maintenance of all components in the RVAS system, including:- Cameras and weatherproof enclosures- Satellite, cellular, broadband or dial-up modems-Software/firmware configuration of the modemsPhysical connections between the components (RJ-45 Ethernet, power connections, antennas, etc.)-&nbsp; PC support for operations- Minor Software development-&nbsp; Some work on data acquisition platforms in the field ( involves potential travel in BC and the Yukon)- XML knowledge and programming skills required&nbsp;",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:37.5",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):SPECIAL APPLICATION PROCESSES: Open to Canadian Citizens only, subject to Security checks, English essential position. Company:Environment Canada",
	"division" : "Aviation and Radar Unit"
}