{
	"id" : "53631",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Jr. C Programmers (CARD)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "5",
	"salary" : "$50,000-$70,000",
	"frequency" : "Yearly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "Fortinet (NASDAQ: FTNT) helps protect networks, users and data from continually evolving threats. As a global leader in high-performance network security and a market leader in unified threat management (UTM), we enable businesses and governments to consolidate and integrate stand-alone technologies without suffering performance penalties. Unlike costly, inflexible and low-performance alternatives, Fortinet solutions empower customers to embrace new technologies and business opportunities while protecting essential systems and content. Fortinet is headquartered in Sunnyvale, California with offices around the world.&nbsp; We are an equal opportunity employer offering a challenging and rewarding environment for the best and the brightest to join our highly motivated team. Learn more at www.fortinet.com.Position OverviewFortinet currently has multiple openings for Undergraduates/Graduates who are in their final term.&nbsp; We can provide the opportunity to develop your career in UTM (Unified Threat Management). These opportunities in our R&D division will enable you to gain exposure to complex technology in network security, and provide you with the chance to get hands-on experience with the various stages in the development cycle. Training will be provided to help you excel in the job and prepare you for a range of internal growth opportunities. We are recognized as an organization that continually promotes from within.When you apply, you will be considered for all of our Jr. C Programming Engineer openings for all teams.Job ResponsibilitiesAt Fortinet, you will use your skills to design, develop, maintain and improve new and existing UI components for one (or many) of our products. You will update and maintain back-end support for the UI and work with other teams to provide them with APIs.&nbsp; You will be involved in the full development lifecycle of products having a real impact in reducing security threats.",
	"job_requirements" : "Job Skills RequiredCurrent knowledge in the following areas is relevant:Software Development in Unix/Linux environment. &nbsp;C/C++ programmingDHTML (Ajax, javascript, CSS)Source control softwareUnderstanding of TCP/IP networkingYou will also bring to the team:Positive attitudeNimble mindSuperior problem solvingGreat trouble shooting skillsHigh motivation to succeedThe ideal candidate is a team player and has excellent time management skills, communication skills, and great problem solving skills.Educational RequirementsUndergraduate and Graduate degree in Computer Science or Electrical EngineeringPlease submit a copy of your academic transcript.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:40",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.fortinet.com/careers/",
	"company" : "Fortinet Inc.",
	"division" : "R&D",
	"website" : "www.fortinet.com"
}