{
	"id" : "53645",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Continuous Improvement Engineer Co-op",
	"job_location" : "Williams Lake, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "OverviewAtlantic Power (www.atlanticpower.com/) is a leading publicly traded, power generation and infrastructure company with a well-diversified portfolio of assets in the United States and Canada. The Company's corporate strategy is to increase the value of the Company through accretive acquisitions in North American markets while generating stable, contracted cash flows from its existing assets. The Company's power generation projects sell electricity to utilities and other large commercial customers under long-term PPAs, which seek to minimize exposure to changes in commodity prices.Its power generation projects in operation have an aggregate gross electric generation capacity of approximately 3,018 MW in which its aggregate ownership interest is approximately 2,098 MW. Its current portfolio consists of interests in twenty-nine operational power generation projects across eleven states in the United States and two provinces in Canada.Atlantic Power has a market capitalization of approximately $400 million and trades on the New York Stock Exchange under the symbol AT and on the Toronto Stock Exchange under the symbol ATP.Williams Lake Power PlantWilliams Lake, British ColumbiaThe Williams Lake Project is a 66 MW biomass-fired generating facility located in Williams Lake, in south-central BC. The Project commenced commercial operations in April 1993. Atlantic Power indirectly owns 100% of the Project.Williams Lake sells energy to BC Hydro under a long-term PPA expiring in 2018. Biomass fuel is provided to the Project under short-term and long-term wood waste supply agreements with various suppliers. Biomass consumed at Williams Lake consists of wood waste from sawmill operations.Atlantic Power operates and manages the Project.",
	"job_requirements" : "Job Title: Continuous Improvement Engineer Co-opLocation: Williams Lake Power PlantReports to: Plant ManagerSummary: The Engineer Co-op will assist in upgrade, design, procurement, installation and commissioning of equipment and systems at the Williams Lake Power Plant.Start Date: May 2015Duration: 4 or 8 monthsWork With UsAtlantic Power invests in its people and its assets to achieve long-term returns and to create value for its shareholders. If you are flexible, of an entrepreneurial mentality, practice business with an open door and open communications, you may want to consider joining our team.&nbsp; We highly value people who possess a common sense of commitment and pride, who enjoy working together and are supportive of one another.We are always looking for talented people to join our team.Our MissionGuided by our values and beliefs about people, we are empowered to pursue our goals:• to be recognized for our excellence in power generation in North America,• to be proud of the accomplishments we achieve as part of the Atlantic Power team and;• to have a positive impact on all of our stakeholders.What we ValueIntegrityWe take pride in conducting business in a transparent, honest, fair and respectful manner. We build trustworthy relationships and maintain a credible reputation by standing by our commitments.TeamworkWe work collaboratively, by listening, encouraging varying points of view, confident that people will do the right thing, providing support, and recognizing the achievements of others.&nbsp; We believe these behaviors promote individual performance growth as well as continuous improvement within the entire organization.ExcellenceWith a focus on safety, we strive to generate energy reliably, efficiently and in an environmentally responsible manner. We set high standards and empower our people to succeed.&nbsp; We communicate our best practices and are committed to optimize and innovate in all aspects of our business.EngagementWe strive to develop and maintain positive relationships with both internal and external stakeholders, including our people and the communities in which we operate, through open communication and active partnerships that result in long-term beneficial impacts.Beliefs About PeopleTrustworthyWe do the right things for the right reasons; we are responsible to ourselves and each other.Teachers & LearnersWe want to improve ourselves and others; we believe in knowledge sharing.Results-OrientedWe are competent, team players who take ownership of our work, we learn from our mistakes, we are accountable for and take pride in our work as we achieve success.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Atlantic Power Corporation (Formerly Capital Power Corporation)",
	"division" : "Williams Lake Power Plant"
}