{
	"id" : "53644",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Business Intelligence, Coop Student",
	"job_location" : "Calgary, Alberta",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Role PurposeThe Business Intelligence Coop Student reports to the Senior Data Scientist, EIM and supports all information needs required by the business to make decisions, from strategic decision making through to operational needs to manage the business. Information to support decision making will come from both internal and external sources, and vary from ad hoc reporting through to complex analytics. The student will be required to play both a report developer role in building standard reports and ad-hoc data requests and a business role in running and publishing reports for various departments. Additionally, a thorough understanding of the merchandising business will be required, including sales growth, market share, product / category info, and key challenges.Role AccountabilitiesPulling data, analyzing, and making recommendations to support business reviews, marketing plans, brand plans, strategies and resource allocationPlay a key role in the team managing the operational reports, through coordinating reporting needs / working with the BI Business Analysts to document the business requirements / query development /facilitating business prioritization / user testingEnsure the integrity of standard reports and resolve data inconsistencies.Uses programming skills to analyze sales and inventory data, product, business results and promotion executionDevelop customer profiling tools and customer segmentation analysis• Formulates plans to address customer needs, which could be in the form of a customer development strategy, direct marketing programs, retail-sales driven promotions, and a wide range of other related problems Manages multiple work assignments in a fast paced, ever-changing business environment.",
	"job_requirements" : "Qualifications / Skills Required• 1-2 years merchandise related experience in apparel organization is desirable• Minimum undergraduate degree in an analytical area (e.g. Math, Statistics, Operations Research, Engineering, Computer Science or related) • Work experience with database programming (SAS, SQL, MS Access, etc.)• Experience with Crystal Reports and Microstrategy applications would be a differentiatorAbility to:• Translate business needs into analytically sound solutions• Effectively manage timelines and communicate requirements to key stakeholders to achieve timelines• Review research and bring forward analysis and recommendations to support Mark¹s strategic positions• Develop productive relationships with cross-functional, merchandising and agency stakeholders• Applies curiosity and skills to clarify business, data and analytical issues and help develop solutionsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "FGL Sports Ltd.",
	"division" : "Calgary Office",
	"website" : "http://www.fglsports.com/"
}