{
	"id" : "53642",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Desktop Management Administrator",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Job Category: Information Technology & Information SystemsGlobalnet-Work is one of B.C.'s leading outsourced IT service providers. We provide a broad range of support services for our customers leading to a very dynamic and engaging work environment for our team.Using your customer first, always attitude, plus your positive and friendly demeanor; responsibilities include:providing first level support services to various users experiencing technical issues and IT requests involving business applications, workplace productivity tools, desktop, laptop (both Windows and Mac), telecommunications and network services. This includes providing first line support, problem tracking, diagnosis, replication, resolution, escalation and system/application support documentation development. This role will apply proven communication, analytical, and problem-solving skills to ensure client satisfaction with both corporate and project related issues.Key Responsibilities:- Respond to systems, applications, hardware, and other client issues by investigating problems/requests and taking corrective actions. Provide both telephone and desk-side first-level support for desktops, laptops, Microsoft Office (2007, 2010), Windows (7 and XP) Operating systems, Mac Operating systems, IPhone's, Ipad's, Blackberry, telecommunications, network services (Client-side VPN) and business applications.- Configure, install and update desktops, laptops and peripherals based on client service requests or as otherwise assigned. Perform desktop application installations, upgrades, and support and maintenance activities.- Perform preventative maintenance of systems, applications and computing equipment in area of the Desktop Management team's responsibility.- Provide operating and administration functions including user set up, configuration and management for systems and business applications.These Responsibilities include:- creation and termination of Network/Exchange user accounts- managing the rights and permissions of network/email accounts- creation and termination of user accounts for business applications- managing the rights and permissions of accounts for business applications- creation of group permissions and rights to file directories- application groups and distribution lists- telecommunication service request - moves, adds and changesResponsibilities Cont'd:- Liaise with key Level 1 Service Desk contacts and IT resources on application and system issues. Communicate effectively with clients and other team members while gathering information to facilitate problem resolution.- Assist Systems Administration teams in support of users with requirements for remote access. Assist in Data Center server backup activities, file and data management and IT disaster recovery operations.- Assist with Network related tasks as delegated by the Network Services team when required.- Monitor and resolve and document all actions and solutions within Service Desk tickets and update the technical details within operational procedures as appropriate. Ensure customer satisfaction, including taking ownership of an opened tickets and ensuring incidents are fully resolved.- Participate in IT Procurement process and manage inventory of workstations and computer equipment components; coordinate appropriate disposal of hardware.- Create and maintain support documentation and document operational processes as related to the operations of Desktop Management team. Work closely with other IT staff to identify chronic problems and help document the action plan to resolve and hand over for support to Level 1 Service Desk support (eg, user training, FAQ's, hardware fixes, software upgrades, etc.) Train Level 1 Service Desk resources on the resolution of common application issues.- Participate in pre-deployment/deployment of projects and provide support, documentation and all readiness documents in preparation for transition to production and hand off to the Level 1 Service Desk.- Deliver exceptional customer service skills which include the passion to go above and beyond exceeding client expectations- Produce reports as required to facilitate the work deliverables, set and measure customer service targets- Participate in Desktop Management team meetings and identify outstanding issues and areas for improvement.- Undertake any other related duties as assigned",
	"job_requirements" : "Education/Experience/Requirements:- Valid Class 5, British Columbia drivers license.- 2-year degree in Information Technology or related field Experience- 2 - 5 years Technical Support experience- Good understanding of TCP/IP Networking and related tools- Working in an IT environment 2-5 years in a customer service oriented role. Background in a Service Desk environment an asset- Basic understanding of Infrastructure, Business Applications, and Service Desk technology- Working knowledge of Active Directory and related user management tasks- Well developed practical operating knowledge of common desktop/laptop hardware and application software specifically, Windows, MS Office Suite, Iphone's and Ipad's, Blackberry configuration, Workstation imaging processes and print services and printers; system application, systems management, data communication including basic networking in LAN/WAN environment and remote access solutions.- Working in a team environment and experience working cohesively with related IT teamsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "GLOBALNET-WORK Computer and Security Systems Ltd.",
	"division" : "Vancouver Office",
	"website" : "http://www.gnw.ca/"
}