{
	"id" : "53643",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Electrical Designer",
	"job_location" : "Burnaby, British Columbia, Canada",
	"number_of_positions" : "1",
	"salary" : "-",
	"frequency" : "Monthly",
	"job_description" : "Involvement will be primarily with the electrical department of the company.&nbsp; Tasks include, but are not limited to, technical report writing, data analysis of voltage metering results, spreadsheet development, electrical design in buildings using AutoCAD (eg. lighting, plug loads, fire alarm systems, etc), existing building audits, and office development projects.",
	"job_requirements" : "Personal: Quick learner with good organization skills, effective written and oral communication skills, and the ability to multi-task.Technical: Strong technical writings skills.&nbsp; Interest in electrical systems (eg. power distribution, lighting systems) and general building systems.Computer software: Proficiency in MS Excel and MS Word. Experience with AutoCAD and MS Access is an asset.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Prism Engineering Ltd. is an electrical and mechanical consulting firm specializing in existing building systems.&nbsp; We provide consulting for renovations, building improvements and PowerSmart retrofits.&nbsp; See the website for more information.Company:Prism Engineering Ltd.",
	"division" : "Head Office",
	"website" : "http://prismengineering.com/"
}