{
	"id" : "53652",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Jr. Software Developer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Skunkwerks Software is looking for a motivated Jr. Software Developer. The successful application will be working closely with our Sr. Software Developers on product-focused and R&D projects. This position reports to a team of world class developers and will have the full support of our development team.Company Description:Skunkwerks Software Inc. is a Vancouver, British Columbia-based software company that specializes in creating interactive, database-driven, enterprise level rich internet applications – with a focus on tailoring each application to the specific needs of each client.Skunkwerks Software began in the academic biotechnology and life sciences sector, creating Laboratory Management Systems, but the company has since branched out to a wide gamut of software systems ranging from cable television scheduling to workflow intensive business process systems. Our expertise lies in software development consulting with a focus on building lasting and evolving relationships with our customers.Over the last half decade, Skunkwerks has earned the confidence and loyalty of its clientele through its unique approach to application scoping, design, development, implementation and training; the result translating to a maximization of organizational workflows and productivity while simultaneously providing a compelling, dynamic user experience.We pride ourselves in our ability to provide customized, innovative and comprehensive data management solutions.http://skunkwerks.ca",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "SkunkWerks Software",
	"division" : "SkunkWerks Software"
}