{
	"id" : "53662",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Coho Data - Software Engineer",
	"job_location" : "Vancouver",
	"number_of_positions" : "10",
	"salary" : "Competitive Base Salary",
	"frequency" : "Yearly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "Ability to write software programs is a requirement and there will be a programming exercise as part of the interview process.A link to your github or bitbucket account, or any Open Source contributions, would be advantageous but is not required.Get immersed. Join our world-class team of developers in a truly high-technology start-up environment, and gain experience with brilliant people building the right things fast.Make your own contribution.Our products are meaningful and essential to the daily business operation of our customers. Our technology is state of the art and pushes boundaries in fundamental Computer Science research. We are looking for talented and enthusiastic developers to join our product development team.You will be involved in all the aspects of product development lifecycle including design, implementation, validation and documentation.Exposure to a world-class, highly-qualified, practical and productive team of engineers that places a very high value on creativity, ideas, Computer Science. This is a rare and unusual opportunity.We have a great office in South Granville (Broadway & Granville) that is housed with an awesome espresso machine and 2 different kinds of another beverage on tap.&nbsp;",
	"job_requirements" : "Required:* Experienced in Linux/UNIX environment* Ability to design and write softwareDesirable:* Python, C, Makefile or other scripting languages* Debian packaging tools (pbuilder, debs, debootstrap)* Good understanding of computer networking (TCP/IP and Ethernet)* Software source control system (eg. git) experienceOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"end_date" : "08/28/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):School project links, Open Source Links, GitHub Link",
	"company" : "Coho Data",
	"division" : "Head Office",
	"website" : "http://www.cohodata.com/"
}