{
	"id" : "53674",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Co-­Op: Production Tools Infrastructure",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Sony Pictures Imageworks is seeking engineering students for paid co-­op opportunities in 2015 tocollaborate with us on our current slate of VFX and animated feature films.Note: We prefer computer science students in 3rd or 4th year as it is necessary for candidates to have atleast one work term of prior experience.Responsibilities:We are seeking a candidate interested in asset management, data mining, and large scale performancecomputing. This position requires collaboration with in-­house engineers, outside vendors, as well ascompositing and lighting artists. The tools created help to facilitate cutting edge imagery on a wide variety ofshows.About the team-­-­-­-­-­-­-­-­-­-­-­-­-­-­The Core Infrastructure team is responsible for designing, writing and maintaining three-­tier applications andservices used by the entire company. Imageworks has a compute farm with thousands of cores and verylarge amounts of storage to manage.Some of the problems and issues the team works on include:● How to write a distributed multi-­site asset management system that can handle network outagesbetween locations, and across continents?● How to use new distributed databases, e.g., Cassandra, to solve multi-­facility, multi-­masterdatabase problems?● How to manage vast amounts of storage spread over different types of hardware and efficiently andproperly assign the correct storage medium to the type of data that is being stored? How to migrateassets created in one location, to another across great distances?● How to make the best use of thousands of compute cores when there are very disparateSonyPicturesImageworksCanadarequirements for the processes that need to run? Some processes are multi-­day and multi-­threadedothers are only minutes on a single core. How to run all of these processes without disrupting otherparts of the infrastructure?About Imageworks-­-­-­-­-­-­-­-­-­-­-­-­-­-­-­-­http://www.imageworks.com/Sony Pictures Imageworks produces high-­end visual effects for movies, such as the Amazing Spider-­Man 2, and Ozthe Great and Powerful. The company's work has been recognized with numerous awards and nominations,including the Academy Award for Best Visual Effects for Spider-­Man 2.Imageworks proved its all-­CG character animation and production capabilities with the animated short, TheChubbChubbs! which won an Academy Award. Surf's Up received an Academy Award nomination for Best AnimatedFeature. Imageworks is unique in its ability to provide quality digital production for live action, all-­CG, motion captureand hybrid live-­action/animated films. Imageworks prides itself as a community of artists supporting the imaginationand expression of visual storytellers.Today, Imageworks is unique in its ability to provide quality digital production for live action, all-­CG, motion captureand hybrid live-­action/animated films. Its community of innovative digital artists and computer technologistscollaborate creatively with filmmakers, helping them to bring their vision from the storyboard to the theater and delightaudiences around the globe.",
	"job_requirements" : "Required Skills:● Experience programming in Python and C++● Experience with UNIX / Linux● Good communication skills and an aptitude for working in small teamsDesired Skills:● web UI design, Django, extJS frameworks, Java● database programming● unit testing, and continuous integration● Experience writing GUIs using the Qt framework (C++, PyQt or PySide)Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Sony Pictures ImageWorks",
	"division" : "Vancouver Office",
	"website" : "www.imageworks.com"
}