{
	"id" : "53684",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Co-op Software Designer",
	"job_location" : "Coquitlam, BC",
	"number_of_positions" : "1",
	"salary" : "$38,000",
	"frequency" : "Yearly",
	"industry" : "Manufacturing/R&D - Computers/Electronics",
	"company_type" : "Private Business",
	"job_description" : "• Preference given to senior undergraduate studentsYou will be responsible for developing necessary browser pages using HTML5, Web Socket, and JavaScript. You will also be working on the Application Server to collect and ship the data over Web Socket with either C/C++, Java, or JavaScript programming language. Depending on your advancement and the progress of the project, you will be assigned to further responsibilities such as real-time and embedded tasks.",
	"job_requirements" : "- working towards yoru degree in Software Engineering, Computer Engineering, or related discipline- Real-time software for embedded processors- Computer networking, TCP/IP knowledge/experience- Java, C/C++. Matlab- Familiarity with Image Processing methods and techniques, and GUI design and implementation- Knowledge of JavaScript and HTML5- Troubleshooting software including validation and verification techniques&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):cover & resume",
	"company" : "Hermary Opto Electronics Inc.",
	"division" : "Head Office",
	"website" : "www.hermaryopto.com"
}