{
	"id" : "53689",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Development Co-op",
	"job_location" : "Victoria, BC",
	"number_of_positions" : "1",
	"salary" : "$3500",
	"frequency" : "Monthly",
	"job_description" : "Software Development Co-opDo you want to develop production code that will have a real impact on the business’s bottom line and the performance of a global online marketplace?AbeBooks.com - part of the Amazon.com Inc. group of companies - is looking for a co-op software engineer with a passion for technology and proven ability to learn quickly and apply new tools. If you are excited about the kinds of technologies it takes to develop and manage a large scale global marketplace, with thousands of international sellers listing more than 140 million new, used, rare, and out-of-print books, we’d like to meet you.As a member of one of our core agile development teams, you will use tools like Apache Camel, Tomcat, Maven, Spring, JMS and AJAX to extend and enhance a wide range of systems, from buyer and seller registration, through search and inventory management, to order and payment processing. The diversity of these systems ensures that this position offers a broad and exciting range of technical challenges and opportunities.",
	"job_requirements" : "The successful candidate will have the following qualifications: Experience developing with Java 5/6 Experience with Relational databases and SQL Solid understanding of OOD/OOP Solid background in algorithms and data structures Excellent communication skills Able to learn quickly and dive deeply to understand systems and diagnose problemsInterest and knowledge of the following would also be beneficial: Enterprise integration patterns Scalable distributed message oriented systems Distributed caching Large scale document indexing and search Agile practices and methodologies such as Test Driven Development and ScrumOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "AbeBooks",
	"division" : "Victoria Office",
	"website" : "www.abebooks.com"
}