{
	"id" : "53686",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Co-op Student",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Skilled Students Needed to Make Amazing GamesAyogo makes multiple awardwinning social games for mobile and the web that motivate and educate. Helping people improve their lives through games and play is our primary focus.To become a part of our worldclass&nbsp;game makin’ team you must be able to demonstrate&nbsp;working code created outside of your class responsibilities, whether at work or at home. You&nbsp;must be keenly intelligent, enthusiastic, honest, and fun to be around. You must have&nbsp;well-developed&nbsp;skills and a familiarity with modern (ajaxy) web and game UI conventions and&nbsp;capabilities. Most of all, you love games. You will be designing and helping to build game&nbsp;interfaces that inspire change through fun experiences.",
	"job_requirements" : "Due to the breadth of our platform support, we are more interested in hiring the best&nbsp;programmers rather than those with specific technologies on their resumes. Nevertheless,&nbsp;successful applicants will be fluent in several of these technologies:∙ HTML/CSS/JavaScript/JSON∙ Game Development methodologies∙ Mobile Development∙ Ruby, Python∙ PHP∙ MySQL∙ Linux/Mac (sometimes Windows)∙ Java∙ Occasionally some variant of C∙ HTTP/TCP/IPWe are willing to teach you about architecture, teamwork, scalability, process, mobile&nbsp;development and game development. We expect that you've already mastered the core&nbsp;curriculum of clean code, algorithms and data structures. We don't want to mold you in our&nbsp;image. We want to take you to the next level.&nbsp;The Ayogo office is buzzing, the people are fun, and the pace is energetic. We'd love to hear&nbsp;from you!Open To All Majors:Yes",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Project examples via URL.",
	"company" : "Ayogo Inc.",
	"division" : "Obsolete Contacts",
	"website" : "www.ayogo.com"
}