{
	"id" : "53680",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op Software Engineer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "LOOKING FOR BRAINS – CAPCOM VANCOUVERDo you like... braaaaaaaainssss?? We need... more braaaainssss... Fresh, Software Engineer co-op brains.....Capcom Game Studio Vancouver is a member of the Capcom family, located in beautiful Burnaby, BC. Since our early days as Blue Castle Games, our studio has developed and shipped 8 games. Capcom Vancouver’s focus is on developing AAA open world action games using our own Forge engine.Capcom Game Studio Vancouver is recognized for its development of the Dead Rising franchise. Our most recent game, Dead Rising 3, was an exclusive launch title for the Xbox One platform.&nbsp;We’re currently working on two top secret unannounced games, so apply now to see what all the excitement is about!We’ll put your braaaaainsssss to good use! The work you do here will have substance; you will get to work on real features, with real code, and on some pretty sweet projects!Areas of game development YOU could be working on include:Rendering - Everything comes together on the screen, and the latest consoles and PC video cards provide the rendering engineer with a rich palette to represent environments, characters and visual effects in 1/60th of a second. As a rendering engineer you are spending time with Artists to learn and understand what they need to create amazing worlds.Audio - Work with Sound Artists and Engineers to design and implement efficient file streaming, mixing, sound effect tagging and speech logic systems. Audio often requires tools and runtime components to complete features, combining the accessible world of PC programming with the challenges of console systems.Gameplay – Work with Designers and Animators to implement AI and then represent it through animation. Balancing detailed, life-like motion with responsiveness and feel at the controller is a formidable real-time challenge.Tools - Tools and pipelines you could create or improve include animation and level editors, user interface layout tools, scripting systems, automated build systems, shader editors and audio tools. These tools leverage Capcom Vancouver’s internal libraries or integrated environments like Maya.User Interface / Front End (UI/FE) - A great game with a poor user interface is a less compelling experience. As a UI/FE Engineer you're responsible for implementing a quick-loading, responsive, functional and visually appealing interface. You work side by side with Artists and Designers to design and implement the Front End flow, all user interface elements and simulation logic.Online - Online engineering is a challenging and rapidly growing area of expertise. Just having an online section in a game isn't enough anymore, so our Online Engineers work with Designers and Gameplay Engineers to create a unique experience in today's online gaming world.PLEASE INCLUDE ALL AREAS OF INTEREST AND EXPERIENCE IN YOUR COVER LETTER!Visit our site and these links to find out more about our games and studioOur website:www.capcomvancouver.comDead Rising 3 Trailer:http://www.youtube.com/watch?v=ZEn3QIzQcFAIf you love video games, working with brilliant nerdy people and contributing to something that will ultimately be awesome and could potentially save lives, come let us devour your brains now!*Capcom Vancouver offers to pay for return airfare to Vancouver, BC from within Canada*",
	"job_requirements" : "REQUIREMENTS:• In the process of completing your Bachelors of Computer Science, Engineering or Mathematics• Excellent programming and debugging skills in a structured language - C++ / C# is mandatory• Great post-apocalyptic survival skills• Passionate about gaming with an interest to work on Action games• Must be able to keep composure during intense periods of zombie feeding frenzies• Excellent problem solving and analytical skills (can think out of the box to escape from hordes of undead and psychos)• Team player with a positive attitude, leave no survivor behind… unless they are mortally wounded• Able to communicate with both technical and creative team members face-to-face, in writing and through biohazard suitsWHAT WOULD BE COOL:• Experience with scripting languages - Perl, Python, XML• Proficient in weapon wielding, a diverse background is an asset (machete, chainsaw, crow bar, etc)• Experience creating games in your free time• Good understanding of math, specifically 3D Math for rendering• Experience saving other survivors and scrounging for life saving supplies• Networking knowledge• Creative arts experience of any type• Experience in using duct tape to bind various items together to make super weaponsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Capcom Game Studio Vancouver",
	"division" : "Main",
	"website" : "www.capcom.com"
}