{
	"id" : "53683",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Student Research Assistant",
	"job_location" : "Haas Lab, UBC Vancouver",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "The brain is one of the most complex computing systems known to humankind. Understanding how it functions is among one of the most challenging and intriguing questions in science today. At UBC, the Djavad Mowafaghian Centre for Brain Health is a hub for learning, investigation and innovation of both fundamental neuroscience and the engineered technology that allows investigators to answer key questions in the field. In particular, our laboratory, the Haas Lab, is a multidisciplinary laboratory whose primary research consists of understanding how experience influences brain development and of understanding the origins of the neurodevelopmental disorders Autism and Schizophrenia. We achieve this by developing cutting-edge technology to target gene delivery to individual brain neurons, and to capture and analyze images of brain neuron growth and neural network activity in awake animals to determine how altered experience affects brain structural and functional development.",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalComputerElectricalIntegratedMaster of Applied Science in BiomedicalMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in BiomedicalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "UBC, Faculty of Medicine",
	"division" : "Djavad Mowafaghian Centre for Brain Health",
	"website" : "http://www.centreforbrainhealth.ca/"
}