{
	"id" : "53691",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Developer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "RoleAs a Software Developer in the Network Security Group, you will contribute to the design, development and release of software updates to products that’s used by thousands of customers around the world. You will be working on an Agile development team, and be involved in all aspects of the software development process. You will work closely with Product Managers and QA Analysts to ensure the team delivers a quality product to our customers.This role provides a great opportunity to immerse yourself in a fully Agile development team that delivers a quality product to real customers around the world. The team has a healthy ‘continuous improvement’ mentality, so there will also be opportunities to try out new technologies and processes.This position is based at our Canadian office in Vancouver, British Columbia.Main Duties- Work with the relevant stakeholders to understand requirements for particular features of the products- Develop reliable, maintainable, high-quality code that’s well unit-tested- Practice Test Driven Development when writing production code- Work with QA Engineers to help define test ideas and ensure features are properly tested- Help troubleshoot product issues escalated by our Sales/Support staff- Participate in project planning activities with the entire team- Depending on experience and skill, there may be opportunities for other advanced development tasks",
	"job_requirements" : "Experience and skillsEssential skills:- Experience in developing software using C/C++ and Perl- Experience working with commercial Linux-based products- Working knowledge of different networking protocols (e.g. HTTP/HTTPS, FTP, TCP/IP)- Excellent software design, coding, and troubleshooting skills- Able to prioritize, focus and drive tasks to completion- Devotion to producing high quality, high performance systems- Sense of humor and a willingness to have funDesirable skills:- Experience working in an Agile development environment- Experience using Extreme Programming and Test Driven Development practices- Experience in building highly scalable, fault tolerant cloud architecture- Experience working with enterprise-level virtualization products (e.g. VMware ESX/ESXi) in a commercial capacity- Experience in the development of web or virus protection softwareOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Sophos",
	"division" : "Main"
}