{
	"id" : "53695",
	"application_deadline" : "Jan 30, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op Student",
	"job_location" : "Canada",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Extreme Blue is IBM’s incubator for cutting-edge technology. Every summer, top students from across Canada come together in teams of 4 to collaborate and create solutions to real business problems. The projects are actual IBM endeavors and represent product enhancements and futuristic work. Throughout the 15 weeks, teams will pitch their solution to clients, IBM Executives and travel to the IBM HQ in New York to pitch to senior leadership. We are looking for your fresh perspective, creativity, and enthusiasm in designing these solutions!Check out our various social media pages for a peek in to our program.Facebook - www.facebook.com/extremebluecanadaTumblr - www.ibmextremeblue.tumblr.com/archiveTwitter - https://twitter.com/extremebluecanMain Responsibilities include:- Take full ownership of an emerging business opportunity for IBM- Define and develop the technology for a game-changing product opportunity! Patent your solution!- Collaborate with fellow top students, and engage IBM’s technical and business leaders from different teams, divisions, and countries- Perfect your presentation skills as you pitch your solutions to IBM executives in Canada and at the North American Extreme Blue Expo in New York- Learn about IBM’s products and divisions while creating a powerful network and landing your dream job!",
	"job_requirements" : "Qualifications:- Demonstrated passion for technology, business and technical community (i.e. contribution to open source, volunteerism, programming contests)- Proven strong programming skills with a minimum of 8 months of industry experience- Ability to take ownership of an idea and turn it into reality- Strong communication skills and an aptitude for collaborative team workFINE PRINT:1. You must apply for this internship at www.ibm.com/extremeblue. Candidates who only apply through the school's job posting system will not be considered.2. 2015 program will be May 2015 to August 2015. Given the fast-paced nature of the internship, these dates are inflexible. Should you have exams scheduled during the initial portion of the internship, prior arrangements must be made with your university to either defer exams or write these at a designated examination centre in the city of the internship.3. Preference will be given to candidates who are within 12 months of their graduation.For the Summer 2015 session, we are bursting with ideas for ambitious projects involving “hot” technologies like Mobile Business Intelligence, Business Analytics and Optimization, High Performance Computing, and Social Media Analytics.For more information about Extreme Blue, and to apply, visit www.ibm.com/extremeblue.Application deadline is January 30, 2015.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.ibm.com",
	"company" : "IBM",
	"division" : "Extreme Blue"
}