{
	"id" : "53694",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Co-op Student",
	"job_location" : "North Vancouver",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Neptune Bulk Terminals is North America s largest bulk materials handling facility, located on the north shore of the Port of Vancouver’s inner harbor. With a dedicated coal berth and two dry bulk berths, Neptune is capable of handling coal, potash, fertilizers, canola oil, phosphate rock and agricultural products, shipped from all over Canada. Neptune offers prospective students experience in a heavy industrial field with the chance to gain knowledge on reactive, preventative and predictive maintenance. There are a variety of engineers that work at Neptune, with experience in electrical, mechanical, mining, civil, surveying and chemical engineering, so it is possible to gain insight into many of these career choices.The Co-op student will be responsible for a variety of tasks in the planning office and out in the field. The student will work closely with the Mechanical and Electrical planner on a variety of projects and will have the opportunity to be assigned larger projects to be carried through to completion by the end of the term. Due to the fast-paced nature of this position, the prospective student should have very good organizational skills and be able to multi-task efficiently with many projects and tasks on the go.Co-op student tasks and duties may include but are not limited to the following:&nbsp; • Assist planners with project scopes and project packages&nbsp; • Assist with project management and execution&nbsp; • Manage the following preventative maintenance programs:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; o Vibration analysis&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; o Oil samples&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; o Equipment hour logging&nbsp; • Work with and organize maintenance equipment database&nbsp; • Coordinate with vendors and the purchasing department on the following:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; o New inventory additions&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; o Obtaining and evaluating quotes&nbsp; • Update drawings using AutoCAD&nbsp; • Field work:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; o Job / equipment documentation&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; o Establish new maintenance procedures&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; o Assist with external contractor job coordination&nbsp; • Ensure compliance with on-site safety policies and procedures",
	"job_requirements" : "• Related practical experience preferred&nbsp; • Familiarity with AutoCAD preferred&nbsp; • Must have driver's license but access to a personal vehicle is not necessaryOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalMiningUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Neptune Bulk Terminals (Canada) Ltd.",
	"division" : "Neptune Bulk Terminals Ltd",
	"website" : "http://www.neptuneterminals.com/"
}