{
	"id" : "53692",
	"application_deadline" : "Jan 15, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "RESEARCH ASSISTANT/TUTOR",
	"job_location" : "Chalk River, ON or Deep River, ON",
	"number_of_positions" : "1",
	"salary" : "$14.00",
	"frequency" : "Hourly",
	"job_description" : "The Research Assistant/Tutor Position will interest undergraduates, who have completed at least one full year of an undergraduate program in Science or Engineering, and who are looking for a job in research in Science, Nuclear Engineering, Earth Sciences or Environmental Science and who are interested in mentoring youth.Participants work in one of our research partner facilities. Last year our partners included Atomic Energy of Canada Limited, and the National Research Council. This is a two-fold position requiring participants to perform research duties under the direction of a scientist or engineer while also preparing, guiding and supervising high school students throughout the project. Participants are assigned to an original research project and assist the high school students in following through each stage of the project including the completion of a research report. Research areas may include: chemistry, physics, nuclear science and engineering, nanotechnology, biology, environmental sciences and geology.Work Experience Locations: Chalk River, Ontario Deep River, OntarioRate of Pay: Starts at $14.00/hourWork Experience Duration: 16 weeks beginning May 4th, 2015*Workterm:The work term lasts 16 weeks*. The first 8 week period of the work term consists of familiarization with research procedures and protocols, performing research assistant duties, assisting the project supervisor and preparing the project for the students including the creation of learning plans. In the following six weeks, Research Assistants conduct tutor related duties: Guiding students through the research, assisting students with assignments and explaining scientific concepts. The last 2 weeks of the work term is used to complete project details. Research Assistants are expected to work 37.5 hrs/week and participate in some of the recreational activities with the students. Tutors will have continued support from the Principal and Program Director including weekly meetings.Research Assistants will have an opportunity to contact their supervisors prior to their first work day to discuss the details of the project.*Dates may be flexible depending on researcher and applicant’s need.Note: This position requires a Criminal Reference Check.",
	"job_requirements" : "Required Qualifications: Completed at least one year of Science or Engineering Undergraduate Bachelor program Maintain a minimum B+ Average (Transcript required) Tutor/Mentoring Experience is an asset Canadian Citizen or Permanent ResidentOther Information: Research projects cover a wide range of scientific areas and vary each year Telephone interviews will be held during February with job offers going out by the first of March 2013 Accommodation and meals are the employee’s responsibility. Contact DRSA if you require suggestions. Transportation is the employee’s responsibility.&nbsp;Note: Deep River has no public transit.*Dates may be flexible depending on researcher and applicant’s need.Note: This position requires a Criminal Reference Check.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science in GeologicalMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering CivilMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaster of Software SystemsMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.drsa.ca/blog/index.php/summer-employment-opportunities/",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):To download an application for summer employment and for further information visit our website www.drsa.cahttp://www.drsa.ca/blog/index.php/summer-employment-opportunities/Company:Deep River Science Academy",
	"division" : "Deep River Science Academy"
}