{
	"id" : "53709",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Mechanical Engineering/Process Control",
	"job_location" : "TBD",
	"number_of_positions" : "3",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"industry" : "Wood Processing",
	"company_type" : "Private Business",
	"job_description" : "BUILD YOUR CAREER WITH US!When you join Tolko Industries, you are signing on with an industry leader in world markets that has built success&nbsp; through three generations with over 3000 employees and growing.&nbsp; We provide a dynamic environment with competitive compensation where people succeed as our most valuable resource.&nbsp; Our structure and culture encourage innovation, growth, and change in an open environment, and we believe in and practice environmental sustainability.&nbsp;www.tolko.comMECHANICAL ENGINEERING/PROCESS CONTROL(4 or 8 month Co-op Term Summer 2015)Various locations in BC and High Level ABRESPONSIBILITIES/OPPORTUNITIES MAY INCLUDE:• Flow Studies• Capital Installations• Maintenance Process Improvements• Manufacturing Process Improvements• Process Systems Optimization",
	"job_requirements" : "QUALIFICATIONS:• Interpersonal Skills – able to work both independently and in a team environment.• Ability to analyze and troubleshoot.• Computer literate.• Strong organizational skills.• Enthusiastic, positive attitudeOwn transportation may be required for some locations.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):APPLY TODAY!Our tradition of excellence is built on strong company values, a challenging environment, and continuous development.&nbsp; To explore current career opportunities and become a part of our community, visit our website at www.tolko.com.We thank all candidates for their interest; however only those selected for an interview will be contacted.Company:Tolko Industries Ltd.",
	"division" : "Armstrong",
	"website" : "www.tolko.com"
}