{
	"id" : "53707",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Software Engineer Co-op",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "1",
	"salary" : "tbd",
	"frequency" : "Yearly",
	"industry" : "Manufacturing/R&D - Various",
	"job_description" : "We are Océ Display Graphics Systems Inc.We are growing our businessWe want to hire the best and brightestAre You In?Position:3rd or 4th year Software Engineer/Developer or Computer Science co-op studentTerm: 8 months (starting May 2015)Company: Océ Display Graphics Systems Inc., a Canon Company&nbsp;(www.dgs.oce.com)Date Posted: December 18, 2014City:RichmondOcé, headquartered in the Netherlands, is a world-leading supplier of high-quality and innovative products and services used by professionals in print and document management processes.&nbsp; Océ develops and manufactures advanced machines and systems that are renowned for their excellence, reliability, durability and eco-friendliness.Océ Display Graphics Systems Inc. (ODGS), a business group of Océ, a Canon Group Company, develops and manufactures cutting edge digital printing solutions for the fast growing wide format visual communications market.&nbsp; Our inkjet printers produce the stunning colour images you see on billboards, banners and posters, creating a significant impact on the advertising and promotional industry.ODGS employs world-class talent, providing a culture that embraces innovation, passion and performance excellence.&nbsp; We offer a competitive reward package, professional growth opportunities and a dynamic, informal and fun workplace.&nbsp; Join our team and enjoy an inspiring environment where challenging and interesting work is part of daily life.&nbsp; We invite you to check us out at www.dgs.oce.com.Our office is located in Richmond, a suburb of Vancouver.Position:We seek a 3rd or 4th year Software Engineering or Computer Science student to join our R&D Software Engineering team for an 8-month term starting May 2015.&nbsp; This co-op position reports to the Team Manager, Software Engineering.",
	"job_requirements" : "Key Duties and Responsibilities…about our role• Liaise with a wide range of stakeholders to analyze, clarify and recommend accurate requirements• Design, develop, and implement complex applications• Participate in advancing existing code base• Participate in general design reviews, code reviews, etc.Key Skills and Qualifications…about our requirements• Solid academic performance• Excellent English communication skills, both written and verbal• Superior analytical and problem solving skills• Top-notch interpersonal and teamwork skills with strong customer service orientation• Detail oriented, procedural in work flow, aptitude for accuracy• Solid organizational skills• Able to work effectively independently or as part of a multi-disciplinary team• Able to prioritize and manage multiple, competing tasks in fast paced, dynamic environment• Possess a strong can do attitude and hands on approach to deliver superior resultsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:05/01/2015",
	"end_date" : "12/24/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Oce Display Graphics",
	"division" : "Head Office",
	"website" : "https://dgs.oce.com"
}