{
	"id" : "53713",
	"application_deadline" : "Jan 25, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Projects Engineer ? Student (PRO00259)",
	"job_location" : "Fort McMurray, AB",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Projects Engineer – Student (PRO00259)Are you looking for a rewarding career? Then dream bigger and join Syncrude - one of Alberta's top employers. A major producer of crude oil from the oil sands, we are serious about our commitment to secure Canada's energy future through responsible development, and we look to our people to get us results. Syncrude employees contribute in many ways to the achievement of our production and safety targets, and our environmental protection practices. Here, you can work and grow in a dynamic, team-oriented environment, and receive excellent salary and benefits while doing it. Our home community of Fort McMurray is friendly and has all the amenities of city living; even better, it's surrounded by spectacular natural scenery that will make you want to enjoy the great outdoors. Pursue your goals by exploring the many exciting career opportunities with Syncrude.Please note this is a casual work term for students. You must be currently enrolled in a post-secondary program within Canada to be eligible and returning to full-time studies post work term.With Syncrude, you'll enjoy challenging work and a very competitive compensation package. In addition, Fort McMurray based employees receive furnished accommodation and transportation provisions. As well, you will be among a strong, vibrant student population that finds the work term experience both rewarding and memorable.We are looking for Mining, Chemical, Mechanical, Electrical, or Civil Engineering students who think that a career in Project Management might be for them. These students will be placed in one of our Departments within Project Development and Execution (PD&E). PD&E is responsible for the execution of ~$800M in capital projects annually for the foreseeable future and we are developing talent to execute this challenging portfolio. Each of the positions identified below are key experience components in training successful future Project Managers. Depending on the position, you may be based in Fort McMurray, Edmonton or Calgary. The successful applicant(s) will work as an integral part of the project team in one of the following roles in PD&E: Project Development - As a Project Development Engineer, the successful candidate will function as a member of one of the Project Development teams at Syncrude Canada Ltd.'s office in downtown Calgary. Reporting to the Project Manager - Development or Lead Project Development Engineer on specific projects, the successful candidate will apply Syncrude's stage-gate project development process and interact with engineering contractors to support the front-end development of major projects in the areas of scope development, technology/alternative selection, and completion of project deliverables. Project Execution - The successful candidate will function as a member of one of the Project Execution Teams at Syncrude Canada Ltd.'s Mildred Lake Mining Operations in Ft. McMurray. The role may be as Assistant Project Manager, Field Engineer, Construction Specialist or Start-up Engineer. These positions will workdirectly with the Project Managers and Construction Managers and, depending on the assignment, the successful candidate will provide support in one or more of the following areas: preparing deliverables required for project approval; managing individual scopes of work; managing contractors in the field; interfacing with engineering shops; commissioning and start-up of completed facilities. Due to the nature of the responsibilities associated with some of these positions it may be necessary to work a shift schedule. Project Estimating - The successful candidate will function as a member of the Project Estimating Team at Syncrude Canada Ltd.'s Calgary office. The role will provide a wide exposure to a number of differing tasks and activities. This position will require working directly with Project Managers, Construction Managers, and Project Control specialists to build quality estimates following SCL's standard processes. Other activities will be to utilize benchmark information from past projects and industry data to provide confidence in the estimate. Additional tasks such as data mining, lessons learned, estimating tool building and other coordination activities will be assigned as appropriate. Project Engineering - The successful candidate will function as a Project Engineer in one of Syncrude Canada Ltd's Project Teams based in Calgary or Edmonton. These projects are typically Mining Tailings projects and the scope of work involves primarily Piping/Mechanical and Civil/Structural work but may also include Process, Electrical and Instrumentation scope. These positions will require working directly with the Syncrude Canada Ltd. Project Manager on different phases of the project from preliminary design to detailed design. The Project Engineer is the primary Syncrude engineering leader responsible to support all the engineering deliverables per project stage. Syncrude projects requiring engineering are conducted within chosen Engineering Contractor offices in Edmonton and Calgary. Syncrude Project Engineers reside within the Engineering Contractors' office and work directly with the contractors' engineering team.",
	"job_requirements" : "Qualifications Students must be enrolled in BSc Mining, Chemical, Mechanical, Electrical, or Civil Engineering and have completed at least 2 years of the program Available for a 4 or 8 month work term starting in May 2015 Strong interpersonal and communication skills in a team environment are required for all positions A valid Driver's License as well as the ability and willingness to operate a pick-up truck are required for several positionsOther:The candidates must have well developed interpersonal, motivational and team skills, and be able to work independently. Students will work within a dynamic team environment and will be required to interact with other technical staff.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilElectricalIntegratedMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering CivilMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.syncrude.ca",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Candidates applying for these positions must be legally entitled to work in Canada.New graduates are not eligible for student positions.Syncrude Canada Ltd. would like to thank all students who apply to our postings. Please note only that only those selected for interviews will be contacted directly. Please have a copy of your transcripts available for verification if selected for an interview.Application Close Date: January 25, 2015Company:Syncrude Canada Ltd.",
	"division" : "Human Resources"
}