{
	"id" : "53714",
	"application_deadline" : "Jan 25, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Electrical Engineer ? Student (ELE00244)",
	"job_location" : "Fort McMurray, AB",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Electrical Engineer – Student (ELE00244)Are you looking for a rewarding career? Then dream bigger and join Syncrude - one of Alberta's top employers. A major producer of crude oil from the oil sands, we are serious about our commitment to secure Canada's energy future through responsible development, and we look to our people to get us results. Syncrude employees contribute in many ways to the achievement of our production and safety targets, and our environmental protection practices. Here, you can work and grow in a dynamic, team-oriented environment, and receive excellent salary and benefits while doing it. Our home community of Fort McMurray is friendly and has all the amenities of city living; even better, it's surrounded by spectacular natural scenery that will make you want to enjoy the great outdoors. Pursue your goals by exploring the many exciting career opportunities with Syncrude.Please note this is a casual work term for students enrolled in undergraduate studies. You must be currently enrolled in a post-secondary program within Canada to be eligible and returning to full-time studies post work term.With Syncrude, you'll enjoy challenging work, a very competitive compensation package, furnished accommodation, and transportation provisions. As well, you will be among a strong, vibrant student population that finds the work term experience both rewarding and memorable.Work involved may be of a design nature or related to day-to-day communication, electrical, instrumentation or control system support to the operation/ networking/ security. The job posting covers the broad work requirements that are required to be performed in the various business units across Syncrude site. The selected student will be required to perform some of the work requirements depending upon the business units need to which the student is recruited.Day-to-Day Support Work within a team, mentored by a senior technical resource, to investigate and resolve system deficiencies and optimize system performance. Preparation of work packages and bill of materials in support of engineering processes. Preparation of new and revision of existing documentation in support of engineering packages. Collect and verify data, field check equipment for technical information with the assistance of plant electricians, instrument techs, control system specialists, or security group.General duties: Electrical: Motor control, cabling, transmission, generation, relaying, protection, PLC, SCADA and many others. Instrumentation: Instrumentation systems, control schemes, logic, P&ID, loop diagrams, instrument data sheets, SCADA, PLC and many others. Control: Control schemes, P&ID, cause and effect, logic diagrams, DCS and PLC systems and many others. Communications: Radio, telephone, LAN systems and networks, project support, security, and many others. Investigating equipment failures, malfunctions, and reliability problems relating to power systems, instrumentation systems, control systems or control network systems relating to support of the plant operations. Make recommendations and develop work procedures to carry out repairs and improvements safely and efficiently. Work in a Microsoft environment utilizing computer-aided engineering tools in support of your daily work. Learn and utilize engineering tools and systems to create and update engineering information in support of engineered projects.",
	"job_requirements" : "Qualifications: Students must be completing 2nd or 3rd year of an Electrical Engineering program or Computer Science/Computer Engineering discipline. Available for a four month work term starting in May 2015. Good oral & written communication skills. One work term of web programming experience (e.g. ASP.NET). Knowledge of Relational Database Management Systems (e.g. Oracle or SQL Server).Knowledge/ interest in the application and control of one of the following: Power systems (i.e. generation, distribution, motor control, heat tracing, lighting). Process control of process systems OR networking associated with control systems. Measurement of processes and associated instrumentation. Communications systems, wireless and networking. Good communication skills, both written and verbal. A working knowledge of Microsoft Office software packages, including Word, Excel PowerPoint and Access.Other: The candidate must have well developed interpersonal, motivational and team skills. Students will work within a dynamic team environment and will be required to interact with other technical and operations staff.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.syncrude.ca",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Candidates applying for these positions must be legally entitled to work in Canada.Transcripts are mandatory for applicant consideration.New graduates are not eligible for student positions.Application Close Date: January 25, 2015Company:Syncrude Canada Ltd.",
	"division" : "Human Resources"
}