{
	"id" : "53723",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Software Developer (Test Automation)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Position:&nbsp; Software Developer (Test Automation) - 1 PositionCompany:&nbsp; Tantalus Systems Corp.Terms:&nbsp; From May 2015 - Would like a Coop that can do 2 terms back to backThe Tantalus Utility Network – TUNet® – is Smart Grid technology that enables a utility to monitor, control and respond to events anywhere and at any time across its distribution network. It serves as the communications backbone that makes Smart Metering, Power Quality Monitoring, Outage Reporting, Load Control, and Distribution Automation practical and cost effective. The result is more efficient operations, more accurate billing, and the ability for a utility to deliver a high level of customer service.We are seeking a Software Developer (Test Automation) (Co-op) to join our Product development team. This individual will be working with the development team to expand and improve the TUNet Network Management System. Responsibilities would be to understand and use the testing framework and smart meter protocol/behaviour to create test scripts to automate testing of the applications on a variety of smart meters and also work with firmware&nbsp; and software developers, to identify, prioritize and resolve issues. These applications will run on Linux servers and interact with other part of the systems via inter-process messaging and database access.",
	"job_requirements" : "Experience Required:1) Python scripting or PERL2) Linux (GNU toolchain)Experience desired1) Write queries in SQL (ideally on Oracle) and database principles2) Test Automation experiencePersonal Attributes Required:1) Strong verbal and written communication skills in English.2) A passion for innovative design, as well as a strong personal commitment to performance and documentation.3) A high personal commitment to product quality.4) Must be a self starter, flexible, with ability to multi-task.5) Good interpersonal skills including: teamwork, respect & courtesy.Additional constraints1) NSERC funding eligible2) 3rd or 4th year student3) Computer Science discipline4) An 8 month Co-Op term is preferable but not mandatoryOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Tantalus Systems Corporation",
	"division" : "Head Office"
}