{
	"id" : "53722",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Software Developer (Web)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Position:&nbsp; Software Developer (Web) - 1 PositionCompany:&nbsp; Tantalus Systems Corp.Terms:&nbsp; From May 2015 - Would like a Coop that can do 2 terms back to backThe Tantalus Utility Network – TUNet® – is Smart Grid technology that enables a utility to monitor, control and respond to events anywhere and at any time across its distribution network. It serves as the communications backbone that makes Smart Metering, Power Quality Monitoring, Outage Reporting, Load Control, and Distribution Automation practical and cost effective. The result is more efficient operations, more accurate billing, and the ability for a utility to deliver a high level of customer service.We are seeking a Software Developer (Co-op) who is passionate about web technologies and about creating amazing user experiences to join our Product development team. This individual will be working with the development team to expand and improve the TUNet Network Management System. Responsibilities would be to make UIs magical and design highly usable interfaces.&nbsp;",
	"job_requirements" : "Our Technology stack:1) Java, J2EE, Spring, Axis2 -JavaScript, JQuery, Backbone.js2) Oracle (Familiarity with SQL queries)3) Tomcat4) Mercurial5) LinuxPersonal Attributes Required:1) Strong verbal and written communication skills in English.2) A passion for innovative design, as well as a strong personal commitment to performance and documentation.3) A high personal commitment to product quality.4) Must be a self starter, flexible, with ability to multi-task.5) Good interpersonal skills including: teamwork, respect & courtesy.Additional constraints1) NSERC funding eligible2) 2nd year student or higher3) Computer Science or Engineering discipline4) An 8 month Co-Op term is preferable but not mandatory&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Tantalus Systems Corporation",
	"division" : "Head Office"
}