{
	"id" : "53725",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Application Support Analyst: Co-op",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "ZE PowerGroup Inc:&nbsp; Application Support Analyst – Co-op positionTHE OPPORTUNITYIf you are passionate about working with creative people in a stimulating environment at an innovative, expanding company; then we want to hear from you. We are looking for a talented Application Support Co-op Student who will be responsible for managing and monitoring our subscription and managed client environments.As an Application Support Co-op, you will be responsible for providing first line support to clients and installing applications on client sites. We will provide thorough training, a great work environment, a unique corporate culture and reward you for your good work. This position is suitable for ambitious, self-directed students who relish the opportunity to work in a fast growing company and grow as IT professionals.RESPONSIBILITIES• Answer phones and providing first line support to clients• Manage application installations and upgrades in production and demo environments• Monitor and maintain internal and managed client environments• Deploy software changes onto production environments• Create and update software installations and update manuals• Provide data dumps for missing dataABOUT USZE PowerGroup Inc. (ZE) is a global leader in the development of data management, analysis, and business automation software. ZEMA is our enterprise-level suite of products. ZEMA enables users to capture, transform, manipulate, analyze, report and visualize data quickly and easily. We work with world-class companies in energy, commodities, and finance to serve users in trade, risk management and IT. Our head office is in Vancouver, BC, and we have operations in Calgary, Houston, Raleigh, New York, London, Singapore, Madrid, and Maastricht.With a dynamic corporate culture and supportive management team, a career at ZE is what you make of it. Our environment is defined by the people that work in our company. We stress a balanced approach to work and healthy living. We have a games area as well as onsite Yoga. Our head office is located conveniently next to the Richmond Middle Arm waterfront trail, Olympic Oval, and Steve Nash Fitness club. ZE offers excellent career development opportunities along with a competitive compensation and benefits package. If you are the kind of person who takes initiative, has a positive attitude, and wants to make an impact, then we want to hear from you.&nbsp;",
	"job_requirements" : "YOU SHOULD HAVE• Enrolled in a post-secondary education, with focus on Business, Economics, or Computer Science/Engineering• Relevant work experience an asset• Good understanding of web server configurations (such as Apache Tomcat or Websphere) preferred• Experience with Linux an asset• Basic understanding of software and interface development process is preferredCOMPETENCY AND SKILL SET• Strong communication, interpersonal and organizational skills• Ability to explain complex concepts in an understandable and clear manner• Enjoy working with people and sharing knowledge• Good understanding of technical subjects and general business knowledge• Ability and willingness to learn subject matter quickly&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "ZE PowerGroup",
	"division" : "ZE PowerGroup"
}