{
	"id" : "53735",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Intermediate/Senior Electrical Engineering Student",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Intermediate/Senior Electrical Engineering StudentHydroRun Technologies Ltd. is developing the HydroKite™, a new system that produces clean, renewable electricity from rivers, without the need for dams or diversions. Our rapidly growing company is looking for talented, driven individuals who likes technology and a challenge to join our team.About the PositionWorking in a small tech company means your week could involve a bit of anything. Everyone does the jobs that need to be done. The focus of this position though is working with our exceptional engineers to develop and test our 3m, 450kg, underwater robotic kite.Our co-op students work on integral aspects of the HydroKite™ system. You'll gain a diverse range of skills you never even considered, as well as hone the ones your degree is focusing on. By the end of your term you'll have become a better engineer and a company expert in at least one subject or aspect of our project.We believe that fit within the team, personality, resourcefulness and drive are the most important qualities in a HydroRun employee.Location: This position is located at our workshop in central Burnaby. Transport for field testing is provided by the company.Duration: 4, 8, or 12 months.Duties may include: Testing of the HydroKite™ at our field site on the Fraser River Designing and developing power systems, (motors, generators, transformers, power supplies) Embedded systems programming Circuit design Data analysis and system simulationAbout HydroRunHydroRun was founded in 2012 to commercialize the HydroKite™, which is being developed by a team of young and exceptionally talented engineers redefining the integration of robotics, controls, optimization of underwater vessels and power generation.The company is financed by Canadian and International capital management funds and is directed by a board with over 100 years of business and energy experience.For more information, please see our website: www.hydrorun.ca",
	"job_requirements" : "Desired Skills and Qualities: Curious, takes initiative, and self directed Experience safely implementing high voltage systems Experience with Eagle and/or other electrical CAD packages Experience developing real-time firmware Proficiency in circuit assembly and testing Experience with scripting/test automation Experience in the marine or river environment Experience working with new technology Excellent written and oral communication skillsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "HydroRun Technologies Ltd",
	"division" : "R&D",
	"website" : "hydrorun.ca"
}