{
	"id" : "53745",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Technology Analyst Internship",
	"job_location" : "Calgary or Toronto",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Accenture Technology Analyst Intern – Summer 2015Bring your talent and passion to a global organization at the forefront of business, technology and innovation. At Accenture, we appreciate that you have worked hard for your degree. We invite you to discover how great you can be as you put your degree to work delivering tangible value for some of the world’s most prestigious organizations. Join our team and you will collaborate with diverse, talented colleagues and leaders who support your success. Along the way, our industry-leading training and development will assist you in sharpening your skills, as you build an extraordinary career.At Accenture, our consulting teams combine technology, digital and business operations expertise to envision, design and deliver the end-to-end solutions that our clients—the world’s top organizations—need to become high-performance businesses and governments. We mobilize the right people, skills, alliances and technologies to solve complex technology problems and deliver innovative results.Working with Accenture, you may deliver everything from point solutions for a single business function to large complex systems integration installations spanning multiple businesses and functions, to unleashing the power of digital to drive growth, create new sources of value and transform business.ResponsibilitiesAs an Accenture analyst intern, you will have the opportunity to work on complex technology and business projects across a wide range of fields and industries for some of the world’s leading companies and government agencies. Depending on your background, interests and Accenture business need, you will be aligned to a group that will allow you to enhance your skills and grow your career as you take on challenges to provide functional advice, deliver technology innovation, and design and implement solutions that support our clients’ business and IT imperatives. We have a number of challenging and rewarding technology career paths available, including:Operating Groups: Financial Services, Products, Resources, Health & Public Services, and Communication, Media & TechnologyAccenture Technology: Oracle, SAP, Technology Architecture, Emerging Technology Platforms, Emerging Technology InnovationAccenture Digital: Big Data & Analytics, eCommerce, Content Management, Video & Marketing, Mobile Apps & DevicesAccenture Operations: Infrastructure, SecurityYour specific responsibilities will vary based on your alignment, but you may find yourself:Developing innovative answers to complex business and IT challengesDesigning a next generation eCommerce platform or content management systemHelping a client develop analytics and put their data to work for their business and their customersDeveloping a mobile app as part of a client’s strategy to market to and serve customers anywhere on any deviceFocusing on technical architecture, delivery excellence, program management and specialist technology areasBuilding a common set of technology capabilities, across assessment, planning, design and implementationModernizing and driving costs from complex multi-national IT infrastructuresHelping clients design next generation IT architectures to meet their ever changing business needsIdentifying client’s vulnerabilities and designing protection systems to safeguard their intellectual propertyProjecting 3 to 5 years ahead to forecast business needs using cutting edge technology to present innovative solutionsDeveloping a broad set of technology skills, i.e.: SAP, Oracle, SOA, Mobility, Open Source or technology architectureAnalyzing/documenting current processes and technologies, contributing through to the delivery/ integration of new solutionsDesigning and testing new business processes, capabilities, and technologiesLeveraging existing and newly developed programming skills to build portions of client applicationsPaid internships last 10 - 12 weeks and typically begin in late-May/early-June and end in mid-August /early-September. Rising Senior Interns attend a three-day leadership conference in the Chicago area with all Accenture interns from across North America.Accenture is a global management consulting, technology services and outsourcing company, with more than 305,000 people serving clients in more than 120 countries. Combining unparalleled experience, comprehensive capabilities across all industries and business functions, and extensive research on the world’s most successful companies, Accenture collaborates with clients to help them become high-performance businesses and governments. The company generated net revenues of US$30.0　billion for the fiscal year ended Aug. 31, 2014. Its home page is www.accenture.com",
	"job_requirements" : "Basic QualificationsBachelor’s degree or Master’s degree (with a graduation date between December 31, 2015 and August 31, 2016)TN Visa EligibleAbility to meet client travel requirements, when applicablePreferred Qualifications3.0 or higher cumulative (overall) GPAOur preferred majors are: Engineering (all disciplines) , Computer Science / Computer Engineering, Information Systems / Decision Sciences , Mathematics / Statistics / Sciences, Business with IT concentrationProject-based internship experience at a leading company, not-for-profit or government entityCoursework/work experience with programming languages such as C, C++, Java, scripting languages(Perl/Python/Ruby) or similarDemonstrated leadership in professional setting; either military or civilianDemonstrated teamwork and collaboration in a professional setting; either military or civilianOther Professional Skill Requirements and QualificationsA track record of outstanding academic performanceEagerness to contribute in a team-oriented environmentLeadership position(s) in school or extracurricular activityAbility to work creatively and analytically in a problem-solving environmentAbility to meet client travel requirements, when applicableAbility to translate vision statements and abstract concepts into tangible assets or architecturesAbility to learn new technologies quicklyExcellent leadership, communication (written and oral) and interpersonal skillsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://careers.accenture.com/ca-en/jobs/Pages/jobsearch.aspx?keyword=summer%202015",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):How to ApplyApply via your campus career center. Instructions for applying to the Accenture Careers Website will be posted on your campus career center soon. In addition to your campus center resume drop, you must complete an online application by Friday, January 16th EST to be considered for an interview.Successful applications will include a cover letter, resume and transcripts from your undergraduate education, and graduate program (if applicable). Failure to include all documents may result in your application being removed from the process. Candidates must be able to travel and work in the US on client projects.Accenture recruits for entry level positions in several groups across strategy, digital, technology, operations and industry. We will work to align you with the appropriate group based on your background, qualifications, experience, interest and business demand.Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.Accenture does not discriminate on the basis of race, religion, color, sex, age, non-disqualifying physical or mental disability, national origin, sexual orientation, gender identity or expression, or any other basis covered by local law. Accenture is committed to providing veteran employment opportunities to our service men and women.Company:Accenture",
	"division" : "Default Division"
}