{
	"id" : "53747",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Web Developer Co-op",
	"job_location" : "Victoria, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Web Developer Co-opAre you tired of maintaining lame websites and fixing other people’s stuff?&nbsp; Look no further... Red Brick Media is a fun, dynamic Marketing Technology company and we want to add a Web Developer co-op to our incredible team!&nbsp; We are looking for someone who excels at his or her craft, who gets excited about designing high-performance, massively-scalable, database-driven Internet Applications, and who loves being part of innovative, product focused projects.As the successful applicant you embrace complex software development challenges and opportunities, while making it your mission to release high quality products. Ideally you have experience building software that is highly resilient and optimally performing on large distributed systems. The idea of working in an open-concept environment with other talented and motivated people excites you. Must be a team player, have a sense of humor, and have a desire to learn on the job.",
	"job_requirements" : "Qualifications:Must bring to the table:• Advanced understanding and experience with the PHP Language• Web application development using Symfony2/Silex or another MVC-based PHP Framework• Experience working with PostgreSQL or another SQL database• Comfortable with version control, specifically Git(Hub)• Comfortable working in a Unix-like environment (you know your way around a terminal)• Able to create clean and maintainable code from mock ups• Thoughtful about our end-user experience• Strong understanding and hands on experience with common design patternsMajor bonus if you have:• Experience working in an Agile development environment• JIRA, Confluence, Crucible• Apostrophe• Doctrine 2• Experience writing a JSON or XML based API• Github/Bit bucket accounts with active repositories, or• Samples of demonstrating clean, well commented, well executed code• Ping Pong SkillsEducation/ Experience:It would be awesome if you are working towards a B.Sc. in Computer Science, Engineering, Information Systems, but ultimately you need to have equivalent experience and advanced understanding in implementing websites with PHP 5.3 or greater.&nbsp; We would love to hear from you!Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Red Brick Media",
	"division" : "Main",
	"website" : "http://redbrickmedia.com/"
}