{
	"id" : "53744",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 or 12 months",
	"job_title" : "Co-op Software Developer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "$3000",
	"frequency" : "Monthly",
	"job_description" : "Company Descriptionone45 Software is a Vancouver tech company that works with prestigious medical schools across the world. Founded in 2001, one45's solutions are designed especially for the medical education community. Over 70 undergraduate and graduate programs worldwide use one45 to achieve their goals, whether it's automating complex scheduling and assessment processes, curriculum management, learning experience tracking, or meeting accreditation standards.We are a tight-knit, fun-loving group, with offices centrally located in Downtown Vancouver, close to all major transit options. Our work environment is fun and relaxed; our team is diverse and committed to seeing one45 grow. For more information on one45, see www.one45.com.Job Descriptionone45 Software is looking for a Co-op Software Developer to join our fast-growing team. If you love software development, can’t help yourself from obsessively improving everything you see, and have a passion for technology and how it can make work better, you should be first in line for this job.&nbsp;",
	"job_requirements" : "This is a hands-on position where you will be writing code that will be deployed into production. We encourage developers to be skilled and competent in all areas of development at one45. Our development platform uses LAMP with the Symfony framework and we utilize agile and lean methodologies to get the most valuable work done for our clients. We can offer a placement that will give you experience with all of the following:- PHP programming- Symfony Framework- JavaScript and jQuery- Doctrine and MySQL- HTML, CSS, SASS and Bootstrap- Coding new features and fixing bugs- Writing automated tests using PHPUnit- Doing manual testingYour role at one45 will depend on the skills that you bring with you. Our company gets more stuff done with fewer people than most companies, so the impact of one person’s work is very large.&nbsp; We need you to have a keen sense of how your job relates to our goals. Your desire to make our clients happy - and your drive to improve yourself and the company - will make your co-op term with one45 a huge success.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "one45 Software Inc.",
	"division" : "High-tech/Information tech",
	"website" : "http://www.one45.com/"
}