{
	"id" : "53757",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Electrical Engineering Co-op Student",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "25",
	"frequency" : "Hourly",
	"industry" : "Consulting - Various",
	"company_type" : "Private Business",
	"job_description" : "Role:BBA is a privately owned Canadian consulting engineering firm offering leading edge services in the energy and mining & metals sectors. We have over 500 employees in offices across Canada. The current opening is for the Vancouver office that is located downtown.To learn more about BBA, follow us on LinkedIn and join our Talent Attraction Specialist networks: http://www.linkedin.com/company/bba_2.This is a rare opportunity to directly contribute to the company’s growth and development in western Canada. We offer the flexibility, career potential and direct impact to the value chain of a growing company combined with the opportunities and support of a larger corporation.Description:Your role as an Electrical Engineering Co-op Student will be to take part in proposals and engineering projects. Some of the activities in this role are to:• Participate in small to major design projects for utility (substation and generation) and heavy industry clients• Perform calculations both manually and with specialized software• Apply calculation results and design methods• Prepare sketches and drawings• Check work for accuracy and conformity",
	"job_requirements" : "This posting is for a fourth year&nbsp;electrical engineering student.&nbsp;&nbsp;Successful candidate should be:• Client-oriented• Proactive, take initiative and have creative and innovative problem-solving skills• Comfortable working independently and in a teamOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"end_date" : "08/31/2015",
	"hours_per_week" : "37.5",
	"application_receipt_procedure" : "Online via system",
	"company" : "BBA Inc.",
	"division" : "Vancouver"
}