{
	"id" : "53751",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "QA ENGINEER ? 8 MONTH CO-OP OPPORTUNITY",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "ABOUT US&nbsp;Appnovation is one of the world’s leading Open Source Solution Providers.&nbsp; As one of Canada’s fastest growing companies, Appnovation has been recognized on PROFIT Magazine’s “PROFIT HOT 50” list and the Branham Group's Branham300 list multiple times.&nbsp; Headquartered in Vancouver, B.C., with offices in Montreal, Atlanta, and the UK, we are an IT Services Company specializing in developing websites, enterprise content management systems, integration solutions and cross platform mobile/web applications using technologies such as Drupal, Alfresco, Mulesoft, Sproutcore, and Ember.js.&nbsp; We also work very closely with cloud infrastructure companies like Google and Amazon.&nbsp;&nbsp;Appnovation works with a variety of clients across the Media and Publishing, High Tech, Government, Financial Services, Pharma, and Healthcare verticals.&nbsp; We’re the only company in the world that has achieved the highest level of Partner Status with both Acquia and Alfresco, and were recently awarded 2012 Solution of the Year by Alfresco for our Canopy Initiative that focuses on integrating and enabling open source technologies in the Enterprise.&nbsp; With a passionate focus on innovation, we deliver exceptional solutions for our customers while having a great time along the way.&nbsp;WHAT YOU’LL BE DOINGAppnovation Technologies is looking for an enthusiastic co-op student to work alongside the best and brightest minds in the technology industry today. As a member of our team you will be reporting to a Principal and will be engaged in many aspects of the development process including taking part in Agile scrums, working within a team environment and, of course, Quality Assurance!&nbsp;YOUR RESPONSIBILITIES WILL INCLUDE: Writing test casesManual execution of test casesAutomating test cases and coding test suitesWhite box and black box testingSetting up test environmentsTechnical documentationInteract with client providing guidelines and assistance&nbsp;&nbsp;WHAT DOES APPNOVATION HAVE TO OFFER?A fun and dynamic work environment (we have a pool table, dart board, and a PS3)Work that is challenging and rewardingA casual dress code and an open office environmentClubs, social events, yoga and free lunch on Fridays!Rocketing growth – yours and ours. Lot’s of opportunity for personal and professional growth. We are a culture of internal promotions.Exciting and innovative projects. Examples of some of our latest clients include: Pfizer, Elle Decor, Samsung, NBC, Intel, Fox News, MTV, American Express, Kobo, and the Canadian Cancer Society.&nbsp;Students must apply to their university job board (if applicable) in order to be considered for the position. It is highly recommended to include your transcript (official or unofficial) to complement your application.&nbsp;The QA Engineer Co-op role is a part of Appnovation Technologies Co-op Program. This position is open to students who are registered in a Canadian University or College program, have completed a minimum of 1 year of their degree or diploma, and are returning to full-time study upon the completion of their work term. Appnovation is committed to fostering a diverse and representative workforce and an inclusive work environment where all employees are treated equally.",
	"job_requirements" : "WHO YOU ARE:&nbsp;Experience with automated testing and a clear understand of testing methodologyWork or project related experience in PHP, JAVA, HTMLFamiliarity with our core open source technologies, Drupal, Alfresco and SproutCore is a big plusStrong verbal and written communication skillsExceptional analytical and problem-solving skillsSelf-starter and ability to learn quicklyAbility to work on multiple projects in parallel&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Appnovation",
	"division" : "Head Office",
	"website" : "www.appnovation.com"
}