{
	"id" : "53754",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Junior Developer",
	"job_location" : "Victoria, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "About MediaCoreAt MediaCore we are helping change the world of education. Universities and schools all over the world are realizing that video is an essential tool for enabling anyone to learn anywhere, anytime. MediaCore provides an award-winning solution that takes the complexity out of capturing video, building a media library, sharing content, and delivering an exceptional learning experience. We're working with large universities and innovative schools all over the world helping them educate millions of people. If you’re passionate about education, and want to work with an incredible team building tools that are helping make a substantial impact in global education standards, then MediaCore is for you.Job DescriptionWe’re pleased to announce that we’ve got an opening to join our team of awesome designers and developers to come onboard as a co-op developer. You’ll be helping to build new features for MediaCore, from working with our team on new data models to implementing the subtle interaction behaviors that differentiate good software from great software. Working closely with seasoned UI designers and supported by a world-class software-infrastructure team, you can help us in delighting users with both new features and, thanks to our continuous deployment architecture, daily small product enhancements. By the end of your work term with MediaCore, you’ll have increased confidence in Python based web application development, a handle on Javascript, and an understanding of user interface design principles.The craftsmanship of product development is deep in MediaCore’s soul. We work hard to maintain a clean codebase and a culture that are a joy to work in. We’re located in the heart of Victoria in Bastion Square and have a very relaxed atmosphere. Forget cubicles and stiff professionalism and join our youthful team in cranking out a world-class product that is a powerful as it is beautiful.",
	"job_requirements" : "Qualifications:Skills (required and/or preferred):• Proficiency with Python• General knowledge of Linux/Unix• Independent judgment and an individual perspective• Excellent organizational skills• Willingness to engage in the exchange of ideas, while providing and accepting feedback• Quick-thinking initiative• Ability to work independently as well as part of a teamPreferred, but not essential, skills you have might include:• Experience with Javascript frameworks, such as JQuery or MooTools.• Experience in object oriented design and methodologies including MVC• Experience using MYSQL 5 or PostgresqlOur CultureGreat Ideas.We’re really passionate about solving the big problems facing educational institutions as they look to improve student outcomes.Video is increasingly becoming a huge component of the way that many people learn globally and we’re only starting to see how video can help all kinds of educational institutions. We are always looking for new ideas on where to take our products next. We’d love to hear some of your ideas on how video and technology could be integrated into educational institutions.Award Winning Technology.If you enjoy working with engineers and designers who build really awesome software, then look no further. In 2013, FastCompany ranked MediaCore as one of the “Top 10 Most Innovative Companies in Digital Video” alongside Hulu and YouTube. And while we’ve been thrilled with that nomination (along with 8 other awards we’ve won this year), we’re really motivated by coming into work every day and just building a great product that’s solving real problems.Our team is passionate about Open Source technology. We love things like Git, Python, Ruby, and HTML5, but we especially love combining all these things with design and aesthetics that are unrivaled in our industry and are making a big impact in the classroom.Startup Mentality.We’re not a big company and sometimes we all need to chip in to get the job done. This is the way things happen at a startup. You must be prepared to go beyond your role and appreciate that our nimbleness is actually our greatest strength.Energy.We’re a pretty flexible employer, but when we do work it needs to be energetic and inspirational to those around us. You need to be hands-on, passionate, persistent and creative. Ultimately you want to get things done, and have fun doing it.Adaptability.Being able to adapt to change when necessary is important for us. As a fast-growing company, we are often changing gears and shifting focus onto new features, goals and priorities. We value those who are able to keep up with those shifts.Fun.We want you to enjoy coming to work each day. We’ve been known to host some pretty awesome social events - from pirate parties on tall ships to camping trips to wine tastings at local vineyards. If you like to have fun once in awhile, you’ll definitely want to consider working for us.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://mediacore.bamboohr.com/jobs/view.php?id=8",
	"company" : "MediaCore",
	"division" : "Canada",
	"website" : "www.mediacore.com"
}