{
	"id" : "53753",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Research Intern",
	"job_location" : "Montreal, Quebec",
	"number_of_positions" : "3",
	"salary" : "1500",
	"frequency" : "Monthly",
	"industry" : "Academic Research",
	"job_description" : "Three summer stage positions (4 months or longer) are available in the Ultrafast Optical Processing Group at Institut National de la Recherche Scientifique (INRS) in Montreal, in the Énergie Matériaux Télécommunications (EMT) center.INRS-EMT is an expanding, graduate degree-granting research institute located in the beautiful, dynamic and multicultural city of Montreal (in particular, Montreal was recently elected as the top city in the world in terms of quality of life, according to several independent pools).INRS, the research-oriented branch of Université du Québec, is renowned as the top Canadian research university in terms of publication and research intensity (RE$EARCH Infosource 2014, Comprehensive category). Our center (INRS-EMT) is devoted to the development of cutting-edge research programs in a variety of technological areas, including photonics, nanotechnologies, and telecommunications. Following a strong development of our facilities, we are now equipped with state of the art laboratories and instruments (worth over $100 million) for device fabrication and characterization. For more information on our Center, please visit: http://www.emt.inrs.ca.Our group (UOP) is currently investigating innovative approaches in photonics based on various free space and integrated technologies. Our focus is in the following applications: (i) design and realization of novel integrated devices for all-optical signal processing; (ii) study of fundamental light-matter interaction properties in micro and nano guides; (iii) investigation of novel electro-optic, magneto-optic and nonlinear materials for optoelectronics and quantum optics applications, i.e. quantum communications/computing (iv) realization of extreme terahertz sources for THz imaging and nonlinear THz optics. The work we are conducting (reported on in high impact journals like Physical Review Letters, the Nature series, - Nature, Nature Photonics, Nature Physics, Nature Communication, etc. - and recognized with several prestigious awards) involves both theory and experimental work, and has several industrial links. In fact, the group has recently been awarded with significant funding to further enhance its already outstanding experimental facilities. For more information on our group, please visit: http://www.uop.ca.Research work may involve numerical and/or experimental research for a variety of projects. Could include:&nbsp;• Design and simulation of waveguides• Utilizing COMSOL Multiphysics® for design optimization• Modeling effects of wave guiding processes (dispersion, coupling, losses) in MATLAB&nbsp;• Creating experimental setup and managing data acquisition• Familiarization with various lasers as well as bulk optical components (beam splitters, mirrors, lenses, half wave plates, polarizers, objectives, cameras, spectrometers)• Learning experimental techniques such as alignment, coupling, and gained practical experience(see website for more information)If you are a driven student looking to work within a productive research group in any of the research fields listed above please contact Prof. Morandotti (morandotti@emt.inrs.ca) by e-mail (CC piotr.roztocki@emt.inrs.ca for all correspondence). Your university education should be in Physics, Engineering Physics, Electrical Engineering, Telecommunications or related fields.",
	"job_requirements" : "For the present positions a strong academic background and an excellent record of achievements are required. Specifically, excellent grades obtained during your B.Sc./B.Eng. studies, research experience, and a proactive attitude are the ideal requirements for your application to be evaluated positively.In turn, excellent work conditions (in addition to an adequate salary) will be offered if you pass the selection process (note that you need to be a Permanent Resident or a Citizen of Canada to apply).Please send the following documents together with your application:1. Cover Letter2. Detailed CV3. Two Reference Letters (preferably previous Supervisors or Professors of the candidate)4. University transcript with conversion table, if applicable&nbsp;INRS is a French speaking institution (however, a previous knowledge of French is not required at the moment of the application). A good knowledge of the English language and an independent and enthusiastic scientific attitude are the additional requirements for these positions.Note: Undergraduate students in their final year of study are especially encouraged to apply.IF INTERESTED PLEASE REPLY BEFORE January the 16th, 2015Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:05/01/2015",
	"end_date" : "08/31/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):See description",
	"company" : "INRS-EMT",
	"division" : "Ultrafast Optical Processing Group"
}