{
	"id" : "53769",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Verification Engineer",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "tbd",
	"frequency" : "Monthly",
	"job_description" : "Kardium is a technology pioneer developing devices to address cardiovascular diseases. The company was founded in 2007 by a team with a track record of excellence in medicine, business, and engineering. Focused on building a world-class, internationally dominant medical device company, we believe in having lots of fun while working hard.Kardium is developing a novel catheter-based system for the treatment of atrial fibrillation.&nbsp; We are looking for a co-op student to join our Testing Team in activities related to the design, construction, and use of apparatus for manufacturing and testing of medical devices.&nbsp; You will receive design requirements to be tested from R&D engineers, and will apply those requirements to generate a test concept which will be reviewed and approved by team members.&nbsp; You will then be involved in fabrication, installation, and commissioning of the test equipment, and will ensure that the system meets performance requirements.&nbsp; Once validated, the testing equipment will be applied to prototype devices and the output from that testing will be used to help inform design refinements to the device.You will be required to develop and maintain test protocols, and to carefully document the design of the testing apparatus, the execution of tests, and the test results. Depending on your aptitudes and interests, the role may involve mechanical, electrical, or full-system testing.&nbsp;",
	"job_requirements" : "The successful candidate will:* Have a demonstrated ability to work in a detail-oriented manner in a laboratory or workplace setting* Have a strong grasp of mathematics and analysis tools* Be highly proactive and able to execute tasks with minimal instruction and guidance* Be enthusiastic about finding innovative solutions to unforeseen challenges* Have experience with mechanical design and hands-on mechanical ability* Have a history of success working in a team setting* Be amenable to working in a dynamic environment, involving multiple, concurrent project workThe following factors are greatly desired and will greatly increase the suitability of the candidate:* Strong written and verbal communication skills* Experience using SolidWorks, machine-tool operation, and CAM programming* Experience using electrical CAD tools, particularly AltiumOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Kardium Inc.",
	"division" : "Kardium"
}