{
	"id" : "53775",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Controls Systems Engineer",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Hourly",
	"industry" : "Professional Services",
	"company_type" : "Private Business",
	"job_description" : "Brock Solutions is an engineering solutions and professional services company specializing in the design, build, and implementation of real-time solutions for broad based industrial/manufacturing and transportation/logistics organizations globally. With approximately 300 employees in Canada and the U.S., Brock Solutions is a privately held, employee owned organization with over 20 years in the real-time solutions space.Employees are given inspiring opportunities to travel across the country and participate in multi-million dollar projects with recognizable brands. If you are looking for the opportunity to get hands-on work experience in the industrial controls industry, then the Controls Systems Engineer co-op position at Brock Solutions is the job for you!Working with other highly motivated Engineers, you will be involved with integrating, troubleshooting, and programming electrical controls.Responsibilities:- PLC programming- Electrical design- Designing/programming of Human Machine Interfaces (HMI)- Supporting project proposals and estimation- Preparing functional specifications- Performing other duties as assigned by Project Manager",
	"job_requirements" : "- Excellent communication skills, both verbal and written- Understanding of PLC programming- Interest in hands-on work- Degree in Electrical Engineering, Mechatronics, Systems Design, Automation, Industrial Engineering, or College equivalentOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:01/05/2015",
	"end_date" : "08/31/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Resume, transcripts and any prior co-op evaluations",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Visit www.brocksolutions.comfor more information on our company!Company:Brock Solutions Inc.",
	"division" : "Main"
}