{
	"id" : "53774",
	"application_deadline" : "Jan 20, 2015 0800AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Equipment Design Support",
	"job_location" : "107 - 998 Harbourside Drive",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"industry" : "Manufacturing/R&D - Various",
	"company_type" : "Private Business",
	"job_description" : "Description of Employer / Company:Confirmed Automation Systems is a growing company located in North Vancouver that specializes in productivity and efficiency improvement projects.&nbsp; We help our customers using process control and mechanical improvements to create substantial gains in productivity and efficiency with their operations.&nbsp;Our company is working in the bulk material handling (ports), food and beverage, and manufacturing sectors.&nbsp; Customers are located in the United States and Canada.Projects:Production Data Collection and Reporting:&nbsp;Configuration of our customer’s data historian collecting data from fully automated product handling systems.&nbsp; Development of production reports for our shipping terminal customer in the Port of Vancouver.Bulk Filling Equipment:&nbsp;We have completed numerous projects upgrading bulk filling equipment in the food and beverage industry.&nbsp; This project will involve design of a new bulk box filler, focusing on gentle product handling and fill weight accuracy.Controls Design Support:&nbsp; Designing controls on a number of industrial projects includes detailed review of equipment performance, followed by control algorithm design and instrumentation selection.&nbsp;Net Zero Greenhouse:&nbsp; Working with our customer to develop controls and monitoring for their greenhouse system prototype being developed in New York.&nbsp; The greenhouse will use new environmentally friendly technologies to minimize environmental impact.Student Contribution:• Design support on electrical and instrumentation modifications and new equipment – using Solidworks Electrical• Design support on mechanical modifications of existing equipment and development of new equipment• Solidworks modeling of new equipment• Selection and purchasing of components• Programming of (PLC) controllers• Development of HMI (interface) Screens• Support with design and assembly of new equipment and the control panels.• Customer site visits",
	"job_requirements" : "Beneficial Skills:• Prefer 3 year minimum academic completed• Mechanical with Mechatronix & Electrical• Familiarity with Solidworks 2014 for Mechanical Designs• Familiarity with Solidworks Electrical for Electrical Designs• Understanding of instrumentation• Understanding of industrial automation systems• Interest and capability with design and building of control panels• Interest and capability with design and building of pneumatic circuits• PLC programming• Understanding of low voltage electrical circuits• Capability with Visual Studio C#• Able to work independently and meet deadlines• Effective interpersonal and communication skills.• Proficient spoken and written English.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Confirmed Automation Systems",
	"division" : "Confirmed Automation Systems"
}