{
	"id" : "53779",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op Student Job Description-Energy Storage",
	"job_location" : "Vancouver,BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "A co-op position is available for the summer of 2015 in the research group of Professor David Wilkinson in the Department of Chemical and Biological Engineering. The project involves development of advanced materials, electrode structures, and electrochemical cells for low cost, environmentally friendly energy storage devices. The co-op candidate will be directly involved in these aspects of the research and will closely work with a research associate in the lab. The student will learn very relevant electrochemical skills (potentiostatic/galvanostatic and impedance measurement), materials characterizations (X-ray diffraction, Scanning Electron Microscope), electrode preparation and cell assembly. This is an industrially-supported project. Supervision and guidance will be provided on a daily basis by a research associate and graduate students, who are engaged in this project.",
	"job_requirements" : "The position is hands-on and requires general knowledge of laboratory work and a high interest in performing experimental research in the lab.Students are highly encouraged to apply for an NSERC USRA scholarship. Further information about NSERC USRA scholarships can be found at: http://www.nserc-crsng.gc.ca/Students-Etudiants/UG-PC/USRA-BRPC_eng.aspOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalComputerElectricalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "UBC, Dept. of Chemical and Biological Engineering",
	"division" : "Default Division"
}