{
	"id" : "53777",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Software Developer",
	"job_location" : "Richmond BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Hourly",
	"industry" : "Professional Services",
	"company_type" : "Private Business",
	"job_description" : "Brock Solutions is an engineering solutions and professional services company specializing in the design, build, and implementation of real-time solutions for broad based industrial/manufacturing and transportation/logistics organizations globally. With approximately 300 employees in Canada and the U.S., Brock Solutions is a privately held, employee owned organization with over 20 years in the real-time solutions space.Employees are given inspiring opportunities to travel across the country and participate in multi-million dollar projects with recognizable brands. As a developer at Brock Solutions, you will get the opportunity to explore the newest technologies, designs, platforms, and programming concepts. Innovative ideas are encouraged and used throughout the lifecycle of our applications.Responsibilities:- Design, develop, and maintain multiple applications and services- Develop reporting capabilities- Detect, report, investigate, and fix defects- Perform other duties as assigned by Project Manager",
	"job_requirements" : "- Experience with C#, C++, Java, ASP.NET, SQL- Have a strong desire and the ability to learn and use new technology- Excellent communication skills, both verbal and written- Be detail-oriented and able to multi-task efficiently- Bachelor's degree in Mechatronics, Systems Engineering, Software Engineering, Computer Science, or College equivalentPlease include a soft copy of your school transcripts with your application (unofficial version is fine).Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaster of Software SystemsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Resume, transcripts and any prior co-op evaluations",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Visit www.brocksolutions.comfor more information on our company!Company:Brock Solutions Inc.",
	"division" : "Main"
}