{
	"id" : "53780",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op Student",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "A co-op position is available in the research group of Prof. David Wilkinson (Department of Chemical and Biological Engineering, UBC). The project involves development of novel nanostructured electrocatalysts to improve the performance of the oxygen reduction reaction (ORR) and/or the oxygen evolution reaction (OER). These reactions significantly affect the electrochemical performance of clean energy conversion devices such as fuel cells, metal-air batteries, and electrolyzers. The position is hands-on, covering various aspects of catalyst synthesis, characterization, and performance evaluation.",
	"job_requirements" : "Prior knowledge of electrochemistry and general laboratory work experience are an asset. Data analysis and interest in experimental work are required. The student will work closely with a research associate in the lab and will learn synthesis, characterization, and relevant electrochemical measurements (e.g., potentiostatic / galvanostatic and impedance measurement) and analytical skills, analytical quantification, and electrochemical cell assembly.Students are highly encouraged to apply for an NSERC USRA scholarship. Further information about NSERC USRA scholarships can be found at: http://www.nserc-crsng.gc.ca/Students-Etudiants/UG-PC/USRA-BRPC_eng.aspOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalComputerElectricalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MaterialsMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "UBC, Dept. of Chemical and Biological Engineering",
	"division" : "Default Division"
}