{
	"id" : "53781",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op Student-Fuel Cell Catalyst and Membrane Architecture Development",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "The research group of Professor David Wilkinson of the Chemical and Biological Engineering department at UBC is seeking a motivated student to join a new fuel cell project for the summer. Polymer electrolyte fuel cells are a promising energy conversion technology but reducing costs and improving system durability are key to expanding commercialization. This project aims to address these issues through the development of novel integrated catalyst and membrane architectures. The position is hands-on, covering all aspects of the research process from experimental design and data collection to analysis and reporting of results. Examples of potential activities include synthesis of catalyst-coated membranes, measurement of catalytic activity and active surface area in 3-electrode electrochemical cells, fabrication of novel membrane-electrode assemblies, and full fuel cell testing.",
	"job_requirements" : "This position requires a student who can run experiments and determine conclusions from the data. Interested candidates should be able to think critically to solve problems and manage their time effectively. Prior knowledge of fuel cells and/or electrochemistry as well as previous experience working in a laboratory environment would be an asset. The student will work in close collaboration with a postdoctoral fellow and will learn a variety of relevant electrochemical techniques (e.g. cyclic voltammetry, impedance, fuel cell testing), develop strong analytical skills, receive mentorship in good lab practices, and gain valuable exposure to the cleantech industry.Students are highly encouraged to apply for an NSERC USRA scholarship. Further information about NSERC USRA scholarships can be found at: http://www.nserc-crsng.gc.ca/Students-Etudiants/UG-PC/USRA-BRPC_eng.aspOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalComputerElectricalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "UBC, Dept. of Chemical and Biological Engineering",
	"division" : "Default Division"
}