{
	"id" : "53789",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Automation Test Developer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "We are looking for talented students with test development experience&nbsp; that like to break web application code using an arsenal of tools. You will work with scripting languages and tools like Selenium, Sauce Labs, curl, bash shell and others to help run your tests without a lot of manual effort.We have a casual work environment with a bunch of bright people engaged in solving problems that nobody else is - if you are an enthusiastic&nbsp; Test Developer who is interested in working with web applications and IP networking, then please read on!Job Responsibilities:• Work closely with the development testing teams to design and setup automated tests using Selenium and Sauce Labs&nbsp;• Review software requirements and design detailed test cases based on requirements ensuring sufficient coverage and correctness• Be innovative as you develop tests and tools that increase the efficiency of product validation• Communicate issues by creation of well-written detailed issue reportsWhat we offer:We’ve created a fun, casual work environment that lets you work to your maximum potential. This is a great opportunity to join an unbeatable team who cares as much about getting a job well done as you do. Ideally located in the heart of Gastown, we have a great open office layout in a building that's close to all major transit services.AppNeta provides SaaS solutions for exceptional performance of business-critical applications. By bringing together server-based application performance insight, network-based application performance insight and comprehensive end-user experience monitoring, AppNeta solutions enable customers to easily find and fix performance issues in the application, through the network, to the end user. This broad and granular level of visibility gives customers all the insight they need to see across Web, mobile and cloud-delivered applications to identify tough performance bottlenecks. For more information or to get started today, please visit www.appneta.com.",
	"job_requirements" : "Requirements:• Experience working with Selenium• Worked with one or more of Java, PHP, Python, Ruby, C#.&nbsp; Java preferred, not mandatory.• Driven to coordinate with developers and testers on what needs to be tested and how best to design the tests.• Meticulous with organizing and maintaining your scripts and test cases• Great communication skills• Comfortable working in Linux environments.• Interest in working with distributed web architecture/SaaS environments.• Excellent analytical and troubleshooting skills• Interest in IP networks, VoIP, network management, and distributed systemsBonus:• Experience with SQL and relational database systemsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "AppNeta",
	"division" : "Head Office"
}