{
	"id" : "53788",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Tester",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Do you want to combine your passion for software and cool technologies with an atmosphere that is fun and promotes personal growth?We’re looking for several co-op students to join our talented organization that is committed to delivering some of the best software around. You will be a valuable member of our team working with very experienced testers.&nbsp; You will be ensuring that our product is ready to go into the hands or our customers.&nbsp; Through your term you will see many released go out the door. And what you’ll learn about IP networking isn’t taught in school.AppNeta delivers instant-value network performance management solutions required to drive exceptional application performance across all data center, cloud, remote office and mobile environments. With more than 1,000 customers worldwide, AppNeta provides unmatched performance insight to network engineers and IT outsourcers.With the excitement and upside of a startup, and the customers and reputation of an established company, we offer the best of both worlds. We work together, inspiring and mentoring each other to build great products, having fun along the way and celebrating our successes.Situated in the heart of Gastown, we have an open office layout in a character building that's close to all of the major transit services. For more information about our company, visit www.AppNeta.com.Responsibilities:Design and execute test cases, using an understanding of the underlying technologies and software testing principlesReport detailed product defect reports and verify software fixesConfigure and enhance test environment including lab setup, test tools and automation scripts.Communicate and collaborate with team through requirements and test case reviews, status reports, meetings, etc.",
	"job_requirements" : "Requirements:Pursuing a degree in Engineering or Computer Science or equivalentExcellent analytical and troubleshooting skillsUnderstanding of the Software Development Life CycleStrong written and verbal communication skillsExperience working with one or more of the following would be a benefit:Knowledge of software testing techniques, methodologies and practicesAdvanced Windows and Linux experienceExperience with test automation (Selenium, etc.)Experience working with databasesFamiliarity with Java or C++ programmingInterest in IP networks, VoIP&nbsp; network management, and distributed systemsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "AppNeta",
	"division" : "Head Office"
}