{
	"id" : "53785",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Co-op Software Engineer",
	"job_location" : "Gastown, Vancouver",
	"number_of_positions" : "1",
	"salary" : "Based on Experience",
	"frequency" : "Monthly",
	"industry" : "Finance, Insurance & Real Estate",
	"company_type" : "Private Business",
	"job_description" : "SpaceList is a marketplace for office, retail and industrial space. We host 1/2 billion square feet of available space and generate over 100 inquiries each day.You need to be able to put yourself in our users’ shoes, understand their issues, and design a solution that will knock their socks off. You must draw insight from feedback and get your ideas across clearly & concisely. You are not afraid to roll up your sleeves and do what needs to get done... whether it is a quick bug fix or a writing a complex algorithm. You’re equally comfortable at the top of the stack as you are at the bottom. Whether it’s tweaking CSS layout issues or getting a database model into third normal form. Above all else, you are an excellent communicator and collaborator.",
	"job_requirements" : "• Working knowledge of AngularJS, Ruby on Rails, PostgreSQL, and ElasticSearch are a huge plus.• Knowledge of the Unix command line is essential.• Ability to work independently or in a small team.• 4 or 8 month terms available.• SpaceList is a bring your own computer workplace.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"hours_per_week" : "37.5",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):GitHub, StackOverflow, or Personal Site if they represent the applicant's knowledge and abilities.Company:SpaceList Commercial Listings Ltd.",
	"division" : "Engineering",
	"website" : "http://spacelist.ca/"
}