{
	"id" : "53790",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "C++ Software Developer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Do you want to combine your passion for software and cool technologies with an atmosphere that is fun and promotes personal growth?We’re looking for several co-op students to join our talented development organization that is committed to delivering some of the best software around. You will be a valuable member of our team.&nbsp; You will start out working closely with other developers on production software and your responsibilities will increase through your term to feature development.&nbsp; And what you’ll learn about IP networking isn’t taught in school.AppNeta delivers instant-value network performance management solutions required to drive exceptional application performance across all data center, cloud, remote office and mobile environments. With more than 1,000 customers worldwide, AppNeta provides unmatched performance insight to network engineers and IT outsourcers.With the excitement and upside of a startup, and the customers and reputation of an established company, we offer the best of both worlds. We work together, inspiring and mentoring each other to build great products, having fun along the way and celebrating our successes.Situated in the heart of Gastown, we have an open office layout in a character building that's close to all of the major transit services. Please take the time to learn more about us at www.AppNeta.com.Responsibilities• Design and implement network level programming using Linux and C++• Enhance the system and network configuration software of a Linux based network appliance• Ensure high quality of components through good development practices, including design and code reviews, unit testing, etc.• Communicate and collaborate with team through Wiki, scrum, design meetings, etc.",
	"job_requirements" : "Requirements• Pursuing a degree in Engineering or Computer Science or equivalent• Experience with and solid understanding of OO analysis, design and implementation• Excellent C++ programming skills• Strong written and verbal communication skillsExperience working with one or more of the following would be a benefit• Experience programming and debugging in Linux using gcc and Windows using Microsoft Visual Studio• Experience with sockets and other network level programming• Web interface development using HTML, javascript and perl• Practical experience with XML• Exposure to ACE, a network programming toolkit• Interest in distributed applicationsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "AppNeta",
	"division" : "Head Office"
}