{
	"id" : "53797",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Software Developer (8 months term)",
	"job_location" : "Richmond",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Company Description:&nbsp;&nbsp;Ensemble is a consulting organization delivering services for some of the biggest companies in the world across different platforms, including iOS, Android, Windows Mobile, XBOX Platform, web, desktop, and set-top boxes. &nbsp;For more information visit us at http://www.ensemble.com&nbsp;&nbsp;&nbsp;Collaborate with fellow developers and engineers to conceive design ideas for applications that meet customer requirements.&nbsp; Implement design ideas using object oriented programming languages, as well as perform quality assurance on your code.&nbsp; Participate in review sessions with peers and customers as required.&nbsp;&nbsp;",
	"job_requirements" : "Skills Required:&nbsp;Experience with object oriented language, Java, or C#, preferablyGood working knowledge of XMLExperience with web development methodology (Flex, HTML/JS) is an assetExperience with mobile development platforms (iOS, Android, Windows Mobile) is an assetExperience with java script or action script is an assetExcellent communications and time management skillsHave a good understanding of software engineering practices&nbsp;Discipline you wish to hire from:&nbsp; Computer Science, Engineering ScienceAny other special qualifications you may have:&nbsp; Prefer Senior students (students who are close to graduation); although junior students may be suitable based on fit and desire to learn.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Ensemble Systems Inc.",
	"division" : "Main"
}