{
	"id" : "53792",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Database/Report Developer:",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "We’re looking for a co-op student to design and develop database structure and reports for a reporting system. The system will provide invaluable data on the usage and trends of the company’s PathView Cloud service to the executive and department leaders. You will join several other co-op students in the organization and work closely with other members of the development team.AppNeta provides powerful remote network performance management solutions that deliver end-to-end network visibility to ensure the delivery of performance critical applications such as VoIP, Video, VDI and disaster recovery to remote business locations.With the excitement and upside of a startup, and the customers and reputation of an established company, we offer the best of both worlds. We work together, inspiring and mentoring each other to build great products, having fun along the way and celebrating our successes.Situated in the heart of Gastown, we have an open office layout in a character building that's close to all of the major transit services. For more information about our company, visit www.appneta.com.Responsibilities:• Design and develop database schema, views, and stored procedures• Design and develop interactive reports with Google Visualization JavaScript library• Contribute to product development activities related to database and reporting• Ensure high quality of work through good development practices, including design and code reviews, unit testing, etc.• Communicate and collaborate with team through status reports, Wiki, design meetings, etc.",
	"job_requirements" : "Requirements:• Pursuing a degree in Engineering or Computer Science or equivalent• Experience with database design and development• Strong knowledge of SQL• Strong written and verbal communication skillsExperience working with one or more of the following would be a benefit:• Experience with Postgres or MySQL• Web application development experience with jQuery• Excellent JavaScript programming skills• Experience with report development• Interest in IP networks, VoIP, video/IP, network management• Interest in distributed applicationsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "AppNeta",
	"division" : "Head Office"
}