{
	"id" : "53791",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Java Web Developer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Java Web Developer:&nbsp;&nbsp;&nbsp;Do you want to combine your passion for software and cool technologies with an atmosphere that is fun and promotes personal growth?We’re looking for several co-op students to join our talented development organization that is committed to delivering some of the best software around. You will be a valuable member of our team.&nbsp; You will start out working closely with other developers on production software and your responsibilities will increase through your term to feature development.&nbsp; And what you’ll learn about IP networking isn’t taught in school.AppNeta delivers instant-value network performance management solutions required to drive exceptional application performance across all data center, cloud, remote office and mobile environments. With more than 1,000 customers worldwide, AppNeta provides unmatched performance insight to network engineers and IT outsourcers.With the excitement and upside of a startup, and the customers and reputation of an established company, we offer the best of both worlds. We work together, inspiring and mentoring each other to build great products, having fun along the way and celebrating our successes.Situated in the heart of Gastown, we have an open office layout in a character building that's close to all of the major transit services. Please take the time to learn more about us at www.AppNeta.com.",
	"job_requirements" : "Responsibilities:• Design and implement dynamic web applications using Spring MVC/WebFlow,&nbsp; JSP, HTML, HTML5, JavaScript, Java/J2EE technologies• Ensure high quality of components through good development practices, including design and code reviews, automated unit testing, etc.• Communicate and collaborate with team through status reports, Wiki, design meetings, etc.Requirements:• Pursuing a degree in Engineering or Computer Science or equivalent• Experience with OO analysis, design and implementation• Excellent web and Java development skills including experience with HTML5, CSS, JSP, and JavaScript• Strong written and verbal communication skillsExperience working with one or more of the following would be a benefit:• Exposure to Spring Framework and Spring WebFlow/MVC• Exposure to Rich Internet Application (RIA) technologies: HTML/5, jQuery, Ajax, other JS frameworks and libraries• Database design and programming using JDBC/SQL/Hibernate• Practical experience with XML• Interest in Web Application Performance, IP networks, VoIP, video/IP, network management• Interest in distributed applications and cloud based computingOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "AppNeta",
	"division" : "Head Office"
}