{
	"id" : "53798",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "September 2014",
	"length_of_workterm" : "8 months",
	"job_title" : "Programmer/Co-op Student",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Programmer/Co-op StudentRoadhouse Interactive is looking for co-op students to join our studio as Programmers for 4 or 8 or 12 month internships. The ideal candidate will be responsible for the development, maintenance and optimization of new and existing systems and products. You can expect to work on a wide range of mobile games, related technologies and tools in a fast paced environment.Our Programmers own features from “end to end” (both client and server, both UI and backend). They collaborate with other team members to iterate on designs and refine systems, tools and game code. As a small studio, all of our Programmers need to be flexible and enjoy a wide range of responsibilities across multiple projects and technologies.",
	"job_requirements" : "REQUIREMENTS• Experience working with Unity• Participating in game jams• Working with one or more of the following languages/technologies/platforms: C#, C++, Objective C, JavaScript, MySQL, PHP, iOS, Android or Facebook APIs.• Working with SCM systems in a team environment (SVN, GIT or Perforce)• Successful completion of 2nd year courses in Computer Science, although preference will be given to 3rd and 4th year students• Eligible to work in CanadaSKILLS & ABILITIES• Excellent attention to detail• Passion, enthusiasm and knowledge of emerging games• A solid theoretical foundation covering data structures and algorithms• Ramp up quickly on new technologies and engines as required by particular project• Work in a truly agile fashion• Interact professionally with team members• Deliver and receive performance feedback in a mature mannerInterested in the opportunity? We’d love to hear from you. Please apply with your current resume and cover letter outlining how you’re right for the job.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Roadhouse Interactive",
	"division" : "Main"
}