{
	"id" : "53809",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "SYSTEM SOFTWARE ENGINEER",
	"job_location" : "Santa Clara, CA; Austin, TX; Durham, NC",
	"number_of_positions" : "3",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "SYSTEM SOFTWARE ENGINEER (Santa Clara, CA; Austin, TX; Durham, NC)NVIDIA is hiring engineers to work in our system software engineering teams.&nbsp; The best candidates will have strong C programming skills, a thorough understanding of operating systems and kernel programming, a good understanding of hardware architecture, and excellent communication and planning skills.&nbsp; You will work closely with both hardware engineers and other software engineers to design, develop, and debug many functional aspects of our multimedia accelerator and mobile system-on-chip (SOC) devices.&nbsp; You will also be heavily involved with the early modeling and simulation required to produce our world-class products, and will follow the devices all the way through the development process to the customer phones, tablets, desktops, notebooks, workstations, and gaming console products that are used throughout the world.",
	"job_requirements" : "MINIMUM REQUIREMENTS:Minimum GPA: 3.5• Pursuing BS or MS degree in Electrical Engineering, Computer Science, or related degree• Excellent C programming skills• Familiarity with computer system architectures and the hardware/software interface layer models• Interest in low-level operating system knowledge, specifically memory/resource management, scheduling and process control, and hardware virtualization• Kernel experience with Linux, Android, Chrome, or Windows systems is helpful• Experience with complex system-level debugging is invaluableOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "nVidia Corporation",
	"division" : "Head Office"
}