{
	"id" : "53802",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Co-op Graduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Reservoir Engineering Student",
	"job_location" : "Calgary, Alberta",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Hourly",
	"industry" : "Oil & Gas",
	"job_description" : "Total E&P Canada Ltd is a wholly-owned subsidiary of Total SA, one of the world’s largest publicly traded integrated energy companies. Our world-class operations are driven by the energy, talent, and expertise of over 93,000 employees in more than 130 countries.In Canada, Total’s goal is to build a strong, sustainable position in the Athabasca oil sands.Total E&P Canada is creating a team in Canada that draws on local knowledge and expertise needed to operate in the oil sands, while building on the Group’s international experience. Over the next 10 years, Total will invest $20 billion and create 1,300 new jobs in Canada. Total is hiring talented people that share our global perspective, collaborative approach, and commitment to sustainability. Our energy is your energy – we want to hear from you.We are currently seeking candidates for the following position:&nbsp;Reservoir Engineering StudentThis is a four month term starting May 2015. This position will be based in Calgary.The right candidate for this job will aid in the development of a new database and analysis of in-situ commercial projects/pilots performance.Activities:Oil Sand In-Situ Commerical & Experimental Projects: data base structure improvement and performance analysis.- Identify the best workflow in order to recover, store and analyze public data associated to commerical in-situ projects within Canada; based on HIS data base and regulatory AER documents as input.-&nbsp;Compare this workflow with internal existing one (OFM), and internal solutions for building a new one (equivalent to T-More).-&nbsp;Implement the best workflow, which will at the end produce a complete analysis report of all commerical projects based on criteria to be defined within the GSR team.-&nbsp;Database-performance analysis to be used for Surmont project (bechmarking-optimization) and by new ventures team to screen-rank projects of interest.",
	"job_requirements" : "Qualifications/Experience Required-&nbsp;Post-graduate degree (MEng) – Petroleum Engineering preferred-&nbsp;Minimum educational qualifications is a BSc in Engineering-&nbsp;Motivated and self-starter-&nbsp;Team player-&nbsp;Experience/knwoledge of Oil Field Manager (OFM) Schlumberger software is considered an asset-&nbsp;Good verbal and written communications skills-&nbsp;IT solutions development oriented&nbsp;A cover letter describing a candidate’s lab experience is strongly encouraged to demonstrate the candidate’s writing skills and technical reporting ability.Open To All Majors:Yes",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Total E&P Canada Ltd.",
	"division" : "Calgary Office"
}