{
	"id" : "53818",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "COMPUTER ARCHITECTURE ENGINEER INTERN",
	"job_location" : "Santa Clara, CA; Durham, NC",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "COMPUTER ARCHITECTURE ENGINEER –INTERN (Santa Clara, CA; Durham, NC)The NVIDIA GPU Computing Architecture group is seeking new graduates in computer architecture and compute science to join our effort to advance the state of parallel computing.&nbsp; Our team is designing the fastest and most efficient parallel architectures that power energy-efficient smart phones and the world’s fastest super computers.&nbsp;RESPONSIBILITIES:- Enhance GPU architectures to extend the state of the art in performance, efficiency, programmability and reliability- Analyze, tune and prototype key applications for new GPU architectures, including game physics, computer vision, ray-tracing, molecular dynamics, finance, medical imaging, geophysical imaging, weather modeling and speech recognition, to name just a few- Design tools to analyze and debug parallel applications- Collaborate across the company to guide the direction of GPU computing, working with software, research and product teams",
	"job_requirements" : "MINIMUM REQUIREMENTS:- MS Degree in relevant discipline (CS, EE, Math). PhD helpful.- Strong programming ability: C, C++, CUDA, Perl, Python preferred- Strong background in compute architecture, parallel processing, signal processing and/or high performance computingOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "nVidia Corporation",
	"division" : "Head Office"
}