{
	"id" : "53813",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "System Software Engineer (MODS)",
	"job_location" : "Santa Clara, CA",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "System Software Engineer (MODS) – Santa Clara, CANVIDIA is hiring software engineers to work on next-generation graphics and computing products. The best candidates will have strong C++ programming skills, thorough knowledge of graphics concepts and algorithms, a solid foundation of systems software with emphasis on OS fundamentals, and a clear understanding of current generation PC/hardware architecture. Excellent communication skills and a dedication to rigorous engineering practices are a must.The candidate who fills this position will work closely with architecture, hardware and driver teams through the product development lifecycle of graphics and computing processors. You will be responsible for creating software tools and infrastructure required for new chip development, validation, and productization. You will assess new hardware features and architect manufacturing diagnostic tests using pre-beta CUDA and OpenGL extensions. This job will require you do cultivate a deep understanding of NVIDIA’s hardware and software architectures.As a system software engineer, you will extensively use your knowledge of operating systems, algorithms, and computer architecture to provide robust and efficient solutions to validate and test next generation processors from NVIDIA.",
	"job_requirements" : "MINIMUM REQUIREMENTS:- BS or MS degree in EE/CS- Strong C/C++ programming skills- Familiarity with PC architecture, and ability to work close to the hardware- Familiarity with graphics and display device technologies is a plus- Previous experience of working on a large system software code base is preferable- Very strong problem solving and debugging skills- Ability to self-manage, show leadership, and have good communication skillsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "nVidia Corporation",
	"division" : "Head Office"
}