{
	"id" : "53810",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "GRAPHICS SOFTWARE ENGINEER",
	"job_location" : "Santa Clara, CA; Austin, TX; Durham, NC",
	"number_of_positions" : "3",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "GRAPHICS SOFTWARE ENGINEER (Santa Clara, CA; Austin, TX; Durham, NC)NVIDIA is searching for talented engineers to help us design, implement, and optimize graphics rendering drivers for our world-class graphics processors.&nbsp; We work on creating and optimizing the features that are used in all of the latest games and multimedia applications, and we work closely with many of those same developers as they create their products. You will also be exposed to new processor development and verification as we introduce faster and faster media accelerators.&nbsp; Specific areas of focus are OpenGL 3D rendering, DirectX 3D rendering, and 2D graphics acceleration.&nbsp; Our rendering code is cross-platform and highly efficient, and we've shipped our software to hundreds of millions of users around the world.&nbsp; We are looking for people who are passionate about creating leading edge graphics software.",
	"job_requirements" : "MINIMUM REQUIREMENTS:Minimum GPA: 3.5• Pursuing BS or higher degree in Computer Science, or related degree• Strong programming skills in C and C++• Excellent math skills and theory knowledge is invaluable• Experience writing low level software and familiarity with 3D/2D graphics theory, implementation, and optimizations; operating system and compilation theory is also very useful• Strong communication skills and ability to take initiative, especially acting as a strong team player• Excellent debugging skillsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "nVidia Corporation",
	"division" : "Head Office"
}