{
	"id" : "53819",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "GPU C++ DEVELOPMENT TOOLS ARCHITECT",
	"job_location" : "Santa Clara, CA",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "The NVIDIA Architecture group is looking for world class programmers to develop the core infrastructure for modeling, analysis, and debugging in the development of large scale general purpose Graphics+Computing chips.&nbsp;&nbsp; This C++ infrastructure enables our driver stack, applications, tests and studies to all run unchanged on all functional, diagnostic, and performance models, simulations, emulations and silicon for all of our graphics chips.A key part of NVIDIA’s strength is our proprietary internal tools for the visualization, analysis, and debug and verification of tests and applications on various functional and performance simulations of future chips.&nbsp;&nbsp; We are continuously pushing the envelope and needing the next generation of tools to enable the next generation of chips.&nbsp;&nbsp; These tools are used by hundreds of engineers worldwide.In this role you will play a critical part in every stage of development of a graphics chip.&nbsp; You will work closely with other project members and users to specify systems, create schedules, and manage ongoing feedback and enhancement releases.&nbsp;&nbsp; You will learn and greatly improve the daily workflows of the world’s top chip modelers and designers.",
	"job_requirements" : "MINIMUM REQUIREMENTS:- Strong C++ programming capability required (experience with STL and/or boost a plus)- Knowledge of object oriented design patterns required- Experience with chip and/or system simulation a big plus- Strong scripting skills desired – Perl preferredGraphics or Cuda knowledge a plus- Experience with OpenGL, Direct3D, CUDA APIs a plus- BS in Computer Science preferred- Excellent communication skills- Flexibility/adaptability for working in a dynamic environment with different frameworks and requirementsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "nVidia Corporation",
	"division" : "Head Office"
}