{
	"id" : "53812",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "EMBEDDED SOFTWARE ENGINEER",
	"job_location" : "Santa Clara, CA",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "EMBEDDED SOFTWARE ENGINEER (Santa Clara, CA)NVIDIA is looking for engineers to design, implement, and optimize display and system software for embedded applications. Our systems range from handheld wireless devices up to high end entertainment systems. We work closely with hardware engineers and customers to provide customized hardware/software solutions to bring embedded graphics to the next level. Specific areas include device drivers, graphics and multimedia libraries, and kernel work. We use multiple embedded OSs, including Linux, on devices ranging from arcade gaming systems to automobile navigation and entertainment systems.&nbsp; We are looking for people who are excited about introducing NVIDIA quality graphics and multimedia into embedded devices for the first time, and who love coding to the metal.",
	"job_requirements" : "MINIMUM REQUIREMENTS:Minimum GPA: 3.5• Pursuing BS or higher degree in Computer or Electrical Engineering, or related degree• Knowledge and interest in graphics and operating system programming• A solid engineering background and understanding of good code methodology• Strong C programming skills with some assembly experience.• Initiative in pursuing independent coding projects, including open source projects• Experience with writing code, including assembly, to directly control hardware is highly usefulOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "nVidia Corporation",
	"division" : "Head Office"
}