{
	"id" : "53816",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "SYSTEMS ENGINEER",
	"job_location" : "Santa Clara, CA; Beaverton, OR; Austin, TX",
	"number_of_positions" : "3",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "SYSTEMS ENGINEER (Santa Clara, CA; Beaverton, OR; Austin, TX)Systems Engineers are members of the team responsible for developing NVIDIA’s cutting edge graphics board products.&nbsp; Primary responsibilities are to work hands on with new NVIDIA hardware to ensure it meets design, feature and quality objectives.&nbsp; Specific responsibilities include:Hardware Bringup -- As a member of the board bring-up team, you and your teammates will bring-up and test NVIDIA’s graphics board and chip products.&nbsp; You will experience the world's fastest 3D graphics products 4-6 months before arriving on the store shelves.&nbsp; Expect to learn pc architecture, graphics architecture, laboratory methodologies, lab experimentation and measurement techniques.Hardware Qualification-- Working along side the chip & board designers, you will verify new NVIDIA hardware meets design objectives and is ready for mass production.&nbsp; It is here that you will learn state of the art techniques for ensuring hardware designs meet specification and the highest quality standards.Design Review -- Participate in the design reviews of new products to provide feedback to designers and to better understand the product before prototypes are built.&nbsp; Here you will learn about schematic circuit design as well as high-speed PCB layout techniques.Troubleshoot-- When NVIDIA HW design or product issue is encountered, your task will be to understand the problem and work on innovative solutions to reach resolution.&nbsp; This involves working with the various organizations within NVIDIA to learn more details about the product and working in the lab to test and prove hypothesis.",
	"job_requirements" : "Minimum GPA: 3.5• This position provides excellent exposure to the many engineering activities required to design and deliver world-class graphics products.&nbsp; It is especially beneficial to Co-op and interns who desire to become hardware design engineers. Systems Engineers are exposed to a wide range of engineering activities and is an excellent way to help determine the engineering path that is right for you.• The ideal candidate will be working towards a degree in EE, CE, CS, Systems Engineering or Engineering Science/Physics, with an emphasis in computer architecture, digital design, circuit analysis, and device physics.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "nVidia Corporation",
	"division" : "Head Office"
}