{
	"id" : "53827",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Full Stack Web Developer Co-op",
	"job_location" : "Gastown-Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "2700",
	"frequency" : "Monthly",
	"job_description" : "www.invokemedia.comWe’re a fun, casual office located in Gastown above Chill Winston. Breakfast is served every Friday waffleson the last Friday of every month. #Firstfriday beer celebrations. Foosball. Ping pong. Skilledoffice DJ’s. Coops working on meaningful projects. These are some of things you’ll find at Invoke.What do we do? Invoke accelerates startups and brands. We solve business problems by combiningproduct expertise with a deep understanding of user behaviour, helping organizations of all sizes innovate.We work with startups like Rosterbot and Control as well as international brands like NBC, Piaggio and theNHL. Our notable startup alumni include Hootsuite, Food.ee and recently acquired BrightKit.We’re looking for someone who loves the web afull stack web developer coop to join our Dev team of four.You’ll work on real, product & brand related projects alongside the Design, Marketing, Product Managementand Client Services teams where you’ll build responsive web applications and back end services.&nbsp;",
	"job_requirements" : "WHO YOU ARE:● You’re passionate about responsive web development on a LAMP stack● You love to write clean code and may even have a Github page or hobby project that backs that up● You’ve heard of or are familiar with things like GIT version control, PHP, MySQL, HTML5, CSS,LESS/SASS, Javascript, JQuery, BackboneJS and AngularJS● You’ve heard of or are familiar with various MVC web frameworks● You curious to work in an Agile, Scrumbasedenvironment with a team or on your own● You’re excited at the opportunity to create quality user experiences● You’ll love to collaborate with all types of people include Design and User Experience. It’s not justabout the code.● You’ll always be dabbling with cutting edge responsive web design technologies● Ideally are working on your Computer Science Degree.● You have a GIThub profile we’dlove to see some sample codeOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):If you want to come work on some awesome projects, apply with both a CV with a link to your GIThub profile -we’d&nbsp;love to see some sample code!Company:Invoke Media Inc.",
	"division" : "Head Office",
	"website" : "www.invokemedia.com"
}