{
	"id" : "53820",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "WEB/DATABSE APPLICATIONS ARCHITECT",
	"job_location" : "Santa Clara, CA",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "The NVIDIA Architecture group is looking for a web applications software engineer to develop the user interface and front end application for comprehensive workflows for the development of new graphics chips.&nbsp; This software development team is a fast-paced Agile software team with extremely high production quality standards producing tools used by engineering across the company for tracking and debugging operational and development issues.In this position, you will in your ownership of the full tool development and release life-cycle, drive the UI design, database interaction, development, testing, and deployment. You will evaluate technology alternatives, work closely with other project members and users to specify the system, create schedules, and manage ongoing feedback and enhancement releases.&nbsp;&nbsp; You will learn and greatly improve the daily workflows of the world’s top chip modelers and designers.",
	"job_requirements" : "MINIMUM REQUIREMENTS:- Experience in developing web-based user interfaces and applications- Experience with databases a requirement – MySQL or Postgress strongly preferred, No-SQL experience a plus- Strong object-oriented programming background - Java or C# required- Experience with Excel programming and the Excel Object Model a big plus- Strong dynamic language skills a plus – Perl or python preferred- BS in Computer Science preferred- Excellent communication skills- Flexibility/adaptability for working in a dynamic environment with different frameworks and requirementsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "nVidia Corporation",
	"division" : "Head Office"
}