{
	"id" : "53833",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Co-op ? Unit Cell Components Engineering?000091 GDL Engineering",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Description AFCC requires a co-op student for an eight- to twelve-month term to assist the GDL Engineering Group.The successful candidate will:• Work closely with GDL (Gas Diffusion Layer) engineers to prototype next generation GDL’s• Ability to perform ex-situ and in-situ characterization GDL materials• Develop new procedures and test methods for GDL materials• Support development of GDL tools (hardware and software)• Perform data analysis• Assist with the development and maintenance of databases• Assist with MEA assembly• Maintain material inventoryRequiredNSERC Eligible",
	"job_requirements" : "Requirements/Skills Key job skills include: Ability to work in the lab and be very “hands on” Excellent attention to detail, quality and documentation Ability to keep track of tasks and multi-task Visual Basic Labview Data analysis using Excel Data presentation using Power Point Basic understanding of fuel cell operation is an assetAreas of Study Materials Engineering, Chemical Engineering, Chemistry, Engineering Physics, Physics, Electrical Engineering, Mechanical EngineeringAFCC values diversity in the workplace and is committed to Employment Equity.&nbsp; We encourage applications from all qualified candidates.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalElectricalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Must apply via EngCore and Employer website",
	"if_by_website,_go_to" : "http://www.afcc-auto.com/opportunities.php?name=opportunities",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):CO-OP NOTE: You MUST submit an application online via EngCORE AND through the AFCC Job Opportunities website in order to be considered for the opportunity.AFCC Opportunities:&nbsp;http://www.afcc-auto.com/opportunities.php?name=opportunitiesLook for the matching Job Title and Job Number on our website.Please include your personal contact information on your application. You will be contacted by email if selected for an interview.Company:Automotive Fuel Cell Cooperation (AFCC)",
	"division" : "AFCC"
}