{
	"id" : "53839",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Quality Tools Developer",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Kardium is a dynamic company made up of a group of highly talented individuals with expertise in business, management, electrical engineering, mechanical engineering, and software development. We are focused on developing innovative, highly differentiated medical devices. Kardium has assembled a highly skilled product development team and a fully-equipped rapid prototyping workshop and laboratory in order to realize, test and commercialize innovative medical devices.We are looking for a top-notch student with strong communication and problem-solving abilities and an interest in high-quality software to assist our team in developing software systems which support the design and production of a percutaneously deployed ablation device for treating atrial fibrillation – a growing epidemic affecting over 2.3 million North Americans. Such ablation devices are forecast to have an annual worldwide market of about 6 billion dollars. We believe our device’s innovative design will dramatically decrease procedure time and increase the efficacy of the ablation procedure.The position we are hiring for involves designing, coding, testing and maintaining various software tools that support and enhance software quality and our quality management systems. Previous tools have included: a code coverage utility for an embedded system, reporting tools which interface with our product design and requirements management databases, and an adaptation of the JUnit library to run system level regression tests for our production software.",
	"job_requirements" : "The successful candidate will:* Have advanced object-oriented programming skills, typically with Java, C# or C++.* Have a keen desire to help produce high quality code.* Have excellent communication skills* Be highly proactive and able to execute tasks with minimal instruction and guidance* Be enthusiastic about finding innovative solutions to unforeseen challenges* Have a history of success working in a team settingThe following factors are desired and will increase the suitability of the candidate:* Experience with scripting languages such as Python, Perl.* Experience with source repositories such as Perforce, CVS, ClearCase, or Subversion* Experience with writing automated tests such as unit tests, or automated regression tests.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Kardium Inc.",
	"division" : "Kardium"
}