{
	"id" : "53840",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Faculty Support Specialist",
	"job_location" : "Vancouver, UBC Campus",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Please address cover letter to Ms. Sophie Spiridonoff (Educational Technology Consultant)Duration: 4 months (extension is possible)Location: UBC, Centre for Instructional SupportNOTE: Interested applicants mush have over 70% in English courses.Title: Faculty Support SpecialistDuties will relate primarily to the support of faculty members in the use of a course management system and a variety of web applications. It is expected that the application of these duties will involve some degree of specialization depending on individual strengths. Student will provide classroom support for a variety of technologies (iClicker and Scantron primarily). The position is also responsible for development and maintenance web-based instructional content, especially within Blackboard Vista/Learn. The Centre for Instructional Support at the Faculty of Applied Science has developed a web-based student evaluation tool, iPeer (PHP / MySQL). This position will be responsible for the on-going support and administration of the iPeer software in the Faculty of Applied Science at UBC. In addition to the above, there will be an ongoing need to respond to day to day requirements of supporting teaching practice in the Faculty of Applied Science.&nbsp; This may extend to research, requirement analysis, design and production of learning packages, the digitization of learning materials, communicating with the Instructors and trouble-shooting.&nbsp;",
	"job_requirements" : "The core technologies will be based around Blackboard Vista, Blackboard Learn, HTML, Digital Video and Audio.We are looking for motivated student with web support experience to work on all aspects of web-based courses and systems.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "UBC, Faculty of Applied Science",
	"division" : "Centre for Instructional Support"
}