{
	"id" : "53841",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "January 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "QA Analyst",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "SummaryPayfirma is an award winning technology startup based in Vancouver. We develop technology that lets any business accept credit and debit cards intheir stores, online or on a mobile or tablet device.We are seeking a dynamic individual to join our QA Team. We are looking for energetic and personable people who are interested in expanding theirQA skill set while working on exciting industry leading projects. This is the right job for you if you are outgoing, attentive to detail, eager to learn newtechnologies and have what it takes to track down and capture those hard to find bugs.Primary ResponsibilitiesParticipate in Test Planning, Creation and Execution of Test Cases, Defect Reporting, Defect Verification and General Documentation.Investigation of issues in order to determine specific steps for reproduction and scope.Create test cases and test suites to ensure thorough regression testing.Analysis of complicated systems with many points of integration on a low level where you may be exposed to a variety of different technologies.Work with various mobile platforms such as iOS, Blackberry, Android to ensure that the mobile applications meet specifications.Work with different browsers such as Chrome, Firefox, Safari, IE to ensure web applications and integrations meet specifications.Collaborate with your team members during the investigation and reproduction of defects that impact our merchants and their customers.Report details of issues in JIRA.Documentation of information in Confluence.",
	"job_requirements" : "RequirementsKnowledgeable with iOS, BlackBerry, and Android mobile applications.Basic understanding of mobile client and server systems. A basic understanding of QA testing andtheories.Strong verbal and written communication skills.Excellent organizational skills with the ability to multi-task in an environment with rapidlychanging responsibilities and requirements. Able to work independently and in a team setting.Quick learner who enjoys learning new technologies and is able to keep the big picture in mindduring the testing of a system that integrates with other systems.Nice to HavesWorking knowledge of mobile application development, integrated development environments and mobileapplication deployment methods.Previous mobile application testing experience.Basic understanding of mobile platforms and technologies. Familiarity with JIRA and Confluence WIKIExperience working with payment technologies. Basic understanding of PCI standards.Experience working in a retail or hospitality environment.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Payfirma Corporation",
	"division" : "Payfirma Corporation",
	"website" : "http://www.payfirma.com"
}