{
	"id" : "53854",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "12 months",
	"job_title" : "Energy Project Development Engineering Internship Student",
	"job_location" : "Toronto, Ontario or Calgary, Alberta",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Hourly",
	"industry" : "Transportation Operations",
	"company_type" : "Private Business",
	"job_description" : "Energy Project Development Engineering Internship StudentLocation:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;CA - Toronto, Ontario or Calgary, AlbertaJob Category:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Engineering; Student OpportunitiesEmployment Type:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Co-op Student Full-timeRelocation Eligibility:&nbsp;Domestic OnlyGeneral InformationSTUDENT CO-OP/INTERNSHIP OPPORTUNITY: 12-month term, starting May 2015.TransCanada is currently looking for a qualified engineering Co-op/internship student to work in the Energy Project Development Engineering team within the Facilities Projects Department.The Energy Project Development Engineering team supports energy projects in the development stage. Energy project development involves all technical work required to advance new power generation and transmission opportunities from initial concept (Prospecting Phase) through to final definition (Definition Phase) as required, supporting TransCanada's investment decisions.This involves a wide range of activities including: site due diligence, configuration evaluation, major equipment comparison and selection, contract development and negotiation, plant performance modeling and optimization, and schedule analysis required to support economic evaluation of the opportunity. Other tasks may also be a part of day-to-day work and include: developing the design basis for new projects while encompassing each engineering discipline, reviewing third party engineering work, reviewing specifications, and supporting design queries through implementation.Reporting to the Manager of Energy Project Development, the successful candidate will support the assigned Project Manager or Project Engineer in the development of new projects through the prospecting, proposal, and definition phases. The successful candidate will interact with all key internal departments, as well as external stakeholders, including: internal commercial teams, engineering firms, equipment suppliers, government/regulatory agencies, and utility companies.Energy projects will typically be high value, new build, acquisition or major refurbishment opportunities throughout North America. Energy projects are active in a wide range of power sectors and technology, including generation (thermal combined cycle, simple cycle), cogeneration (wind, solar, and hydro), and large scale transmission.Responsibilities• Provide project support to multiple development or implementation projects in accordance with TransCanada's Capital Project Management System (CPMS) guidelines;• Represent and coordinate project development and implementation inputs from all relevant areas of Operations, Engineering, Environment, Project Valuations, Business Development as well external agencies and consultants;• Support and help coordinate feasibility studies, capital cost estimates, milestone schedules, development plans, risk analyses, and conceptual and preliminary engineering design work;• Interact effectively with all team members and multiple stakeholders both internally and externally;• Support and help manage development budgets, approvals, schedules, and deliverables;• Document and communicate project development or implementation information to team members and stakeholders;• Work with lead discipline engineers to optimize the development and implementation of projects, delivering the required levels for review and quality control;• Complete performance modeling for new energy projects using a number of different software packages;• Other tasks as required.",
	"job_requirements" : "Qualifications and EducationQualifications:• Must be enrolled in a co-op/internship program at a recognized post-secondary institution;• Attention to detail and ability to capture and report information accurately;• Ability to apply engineering principles to identify issues, develop solutions, and recommend improvements;• Ability to prioritize and effectively deal with multiple competing demands in a highly dynamic environment to meet tight deadlines;• Business maturity and awareness with topics and matters that are confidential and competitively sensitive;• Ability to work independently and collaboratively with others in a team setting to achieve shared goals;• Self-starter with a proactive approach to problem identification and resolution;• Self-motivated, innovative, and collaborative;• Strong analytical skills, capable of resolving problems independently;• Ability to work well under pressure in a fast-paced environment with changing priorities and circumstances;• Ability and interest in learning and taking on new challenges;• Strong oral and written communication, interpersonal, and presentation skills.Education/Experience:• Previous business, engineering, construction or operations experience with pipelines, compression, oil pumping stations or energy infrastructure would be an asset;• Excellent computer skills and proficiency with Microsoft Office tools (Excel, Visio, and Word).Applicants must have legal authorization to work in the country in which the position is based with no restrictions.All positions require background screening. Some include criminal and/or credit checks in order to comply with regulations.Open To All Majors:Yes",
	"start_date" : "05/04/2015",
	"end_date" : "04/29/2016",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Cover Letter, Resume, Unofficial Transcripts",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):TransCanada is an equal opportunity employer.Make what you do matter.At TransCanada we dream big, think big and do big things. For over 60 years, we’ve had the vision and scale to deliver big things that matter to the world. From supplying reliable and efficient energy to millions of North Americans with our pipelines, gas storage and power generation facilities, we believe in making big things possible.TransCanada is looking for people who are willing to think about the future… and think big. We’re looking for people who are ready to take on the most significant challenges of their careers and define energy infrastructure in North America.Thank you for choosing TransCanada in your career search.To view all of our job postings or to learn more about TransCanada go to&nbsp; https://jobs.transcanada.com/.Company:TransCanada PipeLines Ltd.",
	"division" : "Calgary",
	"website" : "http://www.transcanada.com"
}