{
	"id" : "53850",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Software Engineering Intern",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Make a DifferenceThis is an opportunity to join EnerNOC’s Vancouver development team located in downtown Vancouver.&nbsp; We build industry-leading web-based clean tech software solutions that help businesses reduce energy consumption through demand response and improved engagement with their energy utility.Learn the Latest TechnologiesWe are looking for talented software developers interested in the following areas:Front end / UI developmentBack end developmentQASite reliabilityDepending on the area you work on you will have the opportunity to learn the latest technologies such as JavaScript, Angular, Node.js, JQuery, bootstrap, knockout.js, R, Ruby, Java, Scala, Hadoop, Spark, AWS, and Chef.&nbsp; We are continually experimenting with the latest technologies and frameworks.We are passionate about agile development methods and you will also learn about automated testing, performance profiling, continuous integration, and daily releases using various tools and frameworks in a dynamic, fast-paced, challenging, and fun work environment.",
	"job_requirements" : "Responsibilities• Designing, writing, and testing quality code in collaboration with your team.• Participating in iteration planning, testing, and release deployment activities.• Help keep a watchful eye on our cloud-based production environments as we strive to exceed our system uptime goals.• Taking responsibility when our continuous build server signals the build is broken and reacting quickly to ensure everything is corrected.• Collaborating with your team members and documenting your work using tools like JIRA, wikis, HipChat, Asana, and a whiteboard.• Developing your skills with mathematics and data visualization, as we explore new ways to analyze and visualize energy data.• Improve your software design and development skills.Requirements• A demonstrated passion for software development and software quality.• A demonstrated ability to be persistent when diagnosing and solving problems.• For front-end developers, you must be passionate about optimizing user experience.&nbsp; UX/HCI experience is beneficial.&nbsp; Experience with JavaScript, Angular, and node.js is highly desired.• For back-end developers, you must be passionate about issues such as multi-threading, job management, and performance.&nbsp; Experience with at least one of Java and Scala is highly desired.• Experience developing web applications in a Mac, Linux, or Windows environment is desired.• Strong verbal and written communication skills.• Team player who can work with minimal supervision.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "EnerNOC (formally Pulse Energy)",
	"division" : "Pulse Energy"
}