{
	"id" : "53857",
	"application_deadline" : "Jan 15, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "PLC Programmer",
	"job_location" : "Radium Hot Springs",
	"number_of_positions" : "1",
	"salary" : "$18-24",
	"frequency" : "Hourly",
	"job_description" : "DESCRIPTIONWhen you work at Canfor you work with people who have a passion for excellence. Our obsession with finding better ways to do things creates an exhilarating work environment with tremendous growth opportunities.Learn more at www.Canfor.comSKILLS YOU’LL LEARN• Health & Safety awareness and recognition;• Presentation and communication skills;• Strategy development, analytical techniques and root cause analysis;• Knowledge in the areas of PLC programming, design, and maintenance;• Working in a team environment.LOCATION – Radium Hot Springs, B.CThe village of Radium Hot Springs is the western gateway to Kootenay National Park and the BC end of the Banff/Windermere Parkway. Set at the entrance to Sinclair Canyon on the lower slope of the Rocky Mountains, this small village is big on old-fashioned alpine hospitality and charm. Don't be surprised to see large numbers of Rocky Mountain bighorn sheep wandering the streets. These spectacular animals spend most of the year grazing in and around the village!RESPONSIBILITES / DUTIESReporting to the Maintenance Superintendent you will be responsible for updating and maintaining current PLC programs. Depending on the successful candidates’ skills and interests, the ability to tailor and grow the responsibilities of the position may be available.• Add and/or integrate new logic in order to streamline production processes and improve recovery costs.• Pre-plan and pre-program for upgrades and integration of current PLC 5 programs into control logixs format.• Ensure all PLC software and firmware is up to date as well as all process computers• Order parts• Supervise within the framework of a Continuous Improvement culture, providing leadership in safety, quality, cost, delivery, and employee engagement• Assist in the development of team members through PLC training and 2way communication",
	"job_requirements" : "THE IDEAL CANDIDATEThe successful candidate will bring the following experience and expertise:• Safe work habits and a working knowledge of Worksafe BC OH&S regulations• Sawmill experience helpful but not necessary• Strong background in RSLogix 5/500, control Logix, Micro Logixs, and RSlinx, or proven academic and work related knowledge which shows an ability to quickly become proficient• Proficient with PC hardware, software, networking and Microsoft Windows• Working knowledge of Microsoft word, excel and power point• Good interpersonal skills• Strong analytical skills• Must be a self starter and highly motivated• Ability to meet deadlines and flexibility with work schedule are required• Good communication skills with a focus on customer deliveryELIGIBILITY / EDUCATION REQUIREMENTS• Currently enrolled or have graduated within the last year from post-secondary diploma or degree in electrical, mechatronics, control system, electronic engineering; computer science or related field• Proven strengths in programming and electronic machine management• Understanding of AC/DC high & low voltage device management and trouble shooting&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.canfor.com/careers",
	"company" : "Canfor Corporation",
	"division" : "Prince George Office",
	"website" : "http://www.canfor.com/"
}