{
	"id" : "53860",
	"application_deadline" : "Feb 01, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "16 months",
	"job_title" : "Kraft Canada Business Development Engineering Intern",
	"job_location" : "Toronto, Ontario",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"industry" : "Manufacturing/R&D - Consumer Goods",
	"company_type" : "Private Business",
	"job_description" : "Length:&nbsp; May 4, 2015 to August 26, 2016 (16 month internship)Location:&nbsp; TorontoJoin our legacy and shape our future. We’ve always been a company of makers. Since 1903, we’ve been making North America’s favorite foods and beverages, and now we want you to join us. If you’ve ever had an inspiring vision, an odd little idea that might be huge, then we are the place for you. With 98% household penetration, we’re taking our powerhouse of iconic brands like Cracker Barrel, Philadelphia, Kraft Peanut Butter, Maxwell House and Kraft Dinner to new heights and creating cutting edge new brands with innovations like MiO and TASSIMO. This is your chance to work with some of the best supply chain professionals in the country and be part of an organization dedicated to building the foundations of your career.We invite you to make change. Make it fun. Make it happen. Make it here.Picture yourself with us. We are looking for pro-active, dynamic engineering students who are looking to expand their experience beyond the borders of what typical engineering looking like by connecting technical knowledge to practical business operations.&nbsp; You will lead and participate in the development and execution of projects such as business capital projects, cost reduction projects, new product development, commercialization, and manufacturing efficiency. Teamed together with Research and Development, Marketing, Operations and Logistics, you will deliver against critical Business Development objectives linked to brand strategy in a business environment. You will be exposed to many different areas of expertise through the diverse nature of these projects.Strong interpersonal skills are essential as you will be working with individuals from all levels and business functions on a variety of brands. Excellent computer skills are a requirement, particularly in spreadsheet analysis and presentation drafting. Effective time management is a must as you will be working on multiple projects simultaneously.Your responsibilities will also include:• Support capital projects from conception to implementation• Support a business development team dedicated to managing business initiatives, working with Marketing, Research and Development, Plant Operations, Sales and Logistics• Assist with presentation development to facilitate capital expenditure and business propositions• Work with a team implementing cost reduction projects• Opportunity to lead and implement projects with high visibility",
	"job_requirements" : "Qualifications:• Currently completing an undergraduate degree in Engineering with preference for Mechanical, Chemical or Electrical Engineering• Ability to work with minimal supervision, taking direction from various stakeholders• Proficient with all Microsoft Applications (i.e. Word, Excel, PowerPoint and Outlook)• Excellent interpersonal skills, report writing and communication skills are required• Bilingualism is an asset• Openness to occasional short term (1-2 days) business travel within Ontario, Quebec and the United States.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalElectricalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:05/04/2015",
	"end_date" : "08/26/2016",
	"hours_per_week" : "37.5",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.kraftcareers.com",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Apply online by end of day February 1, 2015 at www.kraftcareers.com.&nbsp; Address your application to the Kraft Canada Campus Team. Include your cover letter, resume and most recent transcript (unofficial).&nbsp; Candidates selected for an interview will be contacted by February 13, 2015.Company:Kraft Foods",
	"division" : "Canadian Head Office"
}