{
	"id" : "53867",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8, 12 or 16 months",
	"job_title" : "Information Systems Coop Position",
	"job_location" : "Multiple Coal Locations ? Coal Operations",
	"number_of_positions" : "5",
	"salary" : "$3100 - $3950",
	"frequency" : "Monthly",
	"industry" : "Mining/Metals Refining",
	"company_type" : "Private Business",
	"job_description" : "Teck Resources Ltd. - Coal Division – Who are we?Teck Resources Ltd. - Coal Division operates six open pit steel-making coal mines located in the Rocky Mountains of British Columbia and Alberta and is the world’s second largest exporter of seaborne hard coking coal. The Coal Mountain, Elkview, Fording River, Greenhills and Line Creek mines are located in southeastern British Columbia. Cardinal River is located in west-central Alberta, near the town of Hinton.&nbsp; Teck Resources Ltd. - Coal Division employs over 4500 employees.&nbsp; At Teck, we are committed to responsible resource development.&nbsp; For us, this is embodied by three core principles safety, environment and community.All of our coal mines utilize cutting edge technology and equipment to produce hard coking coal, which is ultimately used in the production of steel and small amounts of thermal coal. The mines employ conventional open-pit truck and shovel mining methods and coal preparation plants.Why consider Teck Resources Ltd. - Coal Division for your Coop placement?Teck Resources Ltd. - Coal Division hires more than 160 coop students each year to work at various coal operations.&nbsp; We offer a diverse range of experiences and relevant work to expand your learning.&nbsp; Teck also offers the chance to live and work in the Rocky Mountains, where year-round local attractions and recreational choices are unlimited for the outdoor enthusiast!&nbsp; We have world-class mountain biking, skiing, hiking and fly fishing all at your doorstep. We offer a work life balance, with a common EDO (earned day off) schedule consisting of a nine hour work day, resulting in a long weekend every other week.Professional benefits of working as a coop with Teck Resources Ltd. - Coal Division:• Competitive salary and assistance with travel costs and coop fees• Work closely with a group of professional and senior level engineers on site• A combination of field and office work – opportunity to gain valuable hands-on engineering experience in a challenging and versatile work environment• Previous coops at Teck Resources Ltd. - Coal Division are given first consideration for engineering positions upon graduationResponsibilitiesThe successful candidate will be a team member within the IS group. We currently have opportunities throughout three different areas within our IS department which are described below.Operations Analyst:I.S. Analysts hired by Teck are given the opportunity to practice their skills in all aspects of Service Management.&nbsp; The successful candidate will be a team member of the Client Technology Services group within I.S. Operations. This group is responsible for service desk, incident management, service request management, problem management, and knowledge management. You will be responsible for assisting in daily operations within the team and assisting in related project work.Systems Software Engineer:Team members are responsible for enhancing and providing technical support for Real Time Systems for Teck Resources Ltd. - Coal Divisions’ large-scale mining operations.&nbsp; Specific duties include:• Maintain existing engineering and Real-Time Systems in live production environment• Plant control automation systems integration and support• Mining pit control systems• Wireless communications• Administer Windows and Unix based systems (Win2k3, Solaris, Linux, QNX, VMWare)• Integrate and administer process data historian databases (InSQL, Exaquantum).• Design and development of object-oriented software systems using Microsoft.NET technologies• Plan, coordinate and communicate all system changes• Develop and maintain technical documentationTechnical Analyst:Team members are responsible for the following 3 main areas: change advisory board for weekly meeting preparation, Monthly Operating Report preparation and finance. Specific duties include:• Assist in meeting Operational Excellence objectives• Maintain software repository items• Maintenance of changes using Change Gear software• Prepare Monthly Operating Report presentation• Build Excel and PowerPoint details for new data• Track timely invoices and payment to vendors• Confirmation from business for renewals, contracts etc.• Forecasting for software maintenance",
	"job_requirements" : "Successful candidates must be motivated self-starters, able to work under minimal supervision and be able to manage several projects simultaneously. The positions also require strong written, verbal and interpersonal communication skills.&nbsp; A strong working knowledge of MS Word and Excel is necessary, and a working knowledge of PowerPoint, would be advantageous. Knowledge of ITIL and use of ITSM ticketing systems is essential.The positions also require strong written, verbal and interpersonal communication skills.&nbsp; A strong working knowledge of MS Word and Excel is necessary, and a working knowledge of PowerPoint, Access and AutoCAD would be advantageous.All students will be required to complete pre-employment drug testing prior to commencing work.Teck Resources Ltd. - Coal Division coop students obtain the knowledge and skills required to deal with any challenge that may arise at a large-scale mining operation.&nbsp; Our employees are versatile, flexible and well-equipped to handle each project with confidence.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"end_date" : "12/31/2015",
	"hours_per_week" : "0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://careers2.hiredesk.net/viewjobs/jobdetail.asp?comp=evcc&PROJ_ID={BD76597E-2EB1-4D38-9443-C4838FF0976E}&tp_id=14&TPPreview=1&LAN=en-US",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):If you are interested in this exciting student work term opportunity, please click the following link to complete our online application form to be considered for the above position with Teck:http://careers2.hiredesk.net/viewjobs/jobdetail.asp?comp=evcc&PROJ_ID={BD76597E-2EB1-4D38-9443-C4838FF0976E}&tp_id=14&TPPreview=1&LAN=en-USCompany:Teck Resources Limited",
	"division" : "Coal (Sparwood)"
}