{
	"id" : "53868",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8, 12 or 16 months",
	"job_title" : "Electrical Engineer Coop Position",
	"job_location" : "Multiple Coal Locations ? Coal Operations",
	"number_of_positions" : "1",
	"salary" : "$3950 - $5050",
	"frequency" : "Monthly",
	"industry" : "Mining/Metals Refining",
	"company_type" : "Private Business",
	"job_description" : "Teck Resources Ltd. - Coal Division – Who are we?Teck Resources Ltd. - Coal Division operates six open pit steel-making coal mines located in the Rocky Mountains of British Columbia and Alberta and is the world’s second largest exporter of seaborne hard coking coal. The Coal Mountain, Elkview, Fording River, Greenhills and Line Creek mines are located in southeastern British Columbia. Cardinal River is located in west-central Alberta, near the town of Hinton.&nbsp; Teck Resources Ltd. - Coal Division employs over 4500 employees.&nbsp; At Teck, we are committed to responsible resource development.&nbsp; For us, this is embodied by three core principles safety, environment and community.All of our coal mines utilize cutting edge technology and equipment to produce hard coking coal, which is ultimately used in the production of steel and small amounts of thermal coal. The mines employ conventional open-pit truck and shovel mining methods and coal preparation plants.Why consider Teck Resources Ltd. - Coal Division for your Coop placement?Teck Resources Ltd. - Coal Division hires more than 160 coop students each year to work at various coal operations.&nbsp; We offer a diverse range of experiences and relevant work to expand your learning.&nbsp; Teck also offers the chance to live and work in the Rocky Mountains, where year-round local attractions and recreational choices are unlimited for the outdoor enthusiast!&nbsp; We have world-class mountain biking, skiing, hiking and fly fishing all at your doorstep. We offer a work life balance, with a common EDO (earned day off) schedule consisting of a nine hour work day, resulting in a long weekend every other week.Professional benefits of working as a coop with Teck Resources Ltd. - Coal Division:• Competitive salary and assistance with travel costs and coop fees• Work closely with a group of professional and senior level engineers on site• A combination of field and office work – opportunity to gain valuable hands-on engineering experience in a challenging and versatile work environment• Previous coops at Teck Resources Ltd. - Coal Division are given first consideration for engineering positions upon graduationResponsibilitiesThe Electrical Engineer coop students hired by Teck Resources Ltd. - Coal Division will be given the opportunity to practice their skills in all aspects of the Maintenance Department. The major responsibilities of the Electrical Engineer coop student will be as follows:• Produce detailed designs for electrical projects on site• Ensure the quality of the engineered drawings produced• Coordinate projects relating to plant, mine and maintenance expansions and modifications• Organize, schedule and monitor the status, and control the cost of projects• Identify inefficiencies and develop cost effective solutions• Plan and schedule various tasks for maintenance shutdown work• Troubleshoot problems related to AC/DC drives• Familiarity with PLC-5",
	"job_requirements" : "Successful candidates must be motivated self-starters, able to work under minimal supervision and be able to manage several projects simultaneously.&nbsp; The positions require working outdoors in all weather conditions and the ability to operate 4-wheel drive vehicles in mountainous terrain. You will also be required to have steel-toed boots (which must reach at least above the ankle) before commencing work. If you have prescription eye glasses or contacts you are required to have prescription safety glasses before commencing work.The positions also require strong written, verbal and interpersonal communication skills.&nbsp; A strong working knowledge of MS Word and Excel is necessary, and a working knowledge of PowerPoint, Access and AutoCAD would be advantageous.All students will be required to complete pre-employment drug testing prior to commencing work.Teck Resources Ltd. - Coal Division coop students obtain the knowledge and skills required to deal with challenges that may arise at a large-scale mining operation.&nbsp; Our employees are versatile, flexible and well-equipped to handle each project with confidence.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"end_date" : "12/31/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://careers2.hiredesk.net/viewjobs/jobdetail.asp?comp=evcc&PROJ_ID={3A43D943-CD1C-4343-BFBE-737C69D6A739}&tp_id=14&TPPreview=1&LAN=en-US",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):If you are interested in this exciting student work term opportunity, please click the following link to complete our online application form to be considered for the above position with Teck:http://careers2.hiredesk.net/viewjobs/jobdetail.asp?comp=evcc&PROJ_ID={3A43D943-CD1C-4343-BFBE-737C69D6A739}&tp_id=14&TPPreview=1&LAN=en-USCompany:Teck Resources Limited",
	"division" : "Coal (Sparwood)"
}