{
	"id" : "53874",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Software Developer Co-op",
	"job_location" : "Burnaby",
	"number_of_positions" : "2",
	"salary" : "Annual",
	"frequency" : "Yearly",
	"industry" : "Finance, Insurance & Real Estate",
	"company_type" : "Private Business",
	"job_description" : "Orbis is a global investment management firm committed to excellence. Our current assets under management are approximately US$40 billion in equity and absolute return funds. We employ over 400 people worldwide.In our 25 year history, Orbis has outperformed the market significantly, adding value to our clients’ savings and wealth. We feel that much of our past success results from our fiercely independent, contrarian way of thinking. Our best investment ideas often arise when we take a view that is at odds with conventional wisdom. We find this holds true across all functions of the business as we are all given the opportunity to develop solutions and drive continuous improvements in an unconstrained environment.The TeamThe software development team at Orbis creates and operates the global infrastructure and develops and maintains a suite of business critical systems. Orbis believes strongly that IT is integral to our business and that there is a competitive advantage in building our own systems in preference to buying from third parties. All of our IT systems are developed in-house using cutting edge technologies such as Microsoft C# 5.0, ASP.NET MVC 4 and SQL Server 2014.Upon joining Orbis, the successful candidate’s responsibilities may include:• Working with the business teams to gather requirements• Designing, coding, testing, and deploying new system features",
	"job_requirements" : "The successful candidate will have:• An outstanding academic record• Proficiency in object-oriented programming• Good problem solving and debugging skills• Creativity when designing solutions to business problemsDesirable skills and experience include the following:• Experience .Net Programming with C# and/or VB.Net• Experience with web development (e.g. ASP.NET, AJAX, jQuery, JavaScript, CSS)• Experience with database development (e.g. T-SQL, SQL Server)• Experience with back-end system development (e.g. transactional, messaging, multithreaded systems)Orbis believes in attracting talented individuals who have demonstrated their ability and desire to excel in all their endeavours including academic studies. This is a paid, 4 month co-op position with an option to extend at the discretion of Orbis and the co-op student.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Cover letter, resume and transcripts (all post-secondary to this point; unofficial are accepted)",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Instructions for ApplicationPlease send a cover letter, resume and transcripts (all post-secondary to this point; unofficial are accepted) to vancouver.recruitment@orbis.com. For more information on Orbis, please visit our website at www.orbis.com.Company:Orbis Investments (Canada) Limited",
	"division" : "Vancouver Office"
}