{
	"id" : "53887",
	"application_deadline" : "Jan 22, 2015 1000PM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Instructor",
	"job_location" : "UBC Vancouver (CEME)",
	"number_of_positions" : "12",
	"salary" : "8500",
	"frequency" : "Yearly",
	"industry" : "Charitable Organization (not for profit)",
	"company_type" : "Non-Profit Organization",
	"job_description" : "Do you love working with children? Do you see your knowledge of science, engineering, or technology impact the lives of all youths in Greater Vancouver Area? If you answered yes, you should join the Geering Up Iistructing team.Geering Up is looking to hire energetic, enthusiastic, creative undergraduate students toinspire youth in STEM. We accept any academic background with preference for students inengineering, science, computer science, math and education.Instructing at Geering Up is a great opportunity for students considering working in the fieldof education. In 2015 the average instructor visited 35 classrooms. teaching over 750 kids inschools, and 200 kids in our camps. In addition to teaching, Instructors get to design and buildtheir own curriculum with support from STEM educators across the country.We are looking to hire instructors for April 30, 2015 to August 29, 2015.Applications open Monday, January 5 and close 10:00 PM, Wednesday, January 21.Please see our website for detailed information and application form: http://www.geeringup.apsc.ubc.ca/staff&nbsp;ResponsibilitiesUnder the guidance of the Co-Directors, Instructors are required to:1. Develop science, engineering and technology curriculum&nbsp;&nbsp;&nbsp; - Plan and design workshops for elementary school classes, and after-school programs&nbsp;&nbsp;&nbsp; - Create educational and engaging camp activities2. Act as an Instructor and role model at workshops, camps, and events3. Train, supervise, and provide guidance to volunteer personnel4. Complete all evaluations and reports in a timely manner5. Perform other duties, as requested by the Co-DirectorsInstructors may be asked to travel throughout British Columbia to deliver workshops and camps. Travel and lodging costs will be covered while travelling.Following safety and risk management policies and ensuring every student is safe and having funAssist in prep tasks at the end of each day",
	"job_requirements" : "&nbsp;Qualifications1. University student with a strong background in science, engineering, or technology2. Experience working with children, preferably in a teaching environment3. Proven leadership skills and exceptional teamwork abilities4. Excellent communication and interpersonal skills5. Planning, organizational, multi-tasking, and self-directed work skills6. Proven ability to create and implement working projects and models of scientific concepts7. Special consideration given to those with formal training in special education and/or disability theory, those who have worked in a summer camp environment in the past those with a valid Driver’s License and access to a vehicle, and those with current Standard First Aid certification.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:04/30/2015",
	"end_date" : "08/31/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Employer Website",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Application form (will include resume and cover letter at end)",
	"if_by_website,_go_to" : "http://www.geeringup.apsc.ubc.ca/staff/",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Please complete the application form at http://www.geeringup.apsc.ubc.ca/staff/ which will ask you to provide your resume and cover letter at the end.Company:GEERing Up! UBC Engineering & Science for Kids",
	"division" : "GEERing Up! UBC Engineering & Science for Kids"
}