{
	"id" : "53883",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Electrical Co-op",
	"job_location" : "Vancouver",
	"number_of_positions" : "2",
	"salary" : "19",
	"frequency" : "Hourly",
	"job_description" : "An opportunity exists for an Electrical Co-op in Stantec’s Vancouver Downtown office.&nbsp; The successful candidate will be completely integrated into a multidiscipline environment.&nbsp; The Electrical Co-op student will be responsible for providing technical and CAD support to the Electrical Engineers and Designers.&nbsp; There are also opportunities available for the candidate to perform site visits.&nbsp; Specific duties will include:&nbsp;• Preparation of load calculations, voltage drop and short circuit calculations• Preparation of AutoCAD drawings from sketches or mark-ups• Assistance to the designers and engineers in completion of motor schedules and specifications• Coordination of electrical designs and drawings with other disciplines• Participation in vendor and design specific presentations• Assistance to the designers and engineers in preparations of single line diagrams and control schematics• Assistance to the designers and engineers in the selection of electrical equipment, overcurrent protection devices and wiring methods• Assistance to the designers and engineers in preparation of technical reports• Participation in continuous lunchtime learning sessions",
	"job_requirements" : "Skills and Qualifications required:• Enrolled in an accredited university in either Electrical Engineering or Integrated Engineering with an electrical focus.• Interested in building systems - lighting, security, life safety and communication systems and sustainable building design/green technology• Enrolled in or completed courses related to power.• Familiar and experienced with AutoCAD.• Excellent interpersonal, verbal and written communication skills.• Detail-oriented team player and able to work independently.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"end_date" : "08/31/2015",
	"hours_per_week" : "37.5",
	"application_receipt_procedure" : "Online via system",
	"company" : "Stantec Consulting Ltd.",
	"division" : "Vancouver"
}