{
	"id" : "53888",
	"application_deadline" : "Jan 21, 2015 1000PM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Instructor (French)",
	"job_location" : "UBC Vancouver (CEME)",
	"number_of_positions" : "3",
	"salary" : "8500",
	"frequency" : "Yearly",
	"industry" : "Charitable Organization (not for profit)",
	"company_type" : "Non-Profit Organization",
	"job_description" : "Do you love working with children? Do you see your knowledge of science, engineering, or technology impact the lives of all youths in Greater Vancouver Area? If you answered yes, you should join the Geering Up team.We are looking to hire French instructors for April 30 to August 31.Applications open on Monday January 5 and close Wednesday January 21. Applicants must be available for a group itnerview on Saturday January 24 10:00 am - 1:00 pm.Please see our website for detailed information and application form: http://www.geeringup.apsc.ubc.ca/staff",
	"job_requirements" : "Responsibilities:Under the guidance of the Co-Directors, Instructors are required to:1. Develop science, engineering and technology curriculum&nbsp;&nbsp;&nbsp; - Plan and design workshops for elementary school classes, and after-school programs&nbsp;&nbsp;&nbsp; - Create educational and engaging camp activities2. Act as an Instructor and role model at workshops, camps, and events3. Train, supervise, and provide guidance to volunteer personnel4. Complete all evaluations and reports in a timely manner5. Perform other duties, as requested by the Co-DirectorsInstructors may be asked to travel throughout British Columbia to deliver workshops and camps. Travel and lodging costs will be covered while travelling.Qualifications:1. University student with a strong background in science, engineering, or technology2. Must be fluent in French3. Experience working with children, preferably in a teaching environment4. Proven leadership skills and exceptional teamwork abilities5. Excellent communication and interpersonal skills6. Planning, organizational, multi-tasking, and self-directed work skills7. Proven ability to create and implement working projects and models of scientific concepts8. Special consideration given to those with formal training in special education and/or disability theory, those who have worked in a summer camp environment in the past those with a valid Driver’s License and access to a vehicle, and those with current Standard First Aid certification.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:04/30/2015",
	"end_date" : "08/31/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Employer Website",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Application form (will include resume and cover letter at end)",
	"if_by_website,_go_to" : "http://www.geeringup.apsc.ubc.ca/staff/",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):For detailed description of job postings and application form please visit http://www.geeringup.apsc.ubc.ca/staff/Company:GEERing Up! UBC Engineering & Science for Kids",
	"division" : "GEERing Up! UBC Engineering & Science for Kids"
}