{
	"id" : "53893",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Summer App Development Course Facilitator",
	"job_location" : "Hong Kong",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Summer App Development Course Facilitator**All applicants are encouraged to apply. &nbsp;You do not have to be a Hong Kong citizen to apply for this position.&nbsp;We are looking for:First Code Academy is the first education company that offers mobile app & programming development course for pre-university students in Asia.&nbsp; We are looking for instructors who are passionate about software engineering, have experience in tutoring pre-teens or teens (other subjects are okay too), and have an entrepreneurial & startup mindset.&nbsp; We have openings in both Hong Kong and Singapore.&nbsp; All interns will be trained in Hong Kong first.Why Teach with us?If you are looking to make a meaningful impact in Asia's next generation, starting with Hong Kong, by doing what you know and love, this is the position for you.&nbsp; This unique opportunity allows you to:- Learn: Apply and deepen software development and computer science knowledge to solve problems in community- Teach: Shape young minds and inspire teenagers to solve problems using technology- Build: Be part of a fast-growing organization and lead an expanding instructional teamWho are we?First Code Academy (FCA) is an education institution that aims to bring programming, design and entrepreneurship to Asia's next generation. AppJamming Extensive is our flagship program, first launched in July 2013 with Google Hong Kong's sponsorship. Since then, we have taught over 1000 students from top international and local schools including Canadian International School and Chinese International School.&nbsp; Our work has been featured in Wall Street Journal, CNN, TVB and multiple local media outlets.We believe programming is the new Mandarin, a universal language and skill that our next generation should be proficient at, regardless of their career path. AppJamming teaches programming with the emphasis on problem solving and creativity.Responsibilities and Duties• For interns, help organize summer and semester programs across different schools and location catered to middle school students, both in top local and international schools.• Work closely with co-instructors to provide students with meaningful and prompt feedback on their progress.• Work alongside FCA staff and teaching team to best meet the needs and learning styles of your students.• Guide students through development of a final project that will be presented and distributed to fellow classmates.• Facilitate a dynamic and collaborative classroom community.• Inspire students to persevere through the challenges of turning their ideas into actual mobile application.",
	"job_requirements" : "Skills and Qualifications• You are eager to shape the skills and minds of our next generation.• You love to learn and expand knowledge in engineering and computer science.• You are open minded and question the status quo.• You have strong interest in mobile application development (not necessary to know iOS or Android development, as long as you are fluent in one or more programming language)• You have previous engineering teaching experience, through a course, team training, etcOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "First Code Academy",
	"division" : "First Code Academy"
}