{
	"id" : "53909",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Firmware Designer - Co-op Position (KW)",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Company OverviewSierra Wireless is a global leader in wireless solutions for mobile broadband and machine-to-machine applications. Our customers include top mobile network operators and leading OEMs around the world.Job DescriptionAs a Firmware Developer Co-op, you will work on the development of wireless real-time communication products that comply with the latest 3GPP communications standards. Responsibilities will include embedded software design, coding, unit testing, debugging, and system and network level testing.&nbsp;",
	"job_requirements" : "Qualifications• Good verbal and written communication skills• Experience with C and object oriented programming• Experience with Linux development environment• Knowledge of basic protocol design• Systematic debugging skills• Basic understanding of data communications and real-time computing concepts is a must&nbsp;• Understanding of RTOS concepts such as tasks, stacks, queues and memory mgmt. techniques&nbsp;• Knowledge of using software debugging tools such as debuggers/emulators is desirable• General understanding of wireless communications (UMTS/LTE/GPS) is highly desirable• Some basic knowledge of digital and/or RF hardware would be an asset• Looking for 3rd or 4th year students&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Sierra Wireless Inc.",
	"division" : "Head Office"
}