{
	"id" : "53901",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Engineering Co-op",
	"job_location" : "Belle Plaine; Colonsay; Esterhazy, SK",
	"number_of_positions" : "5",
	"salary" : "$4,292.00 - 4,742.00",
	"frequency" : "Monthly",
	"industry" : "Mining/Metals Refining",
	"company_type" : "Private Business",
	"job_description" : "The Mosaic Company (www.mosaicco.com) is a $10 billion company that stands alone as one of the world's leading producers of concentrated phosphate and potash crop nutrients.&nbsp; Our world-class mining and processing operations produce the highest quality fertilizer and animal feed ingredients.&nbsp; As a global leader in nourishing crops and delivering distinctive value to the world's agriculture, Mosaic offers an opportunity to share in an exciting future.About Mosaic:• World's leading producer and marketer of concentrated potash and phosphate• Annual net sales exceeding $11.1 billion (FY 2012)• New York Stock Exchange symbol: MOS• Employs approximately 8,000 people in eight countries• Mosaic launch date: October 25, 2004• Formed by merger between Cargill Crop Nutrition and IMC Global• Corporate headquarters: Plymouth, Minnesota, USAWhen you work at Mosaic, you're working for a multinational company that is deeply involved in its communities and committed to preserving the environment. You're working at a Fortune 500 company that has a positive impact on the world by nourishing the crops and animals our growing population needs. And you're working at a company that recognizes and rewards your talents with a competitive salary and excellent benefits.What are our Values?We consider our employees to be our most valued ingredient. Mosaic employees are richly diverse in their skills, experience and backgrounds. From engineering, operations, finance, HR, marketing and research, our team came to Mosaic not just for a job but a career that makes a positive impact on the world by nourishing the crops our growing population needs.The Mosaic Company realizes the importance of identifying the best and the brightest candidates early in their university careers and values the partnerships with the student and the school as we work together to assure long-term career success. Our co-op technical student/internship program includes students working in, production, maintenance, environmental, quality control, safety, engineering and/ or other departmentsAre you our next Essential Ingredient?We are currently seeking energetic and self-motivated Engineering Students to join our dynamic team of talented professionals beginning January 2015 for a 4, 8 and 12 month work term.Co-op Positions available:Mining EngineerMechanical EngineerElectrical EngineerChemical EngineerEnvironmental EngineerWhat you will be working on?As a successful candidate you will assist our Engineering team in improving our unique industrial process through process system design and maintenance troubleshooting.Where will you be working? Mosaic Potash Belle Plaine is a solution mine and refinery located 50 kilometers west of Regina on the Trans Canada Highway.Mosaic Potash Esterhazy is an underground potash mine located 90 kilometers south of Yorkton. Its split between two mine sites - K1 which is located 6km northeast of Esterhazy and K2 which is approximately 6 km east of Esterhazy. The two mines at Esterhazy are interconnected.Mosaic Potash Colonsay is an underground potash mine located on Highway 16 about 76 km east of Saskatoon near the intersection with Highway 2.&nbsp; The mine is 13km to the southeast of the town.What we offer?Our ground breaking opportunities offer exciting career growth; competitive pay and opportunity to work with a global leader on exciting projects and much more.&nbsp; Our employees help the world grow the food it needs. Access to a personal vehicle is required to travel to your work location.Interested Applicants are invited to submit a detailed resume (including references), cover letter and transcript to the co-op office by September&nbsp; 22, 2014.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;",
	"job_requirements" : "What are we looking for?Excellent communication and leadership skills as well as strong planning and decision making abilities are a must. To qualify you must be in a minimum of your second year in the College of Engineering.&nbsp; Experience in an industrial environment would be an asset.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalEnvironmentalGeologicalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in GeologicalMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in ElectricalMechanicalMiningUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Mosaic",
	"division" : "Canadian Office"
}