{
	"id" : "53902",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Research Assistant",
	"job_location" : "Maple Ridge, BC",
	"number_of_positions" : "1",
	"salary" : "$2200.00 and $2400.00",
	"frequency" : "Monthly",
	"industry" : "Manufacturing/R&D - Power/Energy/Fuel Cells",
	"company_type" : "Private Business",
	"job_description" : "E-One Moli Energy (Canada) Limitedis a well-equipped lithium-ion battery R&D facility located in Maple Ridge, B.C. with 60+ employees. We strive to be a world leader in materials research and battery development along with providing manufacturing expertise to production operations in Taiwan.The Research & Development facility and operations is paramount to E-One Moli Energy. We are committed to be the industry leader for innovation, material and product development.&nbsp; Our product focus is to provide the best technology for applications such as laptop computers, cordless power tools, medical devices, to name a few.E-One Moli Energy has been a long standing supporter of Co-op programs throughout Canada. We are committed to providing one of the best learning environments for students who come and work with us. The students will be solid contributors to the R&D team and work alongside some of the leading lithium-ion battery research scientists in Canada.Students from chemistry, physics, related science major, and chemical engineering (or other engineering) are welcome to apply. If you would like to be part of the research team at E-One Moli Energy, we look forward to hearing from you. Projects will be assigned based, as much as possible, on the student’s previous experience and interests.&nbsp;Salary:&nbsp; First 4 Month Term - $2200/month; Upon Renewal of Second 4 Month Term - $2400/monthPlease apply through your Co-operative Education office.",
	"job_requirements" : "Due to the nature of lithium-ion batteries, our research effort is multi-disciplinary - involving a wide range of analytical chemistry techniques, solid state chemistry, electrochemistry, materials science, and solid state physics. Some of the duties that the students will be involved in are:&nbsp;Research and development of new cathode and anode materials of high power, and energy application, including materials processing and data analysis;Evaluation of new electrode materials and electrolytes by assembling and testing coin cells;Various chemical analysis using HPLC, GCMS, and Potentiometric titrations;Materials analysis and characterization using X-ray Diffraction, Thermogravimetric Analysis, Differential Scanning Calorimetry, BET surface area measurements, Particle Size Analysis, Scanning Electron Microscopy;Presenting results to research team and preparation of a final work term report.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalComputerElectricalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:37.5",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Students must be enrolled in University and qualify for NSERC Undergraduate Student Research Award (USRA).Accommodations – If required, assistance in securing accommodations is available by employer.Company:E-One Moli Energy (Canada) Ltd.",
	"division" : "Default Division"
}