{
	"id" : "53911",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Mechanical Engineering Co-op (DA)",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Company Profile:Sierra Wireless (www.sierrawireless.com) is a global leader in providing wireless communication solutions that enable mobile professionals to improve their productivity and lifestyle. Products designed by Sierra Wireless are recognized as unique, offering differentiated and reliable solutions, backed by world-class customer support.Position Overview:Sierra Wireless is looking for a top student who is currently majoring in mechanical engineering to join our mechanical design group.Responsibilities:1)&nbsp; Assist other members of the Mechanical Engineering group with product design tasks including:• PRO-E modeling/design of plastic and sheet metal parts•&nbsp; 2-D part drawings• Assembly Drawings2) Assist in the evaluation of new technologies and designs. Perform laboratory testing in the areas of force/displacement, life cycle, and dimensional analysis3) Design and assembly of test fixtures.",
	"job_requirements" : "Requirements:Specific Knowledge/Experience Desired• A junior to senior year student in a mechanical engineering concentration• Familiarity with Pro/Engineer Wildfire 3 CAD tools.• Knowledge of engineering drawing creation concepts.• Microsoft Office experience (Excel, Word, Powerpoint, Outlook)• Hands-on mechanical aptitude with laboratory equipment.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Sierra Wireless Inc.",
	"division" : "Head Office"
}