{
	"id" : "53919",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Node.js Developer - NYC (Coop / Intern) - NYC",
	"job_location" : "New York, New York",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Tired of working on legacy systems, or working with the same old conservative technologies? Join the Benbria team in building an exciting new web application that will help customers connect with an organization in a meaningful way. You’ll have the opportunity to work with a number of leading-edge technologies and the chance to significantly impact the evolution of this product (www.blazeloop.com). You will also be working with some of the largest enterprises and organizations in the world and have the potential to improve the lives of many.Who we are:Benbria is a funded high-growth software company located in Canada’s capital city. We specialize in developing real-time customer engagement solutions.You'll be one of the first members of our New York engineering team, help shaping its internal culture and be part of our early growth.What is the job?You'll be joining our development team and helping us enhance the product by designing and implementing new features. We use and enjoy the following: Node.js, CoffeeScript/JavaScript, MongoDB, Cassandra, Backbone.js, Git.You will be given the same level of responsibilities as our full time engineers. You’ll be working with other engineers, designers, as well as people from other departments. We have many initiatives that support your personal and professional growth. Whether this is your first work term, last work term, or somewhere in-between, we can guarantee you will learn a ton during your work term with us.What we offer?• Lots of freedom to contribute: define projects and processes, create new opportunities, and shape the entire company.• Have direct influence on product direction, setting goals and priorities. Nowhere else will you see, so directly, your work's impact.• Learn about all aspects of the company, gain technical proficiency, build business contacts, and have fun.• Competitive compensation. Flexible work environment. Relocation and visa assistance.• Perks: Frequent lunch-and-learns and regular team events.• Perks: Attend online classes, buy books, anything that helps you grow, Benbria is happy to sponsor",
	"job_requirements" : "Who are we looking for?• Strong JavaScript knowledge, Node.js, CoffeeScript, Backbone.js• Front-end web development knowledge (HTML5/CSS3/JQuery/Jade)• Web development & full stack experience• Preference for simple, elegant solutions to complex problems. And a history of getting&nbsp; things done• Nice-to-haves: Experience with scaling web applications, AWS, building fault-tolerant systems, MongoDB, Cassandra, Redis, RabbitMQOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Benbria",
	"division" : "Benbria (Head Office)"
}