{
	"id" : "53913",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Electrical Enginner Coop",
	"job_location" : "Howe Sound Pulp & Paper - Sunshine Coast",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"industry" : "Pulp & Paper",
	"company_type" : "Private Business",
	"job_description" : "Howe Sound Pulp and Paper has openings for the Winter/Spring term for a Co-Op Electrical Engineer at our Port Mellon site. Howe Sound Pulp and Paper Corporation is one of the most progressive Kraft, Pulp and Paper manufacturers in the world, leading industry in product quality, efficiency and environmental protection.&nbsp; On the heels of a $6 million dollar upgrade of our evaporators we have now completed a $36 million fluidized bed upgrade to our power boiler to enhance energy and generate clean power.&nbsp; We are now one of the largest independent producers of renewable electricity in BC.Howe Sound is one of the seven mills in Canada owned by Paper Excellence.&nbsp; The Paper Excellence Group has an excellent track record in Canada in terms of business leadership, labour, First Nations partnerships, and environmental stewardship.&nbsp; The Group currently employs over 1,000 Canadians.&nbsp; Professional excellence starts with Paper Excellence.We are looking for One (1) 3rd or 4th year undergraduate Electrical Engineering student, for a 4 month work term.&nbsp;&nbsp;Under the direction of the General Manager, Fibre & Energy and you will be responsible for continually looking at ways to improve energy efficiency and conservation.&nbsp; The successful applicants will gain experience in Strategic Energy Management Initiatives.&nbsp;&nbsp;You will be responsible for providing a database and an energy tracking and monitoring system for each facility and process will work as a member of an energy management team to promote energy awareness and energy conservation projects and ideas throughout the organization. This position will also identify, assess, prioritize energy saving opportunity projects, and develop a strategy for the Measurement and Verification of energy saving projects.",
	"job_requirements" : "Specific Accountabilities and Key Activities:• Develop Energy Monitoring & Targeting (EM&T) and Measurement & Verification (M&V) methods• Implement employee awareness program• Investigate new energy efficient technologies• Identify energy saving opportunity projects• Coordinate the implementation of energy saving projects• Maintain internal energy websiteOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Howe Sound Pulp & Paper Ltd",
	"division" : "Howe Sound Pulp & Paper Ltd",
	"website" : "http://www.hspp.ca/"
}