{
	"id" : "53917",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Ninja (Coop/Intern)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "You are a disciplined student of code. Always looking to add to your toolbox of ninja skills, you are perpetually training, and are sometimes coding simply for fun. Hard problems excite you. You attack challenges with purpose and finesse, and enjoy working on a variety of different technologies and projects, contributing and acquiring expertise. You are adept at a wide range of programming tasks, from specification, to implementation, to testing. Come young grasshopper, join the Benbria family as your next step, off the beaten path, to a new and exciting experience.Who we are:Benbria is a funded high-growth software company located in the capital city. We specialize in developing real-time customer engagement solutions. You will be working with some of the largest enterprises and organizations in the world and have the potential to impact the lives of many.What we offer:• Lots of freedom to contribute: define projects and processes, and shape the entire company.• Learn about all aspects of the company, gain technical proficiency, build business contacts, and have fun.• Competitive compensation. Relocation assistance.• Perks: On-site gym. Soccer field right outside office. Flexible hours.• Perks: Frequent lunch-and-learns and regular team events.• Perks: Attend online classes, buy books, anything that helps you grow, Benbria is happy to sponsor",
	"job_requirements" : "What we're looking for:We're looking for strong designers and developers, who can design, create and test complex systems, to join our team and drive new products and features development.Key qualities:• Highly motivated, dedicated, and dependable• Quick to learn unfamiliar technologies and adapt to changing environments• Take initiative, creative problem solver• Ability to work independently and closely with other team members• A history of getting things doneSolid programming or design skills are a must. We're looking for experience with some combination of the following technologies. These are good-to-haves (not mandatory):• Node.js, JavaScript, CoffeeScript• Front-end web development knowledge (HTML5/CSS3/JQuery/Jade)• Web development & full stack experience• Experience with JavaScript libraries such as Backbone.js• Linux, OSX, Git• MongoDB, Cassandra, PostgreSQL• Redis, RabbitMQ, Erlang• AWS experience• Must enjoy building awesome software products! (OK, this one is mandatory)Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Benbria",
	"division" : "Benbria (Head Office)"
}