{
	"id" : "53912",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Software Developer - Co-op Position (IM)",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Company OverviewSierra Wireless is a global leader in wireless solutions for mobile broadband and machine-to-machine applications. Our customers include top mobile network operators and leading OEMs around the world.Job DescriptionSierra Wireless is looking for a top student with strong interest in wireless data communication and software development. A work term with Sierra Wireless offers the following experiences:• Wireless data communication protocols and wireless modems• Software development for Windows Operating Systems• Commercial software development life cycle• Software test methods and techniquesResponsibilities• Assist with developing applications and utilities, Device Drivers and SDK packages.• Investigating new features and technologies• Analyze software defects and verify bug fixes• Assist development teams with troubleshooting customer or field issues",
	"job_requirements" : "Qualifications• Strong written and oral communication skills• Experience with C/C++, Microsoft Visual Studio• Experience with Perl scripting• Knowledge of data communication and networking protocols• Ability to work effectively both independently and within a team environmentOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Sierra Wireless Inc.",
	"division" : "Head Office"
}