{
	"id" : "53918",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Application Analyst",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Avanti Commerce Inc. is offering a full-time co-op position for a junior-to-intermediateApplication Analyst. We are looking for passionate developers who live to code, dream ofproblem solving and share passion for innovation and adoption. The ideal candidate is acurrent or former Computer Science student.Assist the software development teams in the advancement of Avanti web applications using C#, ASP.NET and SQL.Assist the systems integration teams with development of windows applications using C# and VB.NET.Perform routine tests on the platform’s functionalities and troubleshoot any issues discovered.Perform routine tests on POS software and POS terminal integrations.Avanti extends the order and payment process outside of the store, a convenient, fast andsimple option for the consumer. Mobile Commerce is rapidly growing and technology isbecoming a very important competitive advantage in all industries, especially the restaurantindustry. This is a great opportunity to be involved in this rapidly growing trend and growyour skills along with it. Come join our expanding team!Our platform is currently deployed in over 27,000 locations in the United States and Canada.No other company in the world has more Mobile Commerce, Remote Order&nbsp; Pay experience or hassystems deployed at the same scale as Avanti. For more information, feel free to explore ourcompany website www.avanti.com as well as our sister company's website www.cardant.com.",
	"job_requirements" : "QualificationsFormal experience in software development and/or quality assurance is preferred.Experience in Web Development, specifically with Microsoft C#, VB.NET and ASP.NET.Experience in a SQL Server environment including relational database design, implementation and maintenance.Able to clearly define and communicate IT industry standards, processes and best practices.Some experience developing with Web Services, XML, SOAP an assetExperience with retail applications and Point-of-Sale systems are an asset.Some client-server experience can be helpful.Proficient in maintaining client workstation, including OS, applications, and hardware.Excellent troubleshooting skills are needed.Excellent communication skills, both written and verbal, are a must.An eye for detail, good user-interfaces, presentations, etc. an asset.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Avanti Commerce Inc.",
	"division" : "Vancouver Office",
	"website" : "http://www.avanti.com/"
}