{
	"id" : "53915",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op Student",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "About us:POF.com is the world’s largest online dating site, with over 95 million registered users.&nbsp; The company began as a small start-up out of CEO and founder Markus Frind’s apartment in Vancouver in 2003, and subsequently revolutionized the online dating industry as the first free site.POF’s exponential growth has transformed a one-man operation into a bustling headquarters; with over 77 employees in the heart of downtown Vancouver.&nbsp; The company remains an industry leader by innovating change, taking risks, and coming up with new ways for millions of single people to connect and p¬ursue love.About the role:We are looking for small team of coop students to design and build a product for POF. This is a great opportunity for anyone interested in learning to create mobile and mobile web applications. We have a fantastic development team that are a great resource to learn from and love to share their knowledge.&nbsp;What's it like to work at POF?• We have a fun and casual culture• We have monthly outings to local restaurants and our Christmas party is legendary!• Our office is stocked with snacks and beverages• Great downtown location with easy access to transit• Awesome state-of-the-art office with fantastic views",
	"job_requirements" : "The ideal candidate for this role is a quick learner who doesn’t need a lot of hand-holding.&nbsp; Also, the project requires team work so please be ready to collaborate with others.The ideal candidate will have some experience programming in one or more of Java, Objective C, Swift, HTML, C#. Working towards a degree in Computer Science, Math, or a similar field is preferred.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Plentyoffish Media",
	"division" : "Main"
}