{
	"id" : "53925",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Product Development",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Visier is a software-as-a-service start-up located in Vancouver, Canada. &nbsp;It was founded by two pioneers of the business intelligence software industry.&nbsp; Our vision is ambitions – to redefine the field of Business Analytics by creating domain-specific and end-user-centric analytic applications in contrast to hard-to-use, generic business intelligence tools targeted at IT departments.To achieve our goals, we require talented individuals who will thrive in the relative chaos of astartup environment, and who love rolling up their sleeves, being highly creative, and diving into achieve success. Since much of our technology is being built from the ground up, we alsowant people who are excited about innovating and creating new technology.You will work on one of our several development teams. Your responsibilities may includefeature development, quality assurance, and/or data onboarding. The following is a list of therelevant skills and experience that will help you to succeed at Visier. You do not need to haveevery skill listed.&nbsp;",
	"job_requirements" : "SKILLS & EXPERIENCE● Coding skills in relevant programming language (Java, Scala, Flex, JavaScript)● Knowledge of data structures and algorithms● Knowledge of web technologies (REST, XML, JSON)● Knowledge of SQL databases, SQL language, and Python● Attention to detail, tendency to spot mistakes and identify potential improvements● Coding skills in writing functional tests using Selenium, JMETER, and Java● Working towards a computer science, engineering, or mathematics degreeVALUES● You are determined to succeed and committed to win. The opportunity forsuccess is unrivaled here, but you need to supply the drive. Results matter.● You are passionate. We produce software that makes information beautiful,accessible, and engaging.● You are accountable. This is a small company and we take responsibility for ourown successes and failures.● You are disciplined. We do things the right way, we do not cut corners, we do notrely on smoke and mirrors; we are the real deal.*The position requires a minimum 8 month consecutive work term commitment**The position requires a cleared criminal background check from the RCMP*Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Visier",
	"division" : "Visier"
}