{
	"id" : "53921",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-Op Full Stack Engineer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "WHO WE ARE:Indochino believes in cultivating simplicity. We do this by applying elegant solutions to complex problems and creating beautifully designed products of unparalleled quality and value. We’re changing the way people consume, and we also make great menswear. Great ideas come from anywhere and transcend position and title. That’s why we hire great people and give them the space to do great work. At Indochino, you’ll work on creative and innovative solutions to some of the most unique and challenging problems in the industry.WHAT WE ARE LOOKING FOR:Currently Indochino is looking for a talented COOP Full Stack Engineer to join our team!&nbsp; As our COOP Full Stack Engineer, you will work with a great team of engineers that likes to get things done. You will collaborate closely with product managers, QA, designers and fellow team members to ensure a seamless and reliable customer experience on the Web site, and to implement solutions for our retail stores.You will participate in planning, estimation and specification of features and play a key role in technology innovation on diverse projects.&nbsp; You will delve into the business of ecommerce and work closely with Marketing, Retail and Operations teams to quickly assess and build tools that meet their needs.Although culinary skills are not a requirement, if you can flip a burger or a pancake, the social committee will try to recruit you for one of our many staff events.YOU WILL BRING TO THE TABLE:You are an exceptional COOP Full Stack Engineer.&nbsp; You are a champion of maintainable, robust and scalable software.&nbsp; You have strong CS fundamentals and know when and how to optimize.&nbsp; You bring creative solutions to tough engineering problems and craft simplicity out of complexity.&nbsp; Agile is part of your DNA and you are capable of rapid iterations, frequent pivots and responsive to feedback.You want to see the impact of your work making a difference everyday and are an advocate of exceptional customer experience.&nbsp; You have previously worked in Web and preferably ecommerce and love the challenges of that environment.&nbsp; You thrive working as part of a small team of great engineers and can put aside your ego to pursue the best solutions.You have a high sense of ownership and are capable of driving multiple parallel projects to successful completion.&nbsp; Your decisions are driven by expert analysis and backed by hard data to achieve measurable results.&nbsp; You thrive in a dynamic small team environment in which you can have the greatest impact and influence on key technical decisions.",
	"job_requirements" : "In addition, you bring along the following with you as well:• Bachelors degree or equivalent in Computer Science or related discipline.• LAMP (5+Y)• PHP (5+Y)• SQL (5+Y)• Python (3+Y)• JavaScript (3+Y)• HTML & CSS (3+Y)• Agile Methodologies (Scrum, Kanban)&nbsp; (2-3Y) - a very nice to haveWHY YOU SHOULD WORK AT INDOCHINO:Of course you will get salary, benefits, and vacation days, but there are a few things that set us apart.• Your co-workers will be outstanding. The people here are really terrific. We’re continually learning from each other.• We truly collaborate.&nbsp; You will work and partner with a variety of different teams from merchandising, technology, operations and anything in between.• We’re shaking things up in the apparel world. If you have ambition and a strong point of view (with the skills to back it up) you’ll have a good time at Indochino.If this sounds cool and you know you are the gal or guy for this, visit our careers page, tell us a bit about yourself, we’d love to hear from you.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Indochino",
	"division" : "Indochino",
	"website" : "http://www.indochino.com"
}