{
	"id" : "53926",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "QA Analyst",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "We are looking for a co-op student to join our development team and help drive a high level of quality and customer satisfaction for our enterprise level cloud based service. This is a great opportunity to get involved with an up and coming company and get real experience with SaaS and cloud based solutions. If you thrive in a start-up environment and want to join a fun team then we want to hear from you!About the company:Allocadia provides cloud software for marketing budget and ROI management giving marketers complete visibility into all investments and all results, whatever the source. Enterprises see immediate financial benefits by re-allocating marketing budgets to the highest-performing marketing programs. We are growing quickly and are one most exciting companies in the marketing software space. Our headquarters are located in the heart of Downtown Vancouver, BC in a world-class office environment with lounge area, media room, games room, kitchen stocked with snacks, and collaborative workspaces throughout the office.&nbsp; The neighborhood has gym facilities, coffee shops, and restaurants. Check us out at www.allocadia.com!Responsibilities:As a key member of our engineering team, you will have responsibilities that include the following:• Review product requirements and specifications for completeness, usability and testability• Design and execute test plans to maximize quality&nbsp;• Design and perform performance, capacity, security and stress tests for our enterprise level service• Develop and utilize automated test tools to increase efficiency and test coverage• Collaborate closely with Customer Success team to assist with troubleshooting and recreating challenging customer issues• Collaborate with team through issue tracking system (JIRA), Wiki, design meetings, etc.",
	"job_requirements" : "Qualifications:• Pursuing a degree in Engineering or Computer Science or equivalent• Basic knowledge of databases and SQL• Strong analytical and problem-solving skills• Strong written and verbal communication skills• Ability to prioritize & work in a deadline-driven environment• Preference for students that qualify for NSERC Undergraduate Student Research AwardBeneficial Experience:• Knowledge of marketing software, CRM and/or social media platforms• Experience with cloud-based services• Experience with scripting languages and/or test automationOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Allocadia",
	"division" : "Quality Assurance",
	"website" : "www.allocadia.com"
}