{
	"id" : "53937",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Building Systems Student Position",
	"job_location" : "Edmonton and Northern Alberta",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "The role will be involved in a combination of the following duties dependant on the assigned project:• reviewing all contract documentation including architectural, structural, mechanical, electrical drawings and specifications;• reviewing for possible delays or interference's prior to the initial start-up of the project;• setting up a documentation and communication system with the Project Manager or Project Superintendent depending on the size of project;• producing and maintaining a shop drawing log for all electrical equipment or material submittals and/or samples. Pursuing applicable trades for timely submission or re-submissions;&nbsp;&nbsp;• assisting in reviewing and providing comments on shop drawings prior to submitting to the consultants;• soliciting input from the all the electrical and mechanical subtrades including equipment and material delivery dates for input into the schedule;• developing and maintain installation schedules;• performing quality control inspections with the consultant and Building Systems Coordinator/Manager;• assisting project staff in establishing the construction plan and temporary services layout;• assisting the team with temporary services procurement;• reviewing all specifications, drawings, etc. to ensure technical and code requirements for material, equipment and field activities are met; and• assisting in all facets of project close-out, including commissioning, operation and maintenance manuals, spare part inventory deficiencies, etc.",
	"job_requirements" : "Skills required:• Candidates must have a strong desire to work in a construction environment and prior field construction experience will be considered an asset.• Application of various computer software programs will be required, including word processing, spreadsheet applications and drafting.&nbsp;At PCL, we aspire to be the most respected builder, renowned for excellence, leadership and unsurpassed value. We’re looking for hard working students who want to build their career with a General Contractor, and who thrive in a team environment. We are an equal opportunity employer.PCL has operations in Vancouver, Edmonton, Calgary, Regina, Saskatoon, Winnipeg, Ottawa, Toronto, Mississauga and Halifax. If you are interested in a student position in any of the locations listed above and are willing to personally relocate there for the duration of the work term note this on your cover letter.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsCivilElectricalIntegratedMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering CivilMaster of Engineering ElectricalMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "PCL Construction Management Inc.",
	"division" : "Edmonton Building"
}