{
	"id" : "53949",
	"application_deadline" : "Jan 18, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Field Application Engineering Intern 2027285",
	"job_location" : "Calgary, AB",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "GE (NYSE: GE) works on things that matter. The best people and the best technologies taking on the toughest challenges. Finding solutions in energy, health and home, transportation and finance. Building, powering, moving and curing the world. Not just imagining. Doing. GE works. For more information, visit the company's website at www.ge.comGE Oil & Gas is a world leader in advanced technologies and services with 43,000 employees in more than 100 countries supporting customers across the industry—from extraction to transportation to end use. Our unrelenting commitment to the environment, health and safety, quality and integrity defines us: it's The Way We Work.We develop smart solutions for our customers across the oil and gas value chain delivering the innovation, customized service solutions, training programs and technology that helps them to maximize their efficiency, productivity and equipment reliability.We partner with our customers to develop their next generation workforce; help them to fully benefit from the megatrends of natural gas, the growth of subsea and hard-to-reach reserves and the revolution in asset health management. Follow GE Oil & Gas on Twitter @GE_OilandGas.&nbsp;&nbsp;The Position:",
	"as_the_field_application_engineer_intern_you_will_be_joining_the_ge_oil_&_gas_–_measurement_&_control_team_and_work_on_projects_aligned_to_both_local_and_global_growth_initatives._in_this_role,_you_will_have_an_opportunity_to_work_alongside_experienced_professionals_within_the_field_of_sales,_marketing,_engineering,_and_technology._you_will_gain_exposure_supporting_both_the_commercial_and_engineering_teams_and_assist_the_greater_organization_in_achieving_its_annual_goals_and_objectives_as_an_active_participant.nature_of_work" : "In this role, your responsibilities will include (but are not limited to);- Work closely with the Customer Innovation Center team on the LNG and Pipeline projects with a focus on the M&C Business leveraging GE initiatives such as the Industrial Internet.- Gather information about clients' needs and work with the GE team to develop or re-design products that meet customer expectation- Create product submittals that meet the specifications, circuit plans that exceed customer expectations without error, application logic, and meeting schedule / budget commitments- Work within the guidelines of applicable GE Policies and Procedures, Engineering Standards, Product Definition Operating Procedures, Specifications, Government and Commercial Standards, and special security requirements- Manage multiple projects concurrently and ensure quality and schedule requirements are met.- Effectively interface with field engineers, customers and senior management- Maintain documentation in the project file to ensure design control requirements are met&nbsp;",
	"job_requirements" : "Skills:- Must be an undergraduate student enrolled in an accredited university pursuing a Bachelor's Degree in Science or Technology - Must hold and maintain a minimum3.0 overall or in-major GPA - Legal authorization to work in Canada is requiredEducation: - Bachelor Degree in course of completion in an Engineering or Technology discipline.&nbsp;&nbsp;- Excellent interpersonal, written/verbal communication, and leadership skills",
	"-_relevant_work_experience_(prior_internships,_research,_or_other_experience_in_software_development)-_passion_and_aptitude_for_application_engineering_with_solid_technical_&_analytical_skills-_self-motivated,_responsible_and_disciplined._detail-oriented_and_able_to_meet_deadlines-_basic_knowledge_of_the_microsoft_office_suite_(excel,_powerpoint,_etc.)-_ability_to_apply_six_sigma_tools-_excellent_organizational_skills&nbsp;candidates_are_to_submit_a_cover_letter,_resume,_and_transcript._it_is_a_mandatory_requirement_that_you_identify_your_school,_cumulative_gpa,_and_anticipated_graduation_date_as_part_of_the_application_process.this_opportunity_is_intended_for_current_students_who_will_be_returning_to_their_in-class_studies_upon_the_completion_of_the_work_term._it_is_not_open_to_candidates_who_will_have_graduated_prior_to_the_start_of_this_position.please_note_that_this_position_does_not_provide_a_subsidy_for_relocation_expenses.only_those_selected_for_an_interview_will_be_contacted._thank_you_for_your_interest_in_joining_ge.&nbsp;open_to_all_majors" : "- Relevant work experience (prior internships, research, or other experience in software development)- Passion and aptitude for application engineering with solid technical & analytical skills- Self-motivated, responsible and disciplined. Detail-oriented and able to meet deadlines- Basic knowledge of the Microsoft Office suite (Excel, PowerPoint, etc.)- Ability to apply Six Sigma tools- Excellent organizational skills&nbsp;Candidates are to submit a cover letter, resume, and transcript. It is a mandatory requirement that you identify your school, cumulative GPA, and anticipated graduation date as part of the application process.This opportunity is intended for current students who will be returning to their in-class studies upon the completion of the work term. It is not open to candidates who will have graduated prior to the start of this position.Please note that this position does not provide a subsidy for relocation expenses.Only those selected for an interview will be contacted. Thank you for your interest in joining GE.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://jobs.gecareers.com/job/Calgary-Field-Application-Engineering-Intern-%288-months%29-Job-AB/238082300/?utm_source=J2WRSS&utm_medium=rss&utm_campaign=J2W_RSS",
	"company" : "GE (General Electric) Canada",
	"division" : "Default Division",
	"website" : "gecareers.comADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):2027285"
}