{
	"id" : "53945",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Software Engineer - Coop",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "2",
	"salary" : "$50-$60 K",
	"frequency" : "Yearly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "Arista Networks is an exciting public company creating the best software and hardware for running modern data center networks. Its office is located in Burnaby, BC with headquarters in Santa Clara, California. Arista was founded and funded by Silicon Valley veterans and industry titans Andy Bechtolsheim and David Cheriton. It is developing a new class of integrated network solutions to address the scalability, performance, and reliability requirements of large-scale high performance computing and web data centers.Check out aristanetworks.com/university to learn more about our internship program.What's cool about being an engineer at Arista?---------Across all parts of the engineering team, we put a premium on building and using tools that make everyone super-productive. We automate whenever we can: rather than testing manually, we have a lab full of automated servers to do it for you 24/7. To date, we've run over 6 million automated tests! This translates into getting new features and products (and revenue) quicker and with a smaller team.Our engineers are empowered with full responsibility for their projects. Our management structure is flat and lightweight -- you are in charge of delivering your work from design to code to test to customer shipment.We value openness -- no part of the company is off-limits, meaning that our engineers have the chance to work directly with customers, participate in sales meetings, go to trade shows, recruit on campus, and deliver an amazing product.The Person---------We are looking for people who:&nbsp;&nbsp; - love to program and find satisfaction in creating a well-written piece of code&nbsp;&nbsp; - enjoy building things and shipping them, truly making them work&nbsp;&nbsp; - don’t shy away from hard problems and enjoy the challenge of making your software reliable&nbsp;&nbsp; - care about the business too&nbsp;&nbsp; - want to work side-by-side with some of the brightest minds in software, systems, and hardware&nbsp;&nbsp; - learn how things work, just for fun or out of curiosityYou have (or want to have) experience with some set of:&nbsp; - C++&nbsp; - Python&nbsp; - Hardware / drivers / embedded systems&nbsp; - TCP / IP / Ethernet&nbsp; - LinuxThe Job---------The core responsibility is to deliver product features. A major part of this is writing the code that drives our products. But the role of a software engineer is much bigger than just being a coding machine. Software engineers work on the whole development process, including:&nbsp;&nbsp; - deciding what features to build&nbsp;&nbsp; - driving the design&nbsp;&nbsp; - writing the code (of course)&nbsp;&nbsp; - pushing testing&nbsp;&nbsp; - documenting the feature&nbsp;&nbsp; - supporting customers in the field&nbsp;&nbsp;Along the way, you might:&nbsp;&nbsp; - extend and improve the test infrastructure&nbsp;&nbsp; - hack on our engineering tools, including p4, django, python, rpm, ...&nbsp;&nbsp; - work with sales and business developmentExample Projects------We don’t have time for busy work: every project that we do has customers clamouring for it. Along with quick release cycles and an engineer-oriented culture means we always have a slew of interesting projects to tackle. What project you'll work on at Arista will vary a lot depending on our customer demands and your interests. Here are some sample potential projects:1) Latency Based Routing (Networking Protocol)When a router has a packet to a send, it must choose a next hop (ie. the next link in the chain to get a packet to its destination). There are several protocols used by routers to communicate what destinations a router can access and how _close_ they are to that destination. Close can have many different definitions. One popular protocol is called Open Shortest Path First (OSPF), which uses a Dijkstra like algorithm to figure out the least amount of hops to get to any destination. With Latency Based Routing, one would calculate the latency between destinations through different paths and choose the path with the lowest latency. Precautions must be taken to make sure that the protocol adapts to network changes which may change the latency, but also stable so that it is not constantly changing the path.This feature is important to latency sensitive applications, for example financial customers who connect to stock exchanges in multiple locations (like New York, Chicago, and Tokyo) and want to communicate market information between those locations as fast as possible.2) Shared Strings (Software Infrastructure)Arista is always concerned about memory efficiency as our switches don't have hard drives, and thus cannot page memory to disk. This means that when you run out of memory, you are hosed. And, as we add more features, we consume more memory. One way we could possibly reduce memory is shared strings. This would be a table per process that contains all unique strings instantiated. Whenever you go to instantiate a new string this table would be checked to see if that string already exists and if so, return a pointer to it. This table would have to be very efficient both in speed and size. Another benefit of this approach is that string comparisons could be very fast: O(1) address comparisons instead of O(length of string) character comparisons.3) In-service FPGA Upgrade of Modular Components (Talking to Hardware)Arista's modular systems have components that are dynamically inserted and removed. Each of these components have FPGAs that are programmed by our hardware team and we would like the ability to easily and reliably upgrade these FPGA images on products we have already shipped to customers as sometimes they need bugs fixed or enhancements added. This project will give you a chance to get really close to hardware and understand how the system initializes itself.4) VMTracer ACLs (Cloud Datacenter)Arista is focused on supporting datacenter deployments of our products. One way we do that is by integrating with a VMWare server that tells the switch the MAC address of different VMs. With this information a switch can watch traffic to figure out where a VM lives and when it moves. Once you know where a VM lives you can have configuration follow a VM. For example, we recently released a feature where you can define which VLAN a VM belongs to. With this information the switch can be told that VM1 and VM2 should be on the same VLAN so that they can talk to each other easily. And then, when the switch sees broadcast traffic from VM1's MAC it knows that it should send that traffic to wherever it has last seen VM2's MAC. The feature we would like to add is to have ACLs (or Access Control Lists) associated with VMs. Then, you would have the ability to say that VM1 runs a web server so it should allow all traffic to port 80 and VM2 runs MySQL so it should only allow local traffic to port 3306. As VMs move around this configuration automatically would follow.More Info------------You can find out more information about Arista on our website at http://www.aristanetworks.com or about our internship program at HYPERLINK http://www.aristanetworks.com/en/careers/universityhttpHYPERLINK http://www.aristanetworks.com/en/careers/university://HYPERLINK http://www.aristanetworks.com/en/careers/universitywwwHYPERLINK http://www.aristanetworks.com/en/careers/university.HYPERLINK http://www.aristanetworks.com/en/careers/universityaristanetworksHYPERLINK http://www.aristanetworks.com/en/careers/university.HYPERLINK http://www.aristanetworks.com/en/careers/universitycomHYPERLINK http://www.aristanetworks.com/en/careers/university/HYPERLINK http://www.aristanetworks.com/en/careers/universityenHYPERLINK http://www.aristanetworks.com/en/careers/university/HYPERLINK http://www.aristanetworks.com/en/careers/universitycareersHYPERLINK http://www.aristanetworks.com/en/careers/university/HYPERLINK http://www.aristanetworks.com/en/careers/universityuniversity and at jobs.aristanetworks.com",
	"job_requirements" : "- C++- Python- Hardware / drivers / embedded systems- TCP / IP / Ethernet- LinuxOpen To All Majors:Yes",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):resume, transcripts",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Please send cover letter, transcripts and resumeCompany:Arista Networks",
	"division" : "Software"
}