{
	"id" : "53942",
	"application_deadline" : "Jan 28, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Toba Montrose Engineering Co-op - 2015",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "See below",
	"frequency" : "Monthly",
	"job_description" : "Toba Montrose Engineering Co-op - 2014Title:&nbsp; Engineering Co-opSchool Level: UndergraduateCo-Op Term: 4 months – May – August 2015Work Location: Vancouver office and 6-10 weeks at Toba Inlet (BC Coast - may not be continuous)Salary:&nbsp;&nbsp; $150/day Vancouver, $200/day at site, overtime on site is $40/hour (MR)o Assist site and office staff in implementing a computer-based maintenance management system (Maximo) for an operational wind farm.o Participate in maintenance inspections and testing at site, and take lead role in documenting this work in Maximo.o Review completed maintenance standards and update the standard to reflect actual process.o Complete backlog entry of all maintenance work into Maximo.o Coordinate and manage annual inspection program for thermographic surveys of all HV electrical equipment including resourcing, work inspection and reporting.o Assist with other tasks related to operations of the Toba Montrose run of river hydro plants, as required.o There may be opportunities to gain exposure and work on the Dokie wind farm project, as time and schedule permits.",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:05/04/2015",
	"end_date" : "08/28/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alterra Power Corp.",
	"division" : "Alterra Power Corp."
}