{
	"id" : "53952",
	"application_deadline" : "Jan 18, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "12 months",
	"job_title" : "Technical Advisor Intern 2026913",
	"job_location" : "Moose Jaw, SK",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "&nbsp;GE (NYSE: GE) works on things that matter. The best people and the best technologies taking on the toughest challenges. Finding solutions in energy, health and home, transportation and finance. Building, powering, moving and curing the world. Not just imagining. Doing. GE works. For more information, visit the company's website at www.ge.com.",
	"general_electric_company_(nyse" : "",
	"as_the_technical_advisor_you_will_be_joining_a_fast-paced_and_demanding_environment_as_part_of_the_canadian_pacific_field_service_team._in_this_role,_you_will_have_an_opportunity_to_work_alongside_experienced_professionals_within_the_field_of_locomotive_field_technical_support._you_will_gain_exposure_supporting_the_field_services_and_engineering_teams_and_assist_the_greater_organization_in_achieving_its_annual_goals_and_objectives_as_an_active_participant.nature_of_work" : "In this role, your responsibilities will include (but are not limited to);- Provide technical direction to the customer in the repair and maintenance of their locomotives- Identify and highlight locomotive product design reliability issues- Perform audits on maintenance procedures / workscopes and help drive process improvements&nbsp;",
	"job_requirements" : "Do you qualify? We are seeking… Skills:- 3rd year of an Mechanical/Electrical Engineering Bachelor's degree program from an accredited university- Willingness to work various shifts on various days- Strong analytical skills and problem solving capabilitiesIf you see yourself in a challenging, rewarding career at an extremely diverse, innovation-driven company, this is the perfect place to start. Wherever the internship takes you, GE's supportive environment and free flow of information will encourage you imagine, build, solve and lead.Please note that this position does not provide a subsidy for relocation expenses.Only those selected for an interview will be contacted. Thank you for your interest in joining GE.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://jobs.gecareers.com/job/Moose-Jaw-Technical-Advisor-Intern,-Moose-Jaw,-SK-%2812-months%29-Job-SK/238311500/?utm_source=J2WRSS&utm_medium=rss&utm_campaign=J2W_RSS",
	"company" : "GE (General Electric) Canada",
	"division" : "Default Division",
	"website" : "gecareers.comADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):2026913"
}