{
	"id" : "53958",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 or 12 months",
	"job_title" : "Junior Software Engineer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Tasktop software synchronizes information between different business units and across software development supply chains, enabling true business to business process integration. From Fortune 500 automobile manufacturers and financial institutions and burgeoning start-ups, Tasktop software is improving the state of software delivery in all types of businesses around the globe. To achieve this level of integration, we&nbsp;need to connect a lot of systems. From open source to the biggest commercial tools, we’re integrating with it.We have some big customers, but Tasktop Engineering consists of small agile teams that get amazing products built and delivered. You will have a lot of opportunity to learn incrementally (and maybe play some foosball) while contributing directly to customer facing products or internal business applications!",
	"job_requirements" : "QualificationsWe are looking for conscientious team-players with experience with or passion in some of the following:• Java development• Angular / Javascript development• Interest in learning other technologies (e.g., Ruby/Rails, Play Framework, Python)• Network communications development (e.g. REST, HTTP)• Knowledge of Windows/Linux/Mac• Knowledge of Object Oriented and design patterns&nbsp;More about TasktopSpun out of research conducted at UBC (Eclipse Mylyn) 8 years ago, Tasktop has since garnered numerous awards including Best Employer by Small Business BC, named one of The Best Companies to Work for in BC, and was named Ready to Rocket by BCTIA. Our CEO, Mik Kersten, was named Top 40 Under 40 by Business In Vancouver. Check out more at&nbsp;https://www.tasktop.com.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Tasktop Technologies Inc.",
	"division" : "Tasktop Technologies Inc."
}