{
	"id" : "53957",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Co-op Software Engineer, Scala",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Hootsuite Media IncPosition Title: Co-op Software Engineer, ScalaLocation: 5 East 8th Avenue, Vancouver, BC&nbsp;&nbsp;Co-op Term: 4, 8, or 12 months terms availableStart Date: May 2015&nbsp;About Hootsuite:At Hootsuite, all co-op students pair with a mentor on a small team to build and ship production-ready code in modern languages. There are continual opportunities to create and learn from shipping code on day one to mission-critical multi-month projects. You'll play a role in shaping our product and our culture.“During my term, I had the opportunity to learn a new language (Scala) and work on a very complex, but rewarding distributed system. Everyone is very supportive and helpful and they are a huge factor in how much I have learnt during my 8 months. Hootsuite has trust in everyone here, so you can count on having a voice and actually being heard. It is a great place to grow as an engineer and to gain and develop both technical and non-technical skills.”- Brittany Roesch, January to September 2014.Check out Brittany’s work with ZooKeeperOur motto is learning happens in production. We practice continuous delivery, and ship new code to production multiple times each day in order to test hypotheses about our changes. We value autonomy, curiosity, and entrepreneurialism. We want teammates who participate, challenge us, ask hard questions, and drive continuous improvement.Interested in our past Co-op’s experiences? Check out Leo’s experience at HootsuiteResponsibilities:● Build and ship the next generation of critical social media services for our platform-as-a-service● Participate in code reviews and design reviews to continually improve your craft and approach to problem solving● Collaborate in small teams to design, build, and ship high quality software to Hootsuite's customers● Iterate in an agile fashion; creating hypotheses and testing them with incremental code shipmentsWhy Vancouver?Vancouver is the perfect place to find balance. From yoga and hiking, to skiing and snowshoeing; fine dining or cheap eats; we have it all. The talent, the city, the beautiful outdoor setting; it all makes for an enticing location to live, work and play. Our city is growing and quickly becoming a hub for technological innovation. Hootsuite is a huge part of that movement and we want you to join us for the ride. Come and learn from the Engineers driving this transformation and experience Vancouver as the heart of Canadian Tech.Get to know Hootsuite throughFacebook | Twitter | LinkedIn | Google+ | Instagram | YouTube",
	"job_requirements" : "Required Skills & Experience:● Experience developing with Java or Scala● Familiarity with MySQL (or other RDMBS) and Memcached● Familiarity with functional programming (Haskell, Scheme, Clojure)● Experience building and shipping your own personal projects● A desire to move fast, ship things, make customers happy, and get things done● Experience integrating APIs from major social media platforms (Twitter, Facebook, LinkedIn, Google+)Bonus Assets:● A link to your github account and personal projects you've shipped● So much passion for software engineering that you do it for fun● Desire for tackling difficult problems, and to make an impact on a global user baseOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "HootSuite Media Inc",
	"division" : "Head Office",
	"website" : "https://hootsuite.com"
}