{
	"id" : "53955",
	"application_deadline" : "Jan 18, 2015 0900PM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Student Term Position with Imperial Oil",
	"job_location" : "Canada",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Discover what’s possible.There’s more than one way to make a difference. If you’re a student in Engineering, Science, Business or related disciplines, explore the possibilities at Imperial. Join a team that’s working towards creating a better future.See where your education positions you for success at imperialoil.ca/careersYour initial role with Imperial will be the first of many toward a future filled with challenge, opportunity and accomplishment. Beyond the many career choices available, our supportive culture of continuous learning and development empowers you to achieve your full potential.Imperial has consolidated all of our student engineering positions into one job posting. This will ease your application process and allow us to determine where you best fit amongst our many student term opportunities.&nbsp;Check us out online! youtube.com/imperialoiltwitter.com/imperialoil (@ImperialOil)linkedin.com/company/imperial-oil",
	"job_requirements" : "Please ensure you submit a copy of your most recent unofficial transcript(s) with your application. If you do not have a copy at the time of submission, you will need to log back into the system and upload them prior to the application deadline. Any applications received without a transcript will not be considered.Imperial hires talented students and new graduates from across the country. Relocation assistance is provided for successful candidates who require it.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science in GeologicalMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering CivilMaster of Engineering Clean EnergyMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in GeologicalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaster of Software SystemsMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "imperialoil.ca/careers",
	"company" : "Imperial Oil Resources Ltd.",
	"division" : "Human Resources"
}