{
	"id" : "53951",
	"application_deadline" : "Jan 18, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "12 months",
	"job_title" : "Technical Advisor Intern 2026971",
	"job_location" : "Port Coquitlam, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "GE (NYSE: GE) works on things that matter. The best people and the best technologies taking on the toughest challenges. Finding solutions in energy, health and home, transportation and finance. Building, powering, moving and curing the world. Not just imagining. Doing. GE works. For more information, visit the company's website at www.ge.comGeneral Electric Company (NYSE: GE) is a place where you can live your dreams. Our global presence, innovation and financial strength help to make GE a dynamic place to work, giving you the advantage of a large company, with the agility of a small one – where individual voices are heard.GE Transportation is a leader in the rail industry, providing freight and passenger locomotives, signaling and communications systems as well as rail services to help solve the world's toughest rail challenges. The rail services business helps rail customers around the world keep locomotives running efficiently and safely with a full range of aftermarket solutions. Critical technical support and comprehensive service packages help sustain locomotive performance, lower lie-cycle cost and improve asset utilization&nbsp;The Position: As the Technical Advisor you will be joining a fast-paced and demanding environment as part of the Canadian Pacific Field Service team. In this role, you will have an opportunity to work alongside experienced professionals within the field of Locomotive field technical support. You will gain exposure supporting the field services and engineering teams and assist the greater organization in achieving its annual goals and objectives as an active participant.Nature of work:In this role, your responsibilities will include (but are not limited to);- Provide technical direction to the customer in the repair and maintenance of their locomotives- Identify and highlight locomotive product design reliability issues- Perform audits on maintenance procedures / workscopes and help drive process improvements",
	"job_requirements" : "&nbsp;Do you qualify? We are seeking…",
	"skills" : "- 3rd year of an Mechanical/Electrical Engineering Bachelor's degree program from an accredited university- Willingness to work various shifts on various days- Strong analytical skills and problem solving capabilitiesPlease note that this position does not provide a subsidy for relocation expenses.Only those selected for an interview will be contacted. Thank you for your interest in joining GE.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://jobs.gecareers.com/job/Port-Coquitlam-Technical-Advisor-Intern,-Port-Coquitlam-%2812-months%29-Job-BC/238083900/?utm_source=J2WRSS&utm_medium=rss&utm_campaign=J2W_RSS",
	"company" : "GE (General Electric) Canada",
	"division" : "Default Division",
	"website" : "gecareers.comADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):2026971"
}