{
	"id" : "53969",
	"application_deadline" : "Mar 31, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "ESD SYSTEM VALIDATION EMULATION COOP (JOB#1088315001)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "ESD SYSTEM VALIDATION EMULATION COOPAbout the JobDivision: Enterprise and Storage DivisionLocation: Burnaby, BCAPPLY WITH RESUME AND TRANSCRIPT TO JOB #1088315001The System Validation Emulation team, in collaboration with the Product Development and Firmware teams, is responsible for pre-silicon validation of products to ensure prototype success. This requires designing and implementing various emulation platforms to be used for firmware development and emulation testing purposes prior to tape-out of a product.&nbsp; Platform implementation involves integration/porting of ASIC RTL into FPGA and processor-based emulation hardware and testing the various features/interfaces of the platforms.&nbsp; Testing requires integration of the emulation platforms into various automation frameworks as well as design and debug of FW-based diagnostic/system tests to ensure correct system and sub-system operation.&nbsp; The System Validation Emulation Engineer works in consultation and collaboration with the IC and FW designers to implement the emulation platforms in such a way as to preserve as much of the original design as possible while working within the architectural limitations of the various emulation platforms.The System Validation Emulation team uses the latest in FPGA prototyping platform hardware and tools for implementing, debugging and testing the emulation platforms.&nbsp; The products being emulated encompass a wide array of interfaces and standards commonly used in enterprise storage hardware: PCIe, Serial Attached SCSI (SAS), Serial ATA (SATA), DDR, various low-speed peripherals (I2C, UART),&nbsp; Advanced Microcontroller Bus Architecture (AMBA).ResponsibilitiesAs a Co-op one of these activities would be assigned:• implementing/debugging ASIC RTL in Xilinx Virtex-7 FPGAs or a Cadence Palladium system .• development of FW/scripts/automation frameworks for pre-silicon testing of ASIC features using emulation systems.Emulation implementation/debugging/testing work includes:• porting ASIC RTL to emulation platforms including scaling of logic, RAM replacement and clock tree replacement.• debugging emulation platforms with various simulation and lab/HW debug tools.• C/C++ FW diagnostic test development.• Java/Tcl/Tk scripting for automated control of emulation system.• working as part of a team to develop, execute and document a series of emulation tests that will validate the operation of the ASIC RTL prior to product tape-out. These tests will exercise the various functional blocks of the prototype ASIC and its associated FW as well as test the system level operation against performance criteria and industry standards.• troubleshooting and resolving complex problems in embedded multi-core real-time systems.• effectively presenting technical information to small teams of engineers.",
	"job_requirements" : "Qualifications:• Electrical or Computer Engineering senior co-op student• Experience/knowledge of C, C++ programming languages• Experience/knowledge of a scripting Language such as Java, Tcl/Tk• Experience in a lab or testing environment• Knowledge of PCIe/SAS/SATA/AMBA standards• Knowledge of FPGA architectures and limitations (Xilinx Virtex-7)• Experience/knowledge of FPGA implementation tools (Xilinx Vivado, Synopsys Synplify/Identify)• Experience/knowledge of Cadence RTL simulation tools (IES)• Experience/Knowledge of various HDLs (VHDL, Verilog, System Verilog)• Experience/knowledge of Linux is an asset• Ability to quickly ramp on new projects• Excellent analytical skills• Excellent communication and documentation skills• Interest in design and test of enterprise storage devices with embedded processors, protocol blocks, and high speed interfaces.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.pmcs.com/careers",
	"company" : "PMC-Sierra Inc.",
	"division" : "Operations Head Office - Burnaby",
	"website" : "www.pmcs.com"
}