{
	"id" : "53963",
	"application_deadline" : "Jan 18, 2015 0900PM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Student Term Position with ExxonMobil",
	"job_location" : "Canada",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "We’re counting on people like you.Are you ready for the challenges on the road ahead?The need for energy is a very real environmental and economic issue. It affects everyone – everywhere in the world. At ExxonMobil Canada and ExxonMobil Business Support Centre Canada, we're uniquely positioned to help find the answers to the world’s toughest energy challenges.The biggest challenges attract the best. If you are looking for a student term position in Engineering, Science, Business or Information Technology Management, ExxonMobil Canada and ExxonMobil Business Support Centre Canada have a challenging career waiting for you.ExxonMobil Business Support Centre CanadaStudents interested in Information Technology positions that are pursuing engineering, computer science and IT management degrees should visit our website and apply online to ExxonMobil Business Support Centre Canada at http://bit.ly/13wXiIaExxonMobil CanadaStudents interested in engineering and business positions pursuing related degrees should visit our website and apply online to ExxonMobil Canada at http://bit.ly/1v9gVfACheck us out online! youtube.com/exxonmobilTwitter.com/exxonmobil (@exxonmobil)linkedin.com/company/exxonmobil",
	"job_requirements" : "Please ensure you submit a copy of your most recent unofficial transcript(s) with your application. If you do not have a copy at the time of submission, you will need to log back into the system and upload them prior to the application deadline. Any applications received without a transcript will not be considered.The ExxonMobil Companies in Canada hire talented students and new graduates from across the country. Relocation assistance is provided for successful candidates who require it.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science in GeologicalMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering CivilMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in GeologicalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaster of Software SystemsMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "exxonmobil.com/Canada-English/HR/careers.aspx",
	"company" : "Imperial Oil Resources Ltd.",
	"division" : "Human Resources"
}