{
	"id" : "53965",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Co-op Software Engineer, Mobile Web / iOS / Android",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Hootsuite Media IncPosition Title: Co-op Software Engineer, Mobile Web / iOS / AndroidLocation: 5 East 8th Avenue, Vancouver, BC&nbsp;&nbsp;Co-op Term: 4, 8, or 12 months terms availableStart Date: May 2015End Date: &nbsp;August 2015 or December 2015 or December 2016About Hootsuite:At Hootsuite, all co-op students pair with a mentor on a small team to build and ship production-ready code in modern languages. There are continual opportunities to create and learn from shipping code on day one to mission-critical multi-month projects. You'll play a role in shaping our product and our culture.“In terms of personal growth, I’ve learned a lot about iOS development and being part of a team-oriented environment. My co-workers have been nothing but supportive towards me, and have allowed me the chance to expand my knowledge while still ensuring that I contribute to the company. … Although it is still early in my work term, I’ve already been able to help out with some important refactoring, bug fixes, and feature work. It’s hard for me to isolate one particular accomplishment of which I am most proud, but it is definitely very satisfying to see my work reflected in the published product.”-Leo Marchand, January to August 2014Check out Leo’s experience at HootsuiteOur motto is learning happens in production. We practice continuous delivery, and ship new code to production multiple times each day in order to test hypotheses about our changes. We value autonomy, curiosity, and entrepreneurialism. We want teammates who participate, challenge us, ask hard questions, and drive continuous improvement.Hootsuite is looking for an exceptional Co-op to join the team for a 4, 8 or 12 month term at our HQ in Vancouver, British Columbia. You will tackle technical problems, build functionality for new product initiatives, receive outstanding mentorship, and learn about working on mobile products.Want to know what we’re working on? Visit our Engineering blog at code.hootsuite.comResponsibilities:● Build and ship the next generation of critical social media services● Participate in code reviews and design reviews to continually improve your craft and approach to problem solving● Collaborate in small teams to design, build, and ship high quality software to Hootsuite's customers● Iterate in an agile fashion; creating hypotheses and testing them with incremental code shipmentsWhy Vancouver?Vancouver is the perfect place to find balance. From yoga and hiking, to skiing and snowshoeing; fine dining or cheap eats; we have it all. The talent, the city, the beautiful outdoor setting; it all makes for an enticing location to live, work and play.&nbsp; Our city is growing and quickly becoming a hub for technological innovation. Hootsuite is a huge part of that movement and we want you to join us for the ride. Come and learn from the Front-end Engineers driving this transformation and experience Vancouver as the heart of Canadian Tech.Get to know Hootsuite throughFacebook | Twitter | LinkedIn | Google+ | Instagram | YouTube",
	"job_requirements" : "ECRequired Skills & Experience:● Experience developing with Objective-C, C or Java, or Javascript● Familiar with mobile app development best practices and trends● Interest in automation, including writing unit and integration tests● Experience building and shipping your own personal projects● A desire to move fast, ship things, make customers happy, and get things done● Experience working with REST APIs (bonus if you’ve worked with Twitter or Facebook APIs)Bonus Assets:● A link to your github account and personal projects you've shipped● So much passion for software engineering that you do it for fun● Desire for tackling crazy difficult problems, and to make an impact on a global user baseOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "HootSuite Media Inc",
	"division" : "Head Office",
	"website" : "https://hootsuite.com"
}