{
	"id" : "53962",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Co-op Software Engineer, Operations",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Hootsuite Media IncPosition Title: Co-op Software Engineer, OperationsLocation: 5 East 8th Avenue, Vancouver, BC&nbsp;&nbsp;Co-op Term: 4, 8, or 12 months terms availableStart Date: May2015End Date: August 2015, December 2015 or May 2016About Hootsuite:At Hootsuite, you'll work on a tight knit team of passionate operations engineers to build and maintain the systems infrastructure, servers and networks that power our applications. You'll get plenty of opportunity to learn from a mentor, be a part of an amazing team, and play an active role in shaping our product and our culture.“I learned how to setup and use tools which are used by system administrators all over the world. Working with and setting up database clusters with real-world data and guidance on how to set up for high-load usage were particularly awesome. I completed projects that improved internal workflow, implemented core infrastructure systems that are still being used today, and I have met some amazing people...The types of coops that would benefit most from Hootsuite&nbsp; are people who like to experiment with new technology and have a desire to improve company systems and themselves.”&nbsp; - Ronald Bow May to December 2013 and now a full-time Operations EngineerOur motto is learning happens in production. The engineering team needs to deploy our application continuously, and the Ops Eng team is the anchor behind this continuous delivery. We value autonomy, curiosity, and entrepreneurialism. We want teammates who challenge us, ask hard questions, and drive continuous improvement.Hootsuite is looking for an exceptional Co-op to join the team for a 4, 8 or 12 month term at our HQ in Vancouver, British Columbia. The Operations team responsible for system administration and service management. Your code may not end up on the homepage, but your team loves you because the stuff you build makes everything “just work”.Want to know what we’re working on? Visit our Engineering blog at code.hootsuite.comResponsibilities:● Build and ship the next generation of infrastructure for our large-scale, critical social media services● Work on the Operations team building monitoring systems to diagnose low-level performance issues● Work with our software engineering teams to manage and optimize our configuration management and inventory service, as well as our build and deployment pipeline● Participate in software development process by optimizing low-level code, developing capacity testing systems and designing/maintaining development environmentsWhy Vancouver?Vancouver is the perfect place to find balance. From yoga and hiking, to skiing and snowshoeing; fine dining or cheap eats; we have it all. The talent, the city, the beautiful outdoor setting; it all makes for an enticing location to live, work and play. Our city is growing and quickly becoming a hub for technological innovation. Hootsuite is a huge part of that movement and we want you to join us for the ride. Come and learn from the Operations Engineers driving this transformation and experience Vancouver as the heart of Canadian Tech.Get to know Hootsuite throughFacebook | Twitter | LinkedIn | Google+ | Instagram | YouTube",
	"job_requirements" : "Required Skills & Experience:● Understanding of managing virtualized environments - AWS, vSphere, CloudStack● Familiar with Linux administration; bash and/or python scripting● Familiar with typical application stack software - nginx, apache● Familiar with relational or non-relational (NoSQL) databases● A desire to move fast, ship things, make our customers happy, and get things doneBonus Assets:● An interest in distributed systems, containers, and security● An interest in big data● An understanding of improving infrastructure availability and efficiency● Desire to make an impact on a global user base● A creative thinker, capable of troubleshooting any problem quickly&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "HootSuite Media Inc",
	"division" : "Head Office",
	"website" : "https://hootsuite.com"
}