{
	"id" : "53964",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Co-op Security Engineer/Analyst",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Hootsuite Media IncPosition Title: Co-op Security Engineer/AnalystLocation: 5 East 8th Avenue, Vancouver, BC&nbsp;&nbsp;Co-op Term: 4, 8, or 12 months terms availableStart Date: May 2015End Date &nbsp; August 2015 or December 2015 or May 2016About Hootsuite:At Hootsuite, you'll work with a team of talented and passionate security personnel to build and ship industry-leading security initiatives and projects. The work is fascinating and challenging. You'll get plenty of opportunities to learn; collaborate with other amazing team; and play an active role in shaping our culture.Your mission will be to ensure the security of Hootsuite’s data and environment, along with building the integration of security into the fabric of our Company. We value autonomy, curiosity, and entrepreneurialism. We want teammates who challenge us, ask hard questions, and drive continuous improvement.Interested in our past Co-op’s experiences? Check out Leo’s experience at HootsuiteHootsuite is looking for an exceptional Co-op to join the team for a 4, 8 or 12 month term at our HQ in Vancouver, British Columbia. You will tackle technical problems, and help to ensure we have a reliable and secure global network infrastructure, web application, and processes.Want to know what we’re working on? Visit our Engineering blog at code.hootsuite.comResponsibilities:● Assist in documenting Hootsuite 's security controls and processes for Hootsuite enterprise including operations, development and engineering.● Work with a team of engineers and analysts from security, network, and software.● Review security controls for their effectiveness● Work with various departments to continuously improve processesWhy Vancouver?Vancouver is the perfect place to find balance. From yoga and hiking, to skiing and snowshoeing; fine dining or cheap eats; we have it all. The talent, the city, the beautiful outdoor setting; it all makes for an enticing location to live, work and play. Our city is growing and quickly becoming a hub for technological innovation. Hootsuite is a huge part of that movement and we want you to join us for the ride. Come and learn from the Engineers driving this transformation and experience Vancouver as the heart of Canadian Tech.Get to know Hootsuite throughFacebook | Twitter | LinkedIn | Google+ | Instagram | YouTube",
	"job_requirements" : "Required Skills & Experience:● Familiarity with Unix / Linux based operating systems● Familiarity with JavaScript/PHP● Strong problem solving skillsBonus Assets:● Some script programming via bash, perl, python or other● Interest in access controls and authentication mechanisms, audit, logging and monitoring● Interest in penetration testing, vulnerability assessments, security tools&nbsp; and squid blogsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "HootSuite Media Inc",
	"division" : "Head Office",
	"website" : "https://hootsuite.com"
}