{
	"id" : "53979",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Engineering Co-op",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "Competitive",
	"frequency" : "Monthly",
	"job_description" : "Software Engineering Co-ops needed for May 2015We want you because of what you have to offer. Our co-ops over their terms are given the same technical challenges as our staff developers. We are a merit-based organization. You will learn the skills to develop large scale software products. Many of our co-ops return as full-time employees.Simba Technologies Inc. has market leading technologies (http://www.simba.com/) that are used by the industry's top database and business intelligence vendors. We develop high-performing and high-volume data access solutions to make it easy for other developers to create their products.Simba Technologies Inc. is the recognized world leader in building full-stack data access products and solutions. Simba works with major companies like Microsoft, Oracle, SAP and Teradata to deliver the best-in-class relational and multi-dimensional data connectivity solutions. Literally, millions of people use our software every day.What skills you will learn:• Object-oriented design and programming• Ability to read, use and apply design patterns• Critically provide review of requirements, design, code and testing• Actively participating in development meetings• Being a professional software developer",
	"job_requirements" : "What you need to have:• Enthusiasm to actively contribute in a small team environment• Experience in an object-oriented programming languages - C++/Java/C#• Good command of English with excellent written and verbal communication skills• Creativity with excellent problem solving skills• Adaptability to a wide range of technical areas• Experience with UMLOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Simba Technologies Inc.",
	"division" : "Simba Technologies"
}