{
	"id" : "53977",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8, 12 or 16 months",
	"job_title" : "Electrical Engineer - Co-op/Internship",
	"job_location" : "Joffre Site, Red Deer Alberta",
	"number_of_positions" : "1",
	"salary" : "$4,842",
	"frequency" : "Monthly",
	"industry" : "Manufacturing/R&D - Chemical/Pharmaceutical",
	"company_type" : "Private Business",
	"job_description" : "COMPANY OVERVIEWNOVA Chemicals produces plastics and chemicals that are transformed into products that will shape the future: to make everyday life safer, healthier and easier. Our employees develop and manufacture materials for customers worldwide who produce consumer, industrial and packaging products.Our employees work with a commitment to Responsible Care® to ensure effective health, safety, security and environmental stewardship.NOVA Chemicals creates values by focusing on our customers first. We deliver innovated technology and products through service and collaboration, which means we place high-value on our relationships, as well as our research and development.We’re also dedicated to helping our employees enjoy a better, balanced life. By offering a range of tools, services and programs, we help employees mould each element of their life into the shape they want.LOCATIONThe Joffre Site is located approximately 20 minutes east of Red Deer, Alberta.&nbsp;&nbsp; It is one of the largest petrochemical production sites in North America.Red Deer is the third largest city in Alberta.&nbsp; It offers big city amenities with the benefits of a small population.&nbsp; Red Deer is known for its numerous beautiful parks and proximity to campgrounds, fishing and boating areas, and golf courses.&nbsp; With the mountains only two hours away, it is easy to enjoy a day of hiking or skiing.JOB DESCRIPTIONWorking under the mentorship of a Professional Electrical Engineer, you will aid in either the project development (Electrical/Instrumentation scope) or resolution of plant performance issues.&nbsp; Project work may include resolution of various performance issues or specifying fit for purpose equipment for various plant requirements.&nbsp; Plant support will include development of small engineering packages to resolve simple or reoccurring performance issues that impact our focus on best in class Plant Availability.&nbsp;&nbsp;&nbsp;Key AccountabilitiesUnder the mentorship of a Professional Engineer, you will be expected to:• Investigate, design and complete various instrumentation and electrical projects in one of the six operating units.• Support engineering requests and provide assistance to maintenance and operations personnel• Assist senior engineers in the development of scope for capital projects.• Investigate plant reliability issues and develop appropriate solutions.&nbsp;• Gather information using drawings, equipment files and interaction with plant employees.&nbsp; Use your technical skills to interpret this information and present it in a practical way.&nbsp;• Learn to use the document control system along with an engineering change management system to properly and safely execute engineering projects.• Perform basic electrical calculations, reviewing electrical single line drawings and reviewing the plant electrical metering system.",
	"job_requirements" : "QUALIFICATIONSEducation and Experience:• Electrical Engineering Discipline currently enrolled in 3rd or 4th year of studies• No previous experience required although it will be seen as an assetSkills:• Communication Skills – You can quickly and effectively exchange information through written and oral means.• Interpersonal Skills – You are able to effectively work in a team and can work with the right blend of collaboration, flexibility, speed, and involvement to achieve results.• Problem Solving – You use a systematic approach to generate and evaluate alternatives in order to reach sound decisions.• Results Orientation – You are a focused on achieving results.• Technical Expertise – You can apply knowledge of thermodynamics, fluid dynamics, heat and mass transfer, and energy and mass balances to applications at an operating facility• Capacity for Change – You have the ability to quickly adapt to changing business needs and expectations.&nbsp;BENEFITS• Competitive Salary – Our co-op student salary is competitive with other employers.• Relocation Allowance – This two way relocation allowance covers all associated moving expenses that you encounter while moving to the Red Deer area.• Health Subsidy – NOVA Chemicals will reimburse $100 for every four months that you work toward healthy living purchases.&nbsp; Gym memberships, Tee times, Swimming passes and Yoga are just a few examples of items that qualify.• FLEX Days – For each month worked, you will receive one paid day off of your choice.&nbsp; This will help to balance your work and social life during your time at NOVA Chemicals.&nbsp;PLEASE NOTE: Students are required to provide their own transportation to and from site.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Please include in your application your cover letter, resume and a copy of your unofficial transcriptCompany:Nova Chemicals Corporation",
	"division" : "Joffre Manufacturing Site"
}