{
	"id" : "53976",
	"application_deadline" : "Mar 31, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "FIRMWARE DEVELOPMENT ENGINEER CO-OP (JOB #1089315001)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "FIRMWARE DEVELOPMENT ENGINEER CO-OPAbout the JobDivision: Broadband Wireless DivisionLocation: Burnaby, BCAPPLY WITH RESUME AND TRANSCRIPT TO JOB #1089315001As a Firmware Development Engineering Co-op in the Broadband Wireless Division at PMC-Sierra, you will work with a team of chip and firmware designers to develop embedded software on wireless system-on-chip devices.&nbsp; Your tasks will be varied and challenging, from designing and writing code, to testing of prototype wireless devices, and writing documentation.Our business is on a high-growth trajectory, and we are currently seeking an energetic and innovative individual for a position as a Firmware Development Engineering Co-op.&nbsp; Duties and responsibilities will be commensurate with qualifications.Job ResponsibilitiesReporting to the Firmware Lead, you will do the following:• Design, develop, integrate, debug, test and maintain firmware that controls wireless base-station ICs.• Troubleshoot and resolve problems on target hardware involving digital and analog hardware.• Develop build scripts, and execute build and release procedures.• Write and maintain documentation, such as design specifications, user manuals and release notes for delivered firmware components.&nbsp;",
	"job_requirements" : "Job Qualifications:The qualification requirements for this position include the following:• 3rd or 4th year in Electrical Engineering, Computer Engineering, or equivalent.• Experience developing embedded software in C/C++ and assembly code.• Strong problem solving, hands-on debugging, lab skills and use of test equipment.• Excellent verbal and written communications skills in English.• Strong interpersonal skills and experience as part of a collaborative development team.• Knowledge and experience in several of the following areas:o Embedded software development for MIPS, ARM or similar CPU systems.&nbsp;&nbsp; GNU toolchain in a cross-development environment.o Development of Linux or similar operating systems, particularly driver, kernel and bootloader.o System-on-a-chip firmware development, hardware/software co-debugging.o Web-based user-interface design and development using JavaScript, JSON, and various web application frameworks.o Digital and analog electronic circuits.o Internet or telecommunications networking protocols.o Wireless communications and RF systems.o Digital signal processing.o Scripting languages (Python, Perl, Tcl, or similar).Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.pmcs.com/careers",
	"company" : "PMC-Sierra Inc.",
	"division" : "Operations Head Office - Burnaby",
	"website" : "www.pmcs.com"
}