{
	"id" : "53975",
	"application_deadline" : "Jan 26, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Developer (SWG-0711088)",
	"job_location" : "Victoria",
	"number_of_positions" : "2",
	"salary" : "n/a",
	"frequency" : "Monthly",
	"job_description" : "NOTE: Apply both through EngCORE and on IBM's Website&nbsp;Job code:&nbsp;&nbsp;&nbsp; Please SpecifyTitle of position:&nbsp;&nbsp;&nbsp; Software DeveloperLocation of job:&nbsp;&nbsp;&nbsp; Victoria, British Columbia, CanadaNumber of positions:&nbsp;&nbsp; 6Apply:&nbsp;&nbsp;&nbsp; ElectronicallyTerm:&nbsp;&nbsp;&nbsp; May 2015Job closes at: May 2015Length of work term:&nbsp;&nbsp; 4 MonthsStart date: May 2015End date:&nbsp; August 2015Hours of work per week:&nbsp;&nbsp;&nbsp; 40Receive applications fromstudents in these departments:&nbsp;&nbsp;&nbsp; Engineering, Computer Science / MathApplicable disciplines within the chosendepartments:&nbsp;&nbsp;&nbsp; SEng, EEng, CSc, CSc-Bus, CSc-Phy, CEngMinimum academic year completed:&nbsp;&nbsp;&nbsp; 2 yearsMinimum number of work terms completed:&nbsp;&nbsp;&nbsp; 1 work termEmployer/Company name:&nbsp;&nbsp;&nbsp; IBM Canada LtdCompany Division Name:&nbsp;&nbsp;&nbsp; IBM Victoria Software LabDescription of Company Division:&nbsp; IBM Victoria Software Lab develops software.IBM is a Public company, not a private company.Description:The following position is a part of IBM Canada's EPIC (Employment Pathways to Interns & Co-ops) Student Program. These outstanding positions are limited to students registered in a Canadian University or College co-op or internship program, who have completed a minimum of 2 years of their degree or diploma program, completed at least one work work term, and who will be returning to full-time study upon the completion of the temporary IBM work term.Here’s your chance to shine!Students at IBM are given work similar to New Graduate work because IBM hires the best students to come back full-time when they graduate! Students work side-by-side with full-time IBMers on projects that are used by IBM clients. Innovation is encouraged! Students have a “voice” and are often encouraged to suggest changes and improvements.IBM Canada Laboratory has student opportunities available at its 4 software labs located in Toronto, Ottawa, Montreal, and Victoria. Each site focuses on a variety of IBM software products in our five brands: Tivoli, WebSphere, Lotus, DB2 and Rational. The Victoria Lab’s 50 plus world-class developers unite to work on innovative projects and provide vital technologies and components to enhance IBM Workplace and WebSphere Portal software with new capabilities, such as offline processing, digital signing of multi-part forms, attachment handling, precise form presentation, and innovative data capture approaches. The Labs principal product, IBM Forms, is integrated with WebSphere and DB2 Content Manager software.Working at IBM will provide you with career development opportunities within a global organization that is genuinely committed to technology and innovation. IBM offers a very diverse work environment which could include casual dress code and flexible working hours. If you have the unique opportunity of working at one of our four Labs you will have access to cutting edge technology and contributing on real work projects.The Role:The Victoria Lab is looking for a few star co-ops to join our development team. We are looking for people who are passionate about writing code and are willing to challenge the status quo. We expect our developers to be team focused and are comfortable working with extremely savvy technologists to build high performance software.You will get a chance to interact with staff and customers to define requirements and translate those into a design that will produce high quality code that makes it way back to our customers. Constant change does not intimidate you as you are familiar with iterative development methodologies like the Agile process. If you enjoy working with the latest technologies like Web 2.0, then the IBM Victoria Lab is the place for you. You will join a team of world-class developers and support staff to supply leading edge XML-based and Web 2.0 technologies to customers and partners around the world.",
	"job_requirements" : "Qualification:• Knowledge of IBM Products• Knowledge of the Software Development Cycle• AJAX, JavaScript• XML, HTML, CSS and other Web Standards• Web Services• OO Languages like C++ or Java• Windows, Linux or UNIX operating systems.• Database Technologies• Coop or internship program enrollment an assetApplication Process:- Students applying to this posting must be registered in a co-op or internship program for the length of the placement- This position is intended for undergraduate or graduate students who will be returning to full-time study upon completion of the internship/co-op term(1) Please apply for this position through your coop office. Please supply your university transcript and resume.(2) Also, apply online to the IBM applicant tracking system via www.ibm.com/start*Click on: Search for Jobs at IBM Powered by NetMedia*Select Advanced search*Select Student/Internship for the position type*In the Job ID area enter: SWG-0711088This is the Job ID for the “Software Developer - Co-op (Victoria, BC)” position.*Click SearchNote that full and complete resume and transcript information is required.&nbsp; If your online application is missing your resume, transcript, or any other pertinent information, your application may not be considered.What IBM Offers You:1. Work directly on product and services that affect our clients, while having access to cutting edge software technology2. Work is challenging and rewarding3. Access to obtain IBM Product Certification during work term4. A casual dress code and flexible work hours, to ensure work-life balance5. Future Blue - IBM’s large student community that provides networking opportunities, sporting and social events.Students must apply to www.ibm.com/start in addition to their university job board (if applicable) in order to be considered for the position.&nbsp; It is highly recommended to include your transcript (official or unofficial) to complement your application.This role will involve working with technology that is covered by embargo Export Regulations.&nbsp; If you are a Foreign National from any of the following embargoed countries (Cuba, Iran, North Korea, Sudan, Syria) on a work permit you are not eligible for employment in this position.PLEASE NOTE:If selected for interview, you may also be required to complete an online aptitude test.One of the purposes of our student programs is to identify students who, based on mutually satisfactory work term experience, would be suitable candidates to join IBM and start a career following graduation.IBM Canada Limited is committed to the principle of equity in employment.&nbsp; We encourage applications from qualified women, men, members of visible minorities, aboriginal persons and persons who are physically challenged.This is a temporary position paid hourly without the IBM benefits package.&nbsp;&nbsp; Vacation, statutory holidays and overtime will be paid in accordance with government employment standards legislation.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"if_by_website,_go_to" : "www.ibm.com/start",
	"company" : "IBM",
	"division" : "IBM Victoria Software Lab"
}