{
	"id" : "53978",
	"application_deadline" : "Mar 31, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "BWD PRODUCT VALIDATION DESIGN CO-OP (JOB # 1089415001)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "BWD PRODUCT VALIDATION DESIGN CO-OPAbout the JobDivision: Broadband Wireless DivisionLocation: Burnaby, BCAPPLY WITH RESUME AND TRANSCRIPT TO JOB # 1089415001As a co-op in the Broadband Wireless group, you will work on developing PMC-Sierra’s next generation of wireless IC products.&nbsp; This will involve taking a design from initial concept to production form. Throughout your co-op term you will work beside experienced engineers and be exposed to PMC-Sierra’s Best-In-Class engineering practices.ResponsibilitiesYou will be responsible for designing, building and debugging high-speed (6GHz+) system level HW, with SW and FW to test leading edge prototype wireless IC's in their intended applications.&nbsp; Other responsibilities include contributing to the investigation of a device feature set, designing and/ or verifying device features.&nbsp;You will work alongside members of the Product Design, Verification, Applications, Marketing, and Product Engineering teams using state-of-the-art equipment and hardware to develop, execute, and document a series of device feature tests that will fully validate the operation of the prototype IC as part of the overall system. These feature tests will exercise the various functional blocks of the prototype device, associated FW/SW and system level circuitry to specified performance criteria and selected industry standards.&nbsp;",
	"job_requirements" : "Qualifications• Currently enrolled in Electrical Engineering or Computer Engineering• CGPA &gt;3.0• Strong interest in and familiar with wireless data communications theory and systems• Interested in working with and assisting in the design of complex electronic hardware and systems• Experience using a variety of test equipment in a technical lab environment• Experience with FPGAs, CPLDs, and emulation testing.• Good programming / scripting skills with languages such as Tcl/Tk, C, and Perl• Excellent analytical, communication and documentation skills• Desire to be part of a dynamic and challenging work environment, requiring rapid and constant learning and skill development.• Previous co-op experience is an assetOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.pmcs.com/careers",
	"company" : "PMC-Sierra Inc.",
	"division" : "Operations Head Office - Burnaby",
	"website" : "www.pmcs.com"
}