{
	"id" : "53984",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Engineering Co-op in Quantum Computing",
	"job_location" : "Burnaby",
	"number_of_positions" : "3",
	"salary" : "18.27",
	"frequency" : "Hourly",
	"industry" : "Manufacturing/R&D - Various",
	"company_type" : "Private Business",
	"job_description" : "Engineering Co-op PositionD-Wave is looking for exceptionally motivated people who love to see the impact of their work on a daily basis, who will do whatever it takes to ensure success of the company, and who want to be a part of something special.&nbsp; We are working to radically change what is possible with computers and are leading the effort to commercialize quantum computing.D-Wave’s systems are multi-disciplinary in nature spanning physics, mechanical engineering, cryogenics engineering, low noise analog and digital electronics, conventional computer networking, and a low magnetic field environment.&nbsp; The company's flagship product, the D-Wave Two, is built around a superconducting quantum processor and is currently being used by customers such as Lockheed, NASA and Google.",
	"job_requirements" : "Required Qualifications:• Enrolled in 3rd year or higher in Engineering Physics, Electromechanical Engineering, Systems Engineering or Mechanical Engineering• Previous engineering experience• Ability to work well in a fast-paced team environment that is focused on priorities and end results• Self-motivated, proactive, flexible and passionate about learning• Excellent hands-on ability• Must be NSERC eligibleExceptional candidates will have experience in one or more of the following:• Multi-disciplinary systems• Cryogenic equipment• Basic machine tools• Magnetic shielding• SuperconductivityAbout us:D-Wave has over sixty peer reviewed papers describing the various aspects of our work that have been published in journals such as Nature, Physical Review Letters, and Physical Review B.&nbsp; Recent articles about D-Wave have appeared in Time Magazine, MIT Technology Review, Forbes, USC Viterbi magazine, and Wired.&nbsp; D-Wave was recently named the 2012 Cool Vendor in High-Performance Computing and Extreme-Low-Energy Servers by the Gartner Group and our CTO was honored as the Canadian Innovator of the Year for 2011 by the Canadian Innovation Exchange.&nbsp; Some of the investors in D-Wave include Draper Fisher Jurvetson, Goldman Sachs, Bezos Expeditions, In-Q-tel, and Business Development Bank of Canada. .&nbsp; A D-Wave Two quantum computer is the center piece of the Google NASA Quantum Artificial Intelligence Lab at NASA’s Ames Research Center: http://www.youtube.com/watch?v=CMdHDHEuOUE&nbsp;We thank all applicants for their interest, however, only those who are selected for interviews will be contacted.&nbsp; D-Wave Systems Inc. is an equal-opportunity employer and encourages applications from all qualified candidates regardless of gender, race, ethnicity, age, religion or sexual orientation.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"company" : "D-Wave Systems Inc",
	"division" : "Main"
}