{
	"id" : "53986",
	"application_deadline" : "Mar 31, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "ESD APPLICATIONS ENGINEER COOP (JOB # 1090515001)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "ESD APPLICATIONS ENGINEER COOPDivision: Enterprise and Storage Division – System EngineeringLocation: Burnaby, BCAPPLY WITH RESUME AND TRANSCRIPT TO JOB # 1090515001General Job DescriptionAs an Applications Engineer co-op in the Enterprise Storage Division, you will be assisting the Applications team in providing technical support, setting up lab equipment to analyze and recreate customer system problems, assisting with debug tools development, writing applications notes, issuing device / data sheet errata, embedded firmware debug/development, managing customer deliverables, and providing technical support.&nbsp; You must be able to work independently, and in a team environment.&nbsp;&nbsp;",
	"job_requirements" : "Requirements• Currently enrolled in Electrical Engineering/Computer Engineering/Computer Science program.• Work experience through co-op work terms• Basic understanding of computer architecture• Good writing and communication skills• SW programming experience (C, C++, Java, Tcl/Tk)• Experience with installing OSes (Linux and Windows), setting up hardware and driversDesired• Experience with board-level debug & bring-up.• Experience with object-oriented software development.• Experience with HW design, schematics capture, and board layout.• Experience with driver development / embedded FW development.• Familiarity with storage protocols such as SCSI, Fibre Channel, SAS & SATA is an asset.• Familiarity with high speed design and signal integrity concepts is an asset.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.pmcs.com/careers",
	"company" : "PMC-Sierra Inc.",
	"division" : "Operations Head Office - Burnaby",
	"website" : "www.pmcs.com"
}