{
	"id" : "53981",
	"application_deadline" : "Mar 31, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "CBU Product Validation Engineer Co-op (JOB #1089015001)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "CBU Product Validation Engineer Co-opLocation: BurnabyAPPLY WITH RESUME AND TRANSCRIPT TO JOB #1089015001About the JobDo you want to be part of a team that works with the cutting-edge ICs that enable tomorrow’s technological lifestyle?&nbsp; If so, becoming a Product Validation Engineer Co-op within PMC-Sierra’s Communications Business Unit may be the opportunity you’re looking for!PMC-Sierra develops next-generation technologies that are revolutionizing communications and the Internet. Our award-winning products are utilized by major telecommunications companies throughout our increasingly connected world. Our Product Validation group is responsible for ensuring that our prototype devices operate correctly in their intended applications, requiring a team of dynamic, versatile engineers and students.&nbsp; You will work closely with existing and new communications protocols, including OTN, SONET/SDH, Ethernet, and PCI Express.&nbsp; Your tasks will be many and varied, and will add value to our newly-designed products.As a member of this team, you need to be highly motivated to learn, and to have first-class debugging and problem-solving skills.Here are some of the things the Product Validation group does on a typical project:• Design high-speed Validation boards (25 GHz +) using PMC and third-party devices, digital and analog circuits, and FPGAs.• Design highly-integrated, sophisticated FPGAs and CPLDs using VHDL/Verilog.• Use these complex test platforms, along with high-speed backplanes, traffic generation boards, system software, and embedded firmware to test features in PMC ASIC devices.• Plan and execute device feature tests, including results analysis, bug detection, and root-cause analysis.• Create application-level system configuration scripts to control the device, the test platform, and the test equipment.• Work alongside members of the Product Design, Software, Verification, Applications, Marketing, and Product Engineering teams.",
	"job_requirements" : "Qualifications• You want to be part of an exciting, dynamic, and challenging work environment, requiring rapid and constant learning and skill development.• You have a systematic approach to problem-solving within a team and on your own.• You have excellent analytical, communication, and documentation skills.• You are interested in working with and assisting in the design of complex electronic hardware and systems.• You have experience with scripting languages like Tcl or Perl.• You have experience with C driver development.• You have used a variety of test equipment in a technical lab environment.• You have taken engineering courses in digital design, computing systems, software languages, communications protocols, and/or other relevant areas.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.pmcs.com/careers",
	"company" : "PMC-Sierra Inc.",
	"division" : "Operations Head Office - Burnaby",
	"website" : "www.pmcs.com"
}