{
	"id" : "53989",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Vulnerability Researcher Intern",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "n/a",
	"frequency" : "Monthly",
	"job_description" : "Position Title: Vulnerability Researcher InternGE Business: GE Software (Wurldtech)Location: Vancouver, British ColumbiaDuration: 4 or 8 monthsAnticipated Start Date: May 2015Number of positions: 1Reporting to: Team Lead, Threat IntelligenceAbout Us:General Electric Company (NYSE: GE) is a place where you can live your dreams.&nbsp; Our global presence, innovation and financial strength help to make GE a dynamic place to work, giving you the advantage of a large company, with the agility of a small one – where individual voices are heard.Founded in 2006 and acquired by GE in 2014, Wurldtech provides information security systems and services to industrial customers. Wurldtech’s internationally-recognized information security experts work extensively with both manufacturers and operators of critical infrastructure, and protect connected systems ranging from oil refineries, to smart meters on your home, to personal medical devices such as insulin pumps. We help our customers around the world assess and mitigate information security vulnerabilities to protect networks of internet connected devices and reduce the risk and cost of potential attacks.The Position:As the Student Vulnerability Researcher you will be joining a challenging and engaging environment as part of the Wurldtech Threat Intelligence team.&nbsp; In this role, you will have an opportunity to work alongside experienced professionals within the field of Computer Security and Reverse Engineering.&nbsp; You will gain exposure supporting the Threat Intelligence/Engineering department and assist the greater organization in achieving its annual goals and objectives as an active participant.Nature of work:In this role, your responsibilities will include (but are not limited to);• Researching into new vulnerabilities/security issues in industrial control systems/software to create IPS/IDS signatures.• Setting up and exploring new experimental security tools and research targets.• Assisting development teams in testing security of Wurldtech products.• Managing incoming 3rd party security feeds into internal systems and processes.• Writing reports detailing vulnerabilities in systems/software in terms of their technical mechanism, impact, and how they could be mitigated.",
	"job_requirements" : "Skills:• Proven exposure and experience in Information Security (Reverse Engineering, CTF participation, Crackme’s or other security challenges).• Ability to create tools and scripts to assist in automation of tasks (Python, LUA, shell scripting).• Ability to read and understand a variety of programming languages (Python, Java, C/C++).• Exposure to Assembly level programming and able to identify structures in assembly (x86, amd64, or ARM).• Shows high energy, curiosity and a willingness to learn.Education:• College, University or Master’s Degree in course of completion in Engineering (Computer, Electrical, Software or Systems), Computer Science, Information Technology or equivalent related discipline.☒&nbsp;&nbsp;&nbsp;&nbsp; College Level&nbsp;&nbsp;☒&nbsp;&nbsp;&nbsp;&nbsp; University Level&nbsp;&nbsp;☒&nbsp;&nbsp;&nbsp;&nbsp; Masters Level&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ENGINEERING BUSINESS & COMMERCE ARTS & SCIENCE COMPUTING & INFORMATION SYSTEMS☐ Aerospace Engineering☐&nbsp;&nbsp; Accounting☐&nbsp; Communications☒ Computer Science☐ Biomedical Engineering☐&nbsp;&nbsp; Business Analytics☐&nbsp; English☒ Information Technology☐ Chemical Engineering☐&nbsp;&nbsp; Business Administration☐&nbsp; Environmental Health ☐ Management Information Systems☒ Computer Engineering☐&nbsp;&nbsp; Finance☐&nbsp; Kinesiology☒ Electrical Engineering☐&nbsp;&nbsp; Human Resources☐&nbsp; Occupational H&S☐ Environmental Engineering☐&nbsp;&nbsp; Marketing☐&nbsp; Journalism☐ Industrial Engineering☐&nbsp;&nbsp; Operations☐&nbsp; Public Relations☐ Manufacturing Engineering☐&nbsp;&nbsp; Supply Chain & Logistics☐ Materials Engineering&nbsp;☐ Mechanical Engineering&nbsp;☐ Mechatronics Engineering&nbsp;☐ Physics&nbsp;☒ Software Engineering&nbsp;☒ Systems Engineering&nbsp;Desired:• Preference for an 8 month term.• 1-2 years of experience in a related field.• Knowledge of cryptography and related technologies.• Experience with Web technologies (JavaScript, Django, Apache, etc).• Experience with IDA Pro/Hex rays, OllyDBG, or other disassemblers/debuggers.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.campuscareers.ge.ca",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Interested applicants are to apply online at www.campuscareers.ge.ca.Applications not submitted online will not be considered.SEARCH VACANCY NO: 2026217Candidates are to submit a cover letter, resume, and transcript.&nbsp; It is a mandatory requirement that you identify your school, cumulative GPA, and anticipated graduation date as part of the application process.Company:GE (General Electric) Canada",
	"division" : "Main"
}