{
	"id" : "53990",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Software Engineer Intern",
	"job_location" : "Hong Kong",
	"number_of_positions" : "1",
	"salary" : "HKD $8000 (~CAD$1000)",
	"frequency" : "Monthly",
	"job_description" : "Software Engineer InternDo you thrive in situations that need you to move fast? Does it excite you, knowing that each week won’t be the same as the last? We have an opportunity for you.&nbsp; Shopline is the easiest place to open an online shop on the internet. We are a SiliconValley-funded, 500 Startups Accelerator company, is looking for a passionate and talented Software Engineer to join our team in Hong Kong. We are growing fast, and need self-driven developers who can thrive in a fast-pace environment.What technologies will you be working with?- HTML5/CSS3/JS, AngularJS, Ruby on Rails- Redis, MongoDB, Beanstalkd, AWS- Native Android (Java) and iOS (Objective-C)Why you should join us?We work in a collaborative open space where we encourage creativity and ideas flow freely.You’ll be able to steer the future roadmap to improve our products, big or small, and see the results of your products reach our customers.Get to work with flexible working hours. Our priority is on getting the job done.Flat structure environment, you will be able to work independently and make your own choices.We provide guidance and mentorship to polish your technical skills as well as your entrepreneurship mindset.Ability to deploy and launch your work daily. No need to wait for lengthy management approval.We are one of the standout tech startups in Hong Kong, targeting a huge opportunity in Asia.Shopline is a part of the 500 Startups Accelerator and Incubated by Hong Kong Cyberport, giving us a massive network of advisors and resources globally.&nbsp;",
	"job_requirements" : "What are we looking for?- Even though experience and past projects are a plus, the main trait we look for is willingness to learn and passion to develop a product you can be proud of.- Besides coding, we hope that the successful candidate can make an instant impact in the team by providing his/her own opinion and suggestions.- Willingness to take ownership of task and features assigned.Our TeamWe are small team with a balanced mix of startup and corporate experience. Our core team consists of veterans in business, engineering and design.ShoplineShopline is a DIY ecommerce platform for creating online shops for merchants in Asia. Our differentiation lies in our simplistic setup process, native language support, regional payment methods and the fact that the entire experience is optimised for mobile. All shops are completely responsive and adapts to all screen sizes so the customer experience is consistent on everydevice. Our goal is to empower small businesses in Asia with simple-to-use tools that complements the way they do business and allowing them to succeed in e-commerce. The long term vision is to build a complete social e-commerce platform that drives value to both merchants and consumers.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Starling Labs",
	"division" : "Starling Labs"
}