{
	"id" : "53997",
	"application_deadline" : "Mar 31, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "PRODUCT ENGINEERING CO-OP (JOB # 1088715001)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "PRODUCT ENGINEERING CO-OPCharacterization of Mixed Signal MicrochipsMix of Hardware and Software WorkAbout the JobDivision: Product EngineeringAPPLY WITH RESUME AND TRANSCRIPT TO JOB # 1088715001The Product Engineering group is responsible for characterizing the mixed signal circuitry on new prototype microchips to ensure our products work in customer systems.&nbsp;As a member of the Product Engineering team, you will work with Senior Product Engineers to test and characterize PMC-Sierra’s new products.Responsibilities:• Work with a cross-functional team to ramp new semiconductor products to production• Plan and implement characterization tests on new high-speed mixed-signal semiconductor devices using state-of-the art test equipment and dedicated test hardware.• Automate tests to gather large statistical samples to correlate performance to simulation over operating conditions and manufacturing variances.",
	"job_requirements" : "Your qualifications:• Education Level&nbsp; 3rd or 4th year students• Excellent verbal and written communication skills in English• Excellent interpersonal and teamwork skills• Excellent analytical and debugging skills.• Strong scripting skills• Thorough knowledge of circuit theory and semiconductor fundamentals• Knowledge of Fourier Analysis and CMOS circuits• No direct experience required but solid lab skills are a must.• Prefer student with experience in testing and debugging electrical circuitsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.pmcs.com/careers",
	"company" : "PMC-Sierra Inc.",
	"division" : "Operations Head Office - Burnaby",
	"website" : "www.pmcs.com"
}