{
	"id" : "53992",
	"application_deadline" : "Mar 31, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "ESD PRODUCT DESIGN COOP (JOB # 1088415001)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "ESD PRODUCT DESIGN COOPAbout the Job:Location: Burnaby, BCAPPLY WITH RESUME AND TRANSCRIPT TO JOB # 1088415001Job Responsibilities:The Platform Architecture group within Product Development is responsible for defining next-generation products and features within the Enterprise Storage Division.&nbsp;&nbsp; This involves evaluation of the performance characteristics of the current generation of our flagship RAID and IO controllers, defining architectural changes to both the firmware and hardware and the prototyping of new feature concepts.As a co-op in this area, one or more of these activities would be assigned:• Design, implementation and debug of multi-core, multi-threaded embedded firmware in C and assembly• Participate as part of a team in the technical analysis of SAS/SATA/PCIe/RAID System-On-Chip (SoC) architectures• Assist with analysis of next-generation power, switching, performance and SoC architectures.• Effectively present technical information to a small team of senior engineers.• Interact regularly with hardware, verification and firmware teams to resolve issues, communicate status and drive technical investigations.&nbsp;",
	"job_requirements" : "Job Qualifications:• Currently enrolled in Electrical Engineering, Computer Engineering or Computer Science.• Training or experience with multi-processor real-time programming.• Experience with C or C++ programming languages.• Experience in a typical development lab environment.• Familiarity with Windows and/or Linux operating systems.• Experience with Integrated Development Environments (IDEs).• Knowledge of MIPS and other RISC processors and associated instruction sets an asset.• Knowledge of VHDL and/or Verilog an asset.• Knowledge of PCIe, SAS and/or SATA protocols an asset.• Experience with scripting languages such as Python, Tck/Tk and Perl.• Ability to quickly ramp on new concepts, firmware and hardware.• Excellent analytical, communication and documentation skills• Previous co-op experience is an asset.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.pmcs.com/careers",
	"company" : "PMC-Sierra Inc.",
	"division" : "Operations Head Office - Burnaby",
	"website" : "www.pmcs.com"
}