{
	"id" : "54000",
	"application_deadline" : "Mar 31, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "PRODUCT DEVELOPMENT ENGINEER COOP (JOB # 1089515001)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "PRODUCT DEVELOPMENT ENGINEER COOPAbout the JobDivision: Broadband Wireless DivisionAPPLY WITH RESUME AND TRANSCRIPT TO JOB # 1089515001As a co-op in the Broadband Wireless group, you will work on developing PMC-Sierra’s next generation of wireless IC products.&nbsp; This will involve taking a design from initial concept to production form. Throughout your co-op term you will work beside experienced engineers and be exposed to PMC-Sierra’s Best-In-Class engineering practices.Job ResponsibilitiesYou will be responsible for design and/ or verification of digital integrated circuits at the block level or top level of a device. Responsibilities could include contributing to the investigation of a device feature set, designing and/ or verifying device features, performing development activities such as Formal Verification, Design for Testability and Static Timing Analysis.",
	"job_requirements" : "Job Qualifications:• Currently enrolled in Electrical Engineering or Computer Engineering• CGPA &gt;3.0• Strong interest in and familiar with wireless data communications theory and systems• Proficient in VHDL and/or Verilog• Experience in designing, implementing and verifying VHDL or Verilog based designs• Familiarity with design and verification practices; Static Timing Analysis is an asset• Matlab experience is an asset• Experience with FPGAs.• Good programming / scripting skills with languages such as Python, Tcl, Awk, C and Perl• Excellent analytical, communication and documentation skills• Previous co-op experience is an assetOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.pmcs.com/careers",
	"company" : "PMC-Sierra Inc.",
	"division" : "Operations Head Office - Burnaby",
	"website" : "www.pmcs.com"
}