{
	"id" : "54004",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Junior programmers",
	"job_location" : "Cambridge, ON",
	"number_of_positions" : "3",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Company Profile&nbsp;&nbsp;JOMAR, www.jomarsoftcorp.com, is a customer focused company founded in 1982. It&nbsp; is an established and successful software firm. The company develops market leading Enterprise Mobility Software and Technology for its clients that provide goods and services for a diverse group of industries and markets such as: &nbsp;Advanced Aerospace Composites, Automotive, Military, Ballistics/Soft Body Armor, Fire and Chemical Protection, Polymers, Plastics, Rubber, Marine, Environmental Protection, Smart Grid Utility Infrastructure Support and Metering, Police Force, Emergency Services and Insurance.&nbsp;Our clients are located in Canada, U.S.A., UK, Europe, China&nbsp; and South America. &nbsp;They are innovative organizations many of which are &nbsp;market leaders in the sectors they serve.&nbsp;JOMAR is opening a long term marketing and support services office in VancouverJan 1, 2015 to support its growth and expansion in Western North America. The office will be managed by senior JOMAR support staff with 15-25 years of experience working with JOMAR clients worldwide.",
	"job_requirements" : "&nbsp;The following positions are available to Co-op and graduate students&nbsp;Junior programmers ( 2-3 positions)&nbsp;Applicants should be open minded and customer service orientedSelf motivated, analytical and problem solversMust be able to communicate, work to schedules and co-operate in a team environmentWilling to learn and work with a variety of market leading technologies.&nbsp;Knowledge of ERP, Manufacturing, Distribution, Smart Grid Utility, Insurance Industry systems would be an asset but is not a requirement. An understanding of Mobile Technology and Apps would also be advantageous.&nbsp;Technical skill sets that will be developed/utilized: JAVA, XML,SQL, Microsoft Windows, Linux, Oracle, Apple iOS&nbsp; and Google AndroidOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "JOMAR Softcorp International Inc.",
	"division" : "Head Office",
	"website" : "http://jomarsoftcorp.com/"
}