{
	"id" : "54009",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Java Developer Intern",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "N/A",
	"frequency" : "Monthly",
	"job_description" : "Position Title: Java Developer InternGE Business:&nbsp; GE Software (Wurldtech)Location: Vancouver, British ColumbiaDuration: 8 monthsAnticipated Start Date: May 2015Number of positions: 1Reporting to:&nbsp; Team Lead Middleware/UIAbout Us:General Electric Company (NYSE: GE) is a place where you can live your dreams.&nbsp; Our global presence, innovation and financial strength help to make GE a dynamic place to work, giving you the advantage of a large company, with the agility of a small one – where individual voices are heard.Founded in 2006 and acquired by GE in 2014, Wurldtech provides information security systems and services to industrial customers. Wurldtech’s internationally-recognized information security experts work extensively with both manufacturers and operators of critical infrastructure, and protect connected systems ranging from oil refineries, to smart meters on your home, to personal medical devices such as insulin pumps. We help our customers around the world assess and mitigate information security vulnerabilities to protect networks of internet connected devices and reduce the risk and cost of potential attacks.The Position:As the Java Developer you will be joining a fast-paced and energetic environment as part of the Middleware/UI team.&nbsp; In this role, you will have an opportunity to work alongside experienced professionals within the field of software development.&nbsp; You will gain exposure supporting the Middleware/UI team and assist the greater organization in achieving its annual goals and objectives as an active participant.Nature of work:In this role, your responsibilities will include (but are not limited to);• Working as part of an agile development team in writing Java code with quality and best practices.• Supporting software development and bug fixing.• Designing and automating unit and integration tests for software components.• Supporting development team in achieving overall sprint goals.• Collaborating with development, security and QA team in setting up the testing framework for intra-component and inter-component testing.• Taking ownership of features, bugs and tasks and resolving them.",
	"job_requirements" : "Skills:• Experience and understanding with Java/J2EE web application development. years• Experience and understanding with testing platform or libraries (JUnit, TestNG, etc.).• Experience and understanding with object oriented programming and data structures.• Ability to develop on Linux environment.• Familiarity with version control system (Git, SVN, etc).• Exposure in SCRUM or Agile development methodology.• Ability to work independently and as part of team.Education:• Bachelor degree (3rd year or greater) or a Masters student with a degree in course of completion in Engineering (Computer, Electrical, Software or Systems), Computer Science, Information Technology or equivalent related discipline.☐&nbsp;&nbsp;&nbsp;&nbsp; College Level&nbsp;&nbsp;☒&nbsp;&nbsp;&nbsp;&nbsp; University Level&nbsp;&nbsp;☒&nbsp;&nbsp;&nbsp;&nbsp; Masters Level&nbsp;Desired:• Candidates that have had previous coop experience.• Experience with ORM framework (Hibernate, Ebean, etc).• Knowledge of networking protocols and concepts.• Experience with database (PostgreSQL, SQLServer, MySQL, Oracle, etc).• Knowledge in design patterns and build tools.This opportunity is intended for current students who will be returning to their in-class studies upon the completion of the work term.&nbsp; It is not open to candidates who will have graduated prior to the start of this position.Please note that this position does not provide a subsidy for relocation expenses.Only those selected for an interview will be contacted.&nbsp; Thank you for your interest in joining GE.GE – Your Future WorksAn Equal Opportunity EmployerFor more information on GE, visit our Website at www.campuscareers.ge.caOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.campuscareers.ge.ca",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Interested applicants are to apply online at www.campuscareers.ge.ca.&nbsp;&nbsp;Applications not submitted online will not be considered.SEARCH VACANCY NO: 2027690Candidates are to submit a cover letter, resume, and transcript.&nbsp; It is a mandatory requirement that you identify your school, cumulative GPA, and anticipated graduation date as part of the application process.Company:GE (General Electric) Canada",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):2027690"
}