{
	"id" : "54007",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "MOBILE / WEB APPLICATION DEVELOPER ? CO-OP POSITION",
	"job_location" : "Surrey, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Position Description&nbsp;Cambian is looking for enthusiastic, hard working and highly motivated computer science co-op students to participate in the development of patient-centric healthcare IT systems.If you want to get experience solving challenging problems, delivering high-impact solutions to customers, employing leading-edge technologies, and working with extraordinary people, Cambian is the place for you!&nbsp;We are recruiting candidates for 4 or 8 month work terms involving the design, implementation, and testing of Mobile / Web application technologies. The selected candidates will work with a team of Cambian developers on one or more groundbreaking healthcare information technology applications.Knowledge of the healthcare IT market is desirable but not necessary.About us&nbsp;Cambian is a leading healthcare information technology solution provider. Cambian delivers solutions including world-class products, integrated systems, enabling technologies, and managed information services. Cambian is headquartered in Surrey, BC, and services customers across North America.",
	"job_requirements" : "Qualifications and Experience&nbsp;We are looking for candidates with the following skills, abilities, and credentials:Skilled in Java EE, XML, SQLMobile app development on iOS or Android platformsGUI development including working knowledge of HTML, JavaScript, XMLObject-oriented designIntegration of third party componentsTest case developmentGood troubleshooting skillsAble to work in a team environmentExcellent English written and oral communication skillsWorking towards a bachelor's degree in computer science or an engineering/scientific disciplineOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Cambian Business Services Inc.",
	"division" : "Product Development"
}