{
	"id" : "54002",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Co-op, Data Science",
	"job_location" : "East 8th Avenue, Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "About Hootsuite:At Hootsuite, all co-op students pair with a mentor on a small team to build and ship production-ready code in modern languages.&nbsp; Our motto is learning happens in production.We practice continuous delivery, and ship new code to production multiple times each day in order to test hypotheses about our changes. We value autonomy, curiosity, and entrepreneurialism. We want teammates who participate, challenge us, ask hard questions, and drive continuous improvement.Interested in our past Co-op’s experiences? Check out: http://ow.ly/FGvlGHootsuite is looking for an exceptional Co-op to join the team at our HQ in Vancouver, BC. The ideal candidate would be a student pursuing a degree in a quantitative subject such as Computer Science, Statistics, Economics, Mathematics or Physics. This owl will be a part of the Data Lab team.Want to know what we’re working on? Visit our Engineering blog: code.hootsuite.comResponsibilities:● Build and ship critical internal data products● Participate in code reviews and design reviews to continually improve your craft and approach to problem solving● Collaborate in small teams to design, build, and ship high quality software, analysis and data sets to internal stakeholders● Iterate in an agile fashion; creating hypotheses and test them with incremental changes● Perform ad-hoc queries to inform business stakeholders● Extract, combine and make sense of large data sets from a wide variety of data sources● Contribute to our data pipeline codebaseWhy Vancouver?Vancouver is the perfect place to find balance. From yoga and hiking, to skiing and snowshoeing; fine dining or cheap eats; we have it all. The talent, the city, the beautiful outdoor setting; it all makes for an enticing location to live, work and play. Our city is growing and quickly becoming a hub for technological innovation. Hootsuite is a huge part of that movement and we want you to join us for the ride. Come and learn from the Front-end Engineers driving this transformation and experience Vancouver as the heart of Canadian Tech.",
	"job_requirements" : "Required Skills & Experience:● Curiosity, skepticism, and persistence● Knowledge of SQL query fundamentals● Knowledge of statistical techniques and data analysis● Knowledge of a at least one of (R, Python, Scala)● Solid understanding of data modeling and database design● Ability to work independently and contribute to a team environmentBonus Assets:● A link to your github account and personal projects you've worked on● So much passion for data and statistics that you do it for fun● Active in social mediaOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "HootSuite Media Inc",
	"division" : "Head Office",
	"website" : "https://hootsuite.com"
}