{
	"id" : "54008",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Quality Assurance (QA) Engineer Intern",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "n/a",
	"frequency" : "Monthly",
	"job_description" : "Position Title: Quality Assurance (QA) Engineer InternGE Business: GE Software (Wurldtech)Location: Vancouver, British ColumbiaDuration: 8 monthsAnticipated Start Date: May 2015Number of positions: 1Reporting to:&nbsp; QA ManagerAbout Us:General Electric Company (NYSE: GE) is a place where you can live your dreams.&nbsp; Our global presence, innovation and financial strength help to make GE a dynamic place to work, giving you the advantage of a large company, with the agility of a small one – where individual voices are heard.Founded in 2006 and acquired by GE in 2014, Wurldtech provides information security systems and services to industrial customers. Wurldtech’s internationally-recognized information security experts work extensively with both manufacturers and operators of critical infrastructure, and protect connected systems ranging from oil refineries, to smart meters on your home, to personal medical devices such as insulin pumps. We help our customers around the world assess and mitigate information security vulnerabilities to protect networks of internet connected devices and reduce the risk and cost of potential attacks.You will be part of a cross-disciplinary development team working on a variety of products. We are looking for a World-Class System QA/Test Engineer responsible for designing, developing, maintaining, and executing both manual and automated tests for our security products. Reporting into the QA Manager, you will interact closely with the Product Owner and scrum teams and will be expected to understand the product thoroughly and be a strong quality advocate.The Position:As the QA Engineer you will be joining a fast-pace and energetic environment as part of the NGFW QA team.&nbsp; In this role, you will have an opportunity to work alongside experienced professionals within the field of QA.&nbsp; You will gain exposure supporting all stack of the NGFW product (firewall hardware, UI Management Console, Engine and OS area) and assist the greater organization in achieving its annual goals and objectives as an active participant. This job is mainly technical and requires good scripting and programming skills.Nature of work:In this role, your responsibilities will include (but are not limited to);• Running and automating the full system integration test• Designing, developing, maintaining, and executing test cases for product requirements that are scalable, repeatable, and measurable.• Reviewing product documentation and write test cases.• Configuring test environments, servers, monitor performance tests and identifying application bottlenecks.• Reproducing and troubleshooting the bug with developer.• Taking ownership of defects found during testing and providing information to developers including driving follow-up actions when necessary.",
	"job_requirements" : "Do you qualify? We are seeking…Skills:• Keen attention to details and strong analytical, problem solving, troubleshooting, and prioritization skills.• Strong knowledge of software testing methodologies.• Testing experience designing and executing performance, reliability, scalability and stress test against web applications and/or embedded software applications.• Good knowledge in Linux OS and how memory, CPU, disk and I/O are utilized.• Hands-on experience configuring test environments, Linux servers, monitor performance tests and identifying application bottlenecks.• Past experience automating test case.• Very familiar with Unix/Linux command-line environment.• Ability to write clear and reproducible reports and test results.• Experience with test case management tools and issue tracking software (e.g. JIRA).• Knowledge of at least one scripting language: Shell, Ruby, Perl, Python, etc. (at least 1 coop terms of experience).Education:• College, University or Master’s Degree in course of completion in Engineering (Computer, Electrical, Software or Systems), Computer Science, Information Technology, or equivalent related discipline.&nbsp;Desired:• Two or more coop terms of experience in a related field.• Able to read and understand at least one higher level language, e.g. C/C++, Java.• Experience working with hardware and writing Manufacturing Tests.• Understand software principles such as multi-threading, memory management, caching, garbage collection.• Knowledge of web technology: Apache Server, Tomcat, JSON, JavaScript.• Experience with QA testing and automation.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.campuscareers.ge.ca",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Interested applicants are to apply online at www.campuscareers.ge.ca.&nbsp;Applications not submitted online will not be considered.SEARCH VACANCY NO: 2027047Candidates are to submit a cover letter, resume, and transcript.&nbsp; It is a mandatory requirement that you identify your school, cumulative GPA, and anticipated graduation date as part of the application process.Company:GE (General Electric) Canada",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):2027047"
}