{
	"id" : "54018",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Electrical Designer Co-op",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Avigilon Corporation is defining the future of protection through innovative end-to-end security solutions.&nbsp; Avigilon’s industry-leading HD network video management software, megapixel cameras, access control and video analytics products are reinventing the global security market.Avigilon's solutions protect and monitor thousands of customer sites in more than 100 countries around the world. Avigilon Control Center, an award-winning HD Network Video Management Software platform, a broad range of industry leading megapixel cameras (1-29 MP), open platform access control systems and video analytic solutions, deliver full situational awareness together with unmatched image detail. Campuses, transportation systems, healthcare providers, cities, retailers, and manufacturing sites are just a few of the complex business operations that benefit from the delivery of indisputable video evidence.In 2013, Avigilon was the fastest growing company in Canada on the PROFIT 500. The Company was also named Cantech's Stock of the Year (TSX), as voted by Canada's top financial analysts. The previous year saw Avigilon named the Fastest Growing Technology Company in Canada, the Fastest Growing Software Company in North America for the second year in a row, and the 'Company of the Year' by the BC Technology Industry Association.For the duration of your work term, you will be a member of a multi-disciplinary engineering team responsible for the design and implementation of the next generation of Avigilon’s market-leading high-performance surveillance system. The electrical design components of the system include elements of• support circuitry for embedded media processors and FPGAs• high-speed digital signaling involving DDR SDRAM, Ethernet, and CMOS image sensors• high-speed, low-noise analog signal conditioning,• high-speed clock driver design for image sensors,• high-efficiency power supply design,• digital and analog control loops,• electro-mechanical control and drive circuitry,• microcontroller-based subsystemsYour ability to work productively with vendors, manufacturing personnel, programmers and designers from other disciplines is essential.&nbsp; Proven dedication, tenacity, and the ability to deliver results is a requirement.Responsibilities include:• Design of electronic circuits using EDA tools including SPICE simulators and schematic capture and PCB layout tools.• Ad-hoc building and testing of electronic circuits using electronics workbench tools and test equipment.• Testing, troubleshooting, and kludging of first revisions of electronic circuit boards.• Creation and maintenance of design documentation, assembly trees and bills of materials.• Estimation of work and cost required to complete proposed tasks and the tracking of the work and cost as the tasks progress.Follow and learn more about Avigilon at:Website: avigilon.comFacebook: facebook.com/avigiloncorporationTwitter: twitter.com/avigilonYouTube: youtube.com/user/avigilon",
	"job_requirements" : "Qualifications:• Demonstrated enthusiasm for electronics• Demonstrated pragmatic approach to problem solving• Hands-on experience in a testing and troubleshooting role• Strong organizational and documentation skills• Strong understanding of analog and digital circuits, and the ability to critically assess and optimize the performance of designs• Strong soldering and improvisation abilitiesOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Avigilon",
	"division" : "Main",
	"website" : "www.avigilon.com"
}