{
	"id" : "54020",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Software Developer Co-op",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Avigilon Corporation is defining the future of protection through innovative end-to-end security solutions.&nbsp; Avigilon’s industry-leading HD network video management software, megapixel cameras, access control and video analytics products are reinventing the global security market.Avigilon's solutions protect and monitor thousands of customer sites in more than 100 countries around the world. Avigilon Control Center, an award-winning HD Network Video Management Software platform, a broad range of industry leading megapixel cameras (1-29 MP), open platform access control systems and video analytic solutions, deliver full situational awareness together with unmatched image detail. Campuses, transportation systems, healthcare providers, cities, retailers, and manufacturing sites are just a few of the complex business operations that benefit from the delivery of indisputable video evidence.In 2013, Avigilon was the fastest growing company in Canada on the PROFIT 500. The Company was also named Cantech's Stock of the Year (TSX), as voted by Canada's top financial analysts. The previous year saw Avigilon named the Fastest Growing Technology Company in Canada, the Fastest Growing Software Company in North America for the second year in a row, and the 'Company of the Year' by the BC Technology Industry Association.As a member of our software team you will become part of a multi-disciplinary engineering team responsible for the creation of the next generation of Avigilon's market-leading products. The software component of these products includes high throughput networking, image analysis and processing, image rendering, and data storage subsystems. You will be chiefly responsible for designing and implementing a subset of these components for both Windows .net and Linux environmentsResponsibilities include:• Application of object oriented patterns for the design of concurrent and networked software components• Use of C and C++ and associated compilers, linkers, debuggers, and visual design environments to produce robust, high performance applications and libraries across multiple platforms• Creation and maintenance of succinct design documentation• The debug and maintenance of existing software products.• Estimation and tracking of time required to complete assigned tasksFollow and learn more about Avigilon at:Website: avigilon.comFacebook: facebook.com/avigiloncorporationTwitter: twitter.com/avigilonYouTube: youtube.com/user/avigilon",
	"job_requirements" : "Qualifications:• Progress towards a degree in Computer Engineering, Computer Science, or related technical discipline• Strong C and C++ design and programming ability• Academic or job related experience developing software in both Windows .net and Linux environments.• Academic or job related experience designing and implementing concurrent, networked, and high data throughput systems• Academic or job related experience with scripting languages, build systems, and version control systems• Excellent written and oral communication skills• Self-motivated, with the ability to learn quickly and independently, and also work within a team• A demonstrated pragmatic approach to problem solving• Understanding of modern memory, storage, I/O bus, processor, operating system, networking, and database architectures• Familiarity with x86 assembly language, SIMD, and low level debugging and code optimization• Knowledge of digital imaging and audio/video coding• Exposure to Agile software development practices• Exposure to embedded software development on a variety of hardware platformsPreference will be given to senior level co-op students in the following programs:• Computer Engineering• Electrical Engineering• Computer Science• Engineering PhysicsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Avigilon",
	"division" : "Main",
	"website" : "www.avigilon.com"
}