{
	"id" : "54026",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Application Software Co-op",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "2",
	"salary" : "$18-$45 /hr",
	"frequency" : "Hourly",
	"industry" : "Semiconductor",
	"job_description" : "Broadcom Corporation, the fabless wired and wireless communications semiconductor innovator is hiring.&nbsp;As one of Fortunemagazine’s “Most Admired Companies” we promote an open work environment, embrace change, take risks and do the impossible every day. Aggressive execution is at the core of who we are and we take pride in ‘outdoing’, ‘outsmarting’ and ‘outselling’ the competition.&nbsp;Today, we’re seeking software innovators and team players who get things done and share a passion for cellular, Bluetooth® and Wi-Fi® technology, high-speed Internet access, Voice-over-Internet Protocol, digital security, and more. Now is your chance to join the strongest engineering team and use the latest tools and methodologies to solve real-world problems for the world’s most impressive brands in the consumer electronics industry.Broadcom Canada is located in Richmond, BC’s Lower Mainland, within close proximity of Vancouver’s ocean and mountains. The region is known for its natural beauty and rich multi-cultural heritage.A Company of Innovation and EngineeringBroadcom is a company created by engineers, managed by experienced industry leaders and powered by the talents of a highly diverse and motivated workforce. We support a multi-cultural environment and make it our business to hire, inspire and develop the very best people in the industry, worldwide. &nbsp;Our culture emphasizes collaboration, cooperation and distributed decision making. Small teams of smart people focused on solving difficult challenges and delighting customers on a regular basis. It's the type of environment where you can see your talents make an immediate and lasting impact.For more, please see http://jobs.broadcom.com/&nbsp;",
	"job_requirements" : "Responsibilities: The Broadcom Canada development centre is responsible for delivering product solutions and platforms based on Broadcom’s cutting edge multimedia application processors for the mobile, tablet, and VoIP market segment.&nbsp; The Applications Engineering team is responsible for implementing solutions and resolving technical barriers so that our customers can get their product to market. As a member of the AE team, you will work closely with some of the top consumer and enterprise product developers and manufacturers in the world. You will be responsible for developing technically diverse solutions and feature sets, and ensuring that the resulting solution meets customer requirements.&nbsp;If you enjoy a challenging and diverse role with direct customer contact and the opportunity to continually learn, then this team is for you.&nbsp; The breadth of software responsibility is extensive – Linux and Android, BSP/device drivers, wired and wireless networking protocols, security protocols, VoIP signal processing algorithms, and video/multimedia protocols.&nbsp;&nbsp;The ideal candidate would be able to demonstrate the following skills and traits:-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Knowledge of embedded, networking, and multimedia technologies-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; An ability to learn and adapt quickly to new technical areas-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A pragmatic approach to problem solving-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Proficient in C/C++-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Enjoys working in a team but can operate independently-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Clear and concise communication skills&nbsp;Co-op employees are well compensated, and we do our very best to ensure that your experience is a very rewarding one.&nbsp; We provide relocation stipends and can help to find housing in the Richmond area. Broadcom provides all employees with a subsidized vending machine, free beverages, access to gyms, as well as many other on-site amenities. We have an active social committee which organizes a number of activities where you can socialize and get to know your colleagues.&nbsp;**Please note that all roles with Broadcom are subject to compliance with US Export laws.&nbsp; In order to ensure compliance with such laws, all persons hired will be required to provide information regarding citizenship before commencing the role so that any legal issues and additional requirements can be identified. &nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Cover letter not required. GPA is requested.Company:Broadcom Canada Ltd.",
	"division" : "Recruiting - University Relations Dept.",
	"website" : "www.broadcom.com"
}