{
	"id" : "54030",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Associate Software Engineer Co-op - FIFA Gameplay",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Position Title:&nbsp; Associate Software Engineer Co-opTeam: FIFA GameplayLocation:&nbsp; EA Canada, Burnaby, BCHow to ApplyIn addition to applying through your co-op office, please create a profile on our student applicant site.&nbsp; You can apply via this link https://ea.avature.net/university?tags=lwhittle&nbsp;Please indicate clearly whether you are available for a 4 month, 8 month, 12 month or 16 month term.&nbsp; Most positions are 4 or 8 months depending on your availability, but we do consider longer co-op terms.To apply you must have the legal right to work in Canada – copies of work permits may be requested for those that are not Canadian Citizens or Permanent ResidentsPosition OverviewCome join the team that made the best football game ever and help us make our game even better!&nbsp; The focus of this position is to improve the performance of our features by creating and updating the tools that other engineers will use.The biggest responsibility of a Systems SE is to make sure the game ships. This comes from ensuring memory budgets are in line and performance is staying on track.&nbsp; Systems SE’s can ensure these things happen through the power of metrics.&nbsp; On occasion, a Systems SE will need to exercise the ability to fix deep, low-level problems.&nbsp;&nbsp;Systems SE’s are expected to be extremely pro-active in finding and fixing problems.&nbsp; They’re approach may involve following up with other team members and telling them that they broke something and need to fix it, or following up with designers and letting them know that a feature needs to be reduced in scope to fit within budget.&nbsp;A Systems SE at EA is skilled in C++, make, NANT (or similar experience with maintaining and extending build systems for code and data), python, batch files and animation data formats.• Expertise and experience in pipelines, and low level console libraries• Design, maintain, implement, test and debug code.• Create tools, features and engine components to required coding standards.• Profiling and optimizing software components of a game.About EAIt’s not easy building the world’s best digital playground. It’s hair-standing-up-on-end-exhilarating. It’s down-in-the-trenches-challenging. Its stroke-of-brilliance-at-midnight creative. It’s you—taking risks, challenging yourself, pursuing ideas, changing the way millions of people do something they love: Play. We’re EA—we’ve been making games for decades but you wouldn’t know that walking through our studios. We’re still buzzing with the same innovative spirit we began with, though we’ve learned enough to earn our rank as a leading developer, publisher and distributor of the world’s best games. What began as a small group of people determined to “put real life in a box” has become an 8,000-people strong, worldwide organization delivering on that very dream. If you’ve played The Sims lately, you know exactly what we mean. And if you’ve played Battlefield 4, maybe you’d say that we’ve done real life one better.Whether you’re building Springfield on your mobile or your palms are sweaty from clutching your controller during intense games of FIFA 15, chances are you’ve played an EA game. And if you haven’t, well, what are you waiting for? In an industry that’s changing every day—whether it’s through new social channels, advancing technology, new audiences or unique opportunities for monetization—EA is positioned for growth thanks to smart business plans, strategic acquisitions, and most importantly, our creative people around the world who gather each day to unite the world through play. We take that last part very seriously, so if what you’re reading excites you as much as it does us, we invite you to get to know us better.",
	"job_requirements" : "Qualifications• Demonstrated knowledge of good software engineering practices• Good communication and writing skills• Excellent problem solving skills• Strong math skills including statistics, trigonometry, calculus and linear algebra.• Self-starter who can work with others in a team-oriented environment as well as independently• Ability to adapt to quickly changing project requirements and continuous feedback• Ability to learn and adapt quickly to new technology, platforms, and game areas• The best candidates will have completed personal game or domain expertise projects independent of school• And of course - enjoys working (and playing!) in a dynamic, cutting edge environmentTechnical Qualifications:• C++• Object oriented design & implementation• Proven ability to drive systems optimizations on large scale infrastructure.• Ability to identify and resolve performance bottlenecks in highly complex systems and disk media performance optimizations.• Understanding of memory management, multiple processor use, and runtime optimization.&nbsp; Familiarity with job-based programming is a strong asset.• An ability to test, debug and extend other Software Engineer's code competently.• Experience with scripting languages (Perl, Python, Lua) and C#.&nbsp; Experience with assembler (PowerPC, ARM) is an asset.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://ea.avature.net/university?tags=lwhittle",
	"company" : "Electronic Arts Inc.",
	"division" : "Burnaby"
}