{
	"id" : "54039",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Associate Programmer Co-op - EA Mobile",
	"job_location" : "Charlottetown, PEI",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Position Title:&nbsp; Associate Programmer Co-opTeam: EA MobileLocation:&nbsp; Charlottetown, PEIHow to ApplyIn addition to applying through your co-op office, please create a profile on our student applicant site.&nbsp; You can apply via this link https://ea.avature.net/university?tags=lgodsonPlease indicate clearly whether you are available for a 4 month, 8 month, 12 month or 16 month term.&nbsp; Most positions are 4 or 8 months depending on your availability, but we do consider longer co-op terms.To apply you must have the legal right to work in Canada – copies of work permits may be requested for those that are not Canadian Citizens or Permanent ResidentsPosition OverviewHundreds of millions of people playing connected games every day brings a new breed of problems to the gaming space.&nbsp; We need a new breed of developers to solve them.EA PEI is based in Atlantic Canada and is part of EA's Mobile division. With a team of around 70 employees, our studio is somewhat of a self-contained development hub that specializes in mobile games.&nbsp; We have a very cool downtown office where we extend our track record for building kick-ass mobile games like The Simpsons: Tapped Out.&nbsp; The studio’s atmosphere is fun and relaxed; the people are brilliant and committed.&nbsp; We’re looking for the right person to join our team and help us build the next generation of gaming platforms.About EAIt’s not easy building the world’s best digital playground. It’s hair-standing-up-on-end-exhilarating. It’s down-in-the-trenches-challenging. Its stroke-of-brilliance-at-midnight creative. It’s you—taking risks, challenging yourself, pursuing ideas, changing the way millions of people do something they love: Play. We’re EA—we’ve been making games for decades but you wouldn’t know that walking through our studios. We’re still buzzing with the same innovative spirit we began with, though we’ve learned enough to earn our rank as a leading developer, publisher and distributor of the world’s best games. What began as a small group of people determined to “put real life in a box” has become an 8,000-people strong, worldwide organization delivering on that very dream. If you’ve played The Sims lately, you know exactly what we mean. And if you’ve played Battlefield 4, maybe you’d say that we’ve done real life one better.Whether you’re building Springfield on your mobile or your palms are sweaty from clutching your controller during intense games of FIFA 15, chances are you’ve played an EA game. And if you haven’t, well, what are you waiting for? In an industry that’s changing every day—whether it’s through new social channels, advancing technology, new audiences or unique opportunities for monetization—EA is positioned for growth thanks to smart business plans, strategic acquisitions, and most importantly, our creative people around the world who gather each day to unite the world through play. We take that last part very seriously, so if what you’re reading excites you as much as it does us, we invite you to get to know us better.",
	"job_requirements" : "Qualifications• A strong desire to create compelling game experiences• Top notch programming skills – preference for experienced C++/C# developers, but we hold nothing against other languages.• Excellent written and verbal communication skills.• Evidence of a level 29 Springfield in The Simpsons: Tapped Out*Assets:• Hobby game development experience portfolio.• Familiarity with any of the following:o iOS + Xcode developmento Unity3Do Android/Amazon developmento Eclipseo Command-line experienceo Facebook, Twitter, or other social APIs* Not actually a requirementOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://ea.avature.net/university?tags=lgodson",
	"company" : "Electronic Arts Inc.",
	"division" : "Burnaby"
}