{
	"id" : "54034",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Associate Software Engineer Co-op Java - FIFA",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Position Title:&nbsp; Associate Software Engineer Co-opTeam: FIFALocation:&nbsp; Burnaby, BCHow to ApplyIn addition to applying through your co-op office, please create a profile on our student applicant site.&nbsp; You can apply via this link https://ea.avature.net/university?tags=lwhittlePlease indicate clearly whether you are available for a 4 month, 8 month, 12 month or 16 month term.&nbsp; Most positions are 4 or 8 months depending on your availability, but we do consider longer co-op terms.To apply you must have the legal right to work in Canada – copies of work permits may be requested for those that are not Canadian Citizens or Permanent ResidentsPosition OverviewFIFA Soccer is the most popular and best selling sports video game in the world, winning more than 150 awards the past three years and selling more than 100 million units lifetime-to-date. Year after year, FIFA Soccer delivers unmatched emotion, quality and authenticity to millions of fans of “the beautiful game.” FIFA Soccer 12 was chosen Best Sports Game by E3 Game Critics for 2011 and once again will deliver the best sports experience no matter how or where you want to play.The latest generation of consoles and growth of broadband internet connectivity has changed the way people play games. Where gaming used to be a more solitary experience it has now become expected for most games to include a significant online experience. People are playing cooperatively with or competitively against other gamers from all over the world, climbing leaderboards, joining clans, sharing content, comparing stats, and showing off achievements.FIFA is seeking a talented and enthusiastic server engineer to join the FIFA Online Services team and help bring soccer games to millions of fans online. The candidate would be working with a team of server developers, and the FIFA game team, to imagine, design, plan and build the next generation of online features for FIFA, and make them accessible to a wide variety of platforms and services. If you love soccer and want to work on massive online games, this is the team for you.About EAIt’s not easy building the world’s best digital playground. It’s hair-standing-up-on-end-exhilarating. It’s down-in-the-trenches-challenging. Its stroke-of-brilliance-at-midnight creative. It’s you—taking risks, challenging yourself, pursuing ideas, changing the way millions of people do something they love: Play. We’re EA—we’ve been making games for decades but you wouldn’t know that walking through our studios. We’re still buzzing with the same innovative spirit we began with, though we’ve learned enough to earn our rank as a leading developer, publisher and distributor of the world’s best games. What began as a small group of people determined to “put real life in a box” has become an 8,000-people strong, worldwide organization delivering on that very dream. If you’ve played The Sims lately, you know exactly what we mean. And if you’ve played Battlefield 4, maybe you’d say that we’ve done real life one better.Whether you’re building Springfield on your mobile or your palms are sweaty from clutching your controller during intense games of FIFA 15, chances are you’ve played an EA game. And if you haven’t, well, what are you waiting for? In an industry that’s changing every day—whether it’s through new social channels, advancing technology, new audiences or unique opportunities for monetization—EA is positioned for growth thanks to smart business plans, strategic acquisitions, and most importantly, our creative people around the world who gather each day to unite the world through play. We take that last part very seriously, so if what you’re reading excites you as much as it does us, we invite you to get to know us better.",
	"job_requirements" : "Technical Qualifications• Java API programming experience• Strong working knowledge of SQL in general, MySQL preferred, Oracle okay• Experience using Eclipse IDE• Experienced in at least one source control system and comfortable with managing development across multiple lines, Perforce experience a plus.• Client/Server developmentAdditional Qualifications:• Experience with C++, C#, HTML,• Experience with Scripting languages• JDBC (Java DataBase Connectivity)• Experience with Maven• Service oriented architecturesOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://ea.avature.net/university?tags=lwhittle",
	"company" : "Electronic Arts Inc.",
	"division" : "Burnaby"
}