{
	"id" : "54035",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Associate Software Engineer Co-op - NHL",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Position Title:&nbsp; Associate Software Engineer Co-opTeam: NHLLocation:&nbsp; EA Canada, Burnaby, BCHow to ApplyIn addition to applying through your co-op office, please create a profile on our student applicant site.&nbsp; You can apply via this link https://ea.avature.net/university?tags=lwhittle&nbsp;Please indicate clearly whether you are available for a 4 month, 8 month, 12 month or 16 month term.&nbsp; Most positions are 4 or 8 months depending on your availability, but we do consider longer co-op terms.To apply you must have the legal right to work in Canada – copies of work permits may be requested for those that are not Canadian Citizens or Permanent ResidentsPosition OverviewA Game Modes Engineer is a part of the game creation process, including architectural design, implementation, and debugging on multiple platforms working on complex problems with Designers, Artists and other Engineers in the domain of user/game engine interaction.Specifically, we are seeking Software Engineers who will be responsible for writing specific or multi-purpose code for areas such as:• Game Mechanics -- Gameplay, AI, player control, animation systems, physics, and scripting systems.• Core Engine -- Graphical rendering, networking, user interface, memory & performance optimization on cutting edge computer hardware.• Game Modes – FE screens and flows, career mode, and commerce transactions.• Tools and Libraries -- World editors, video & audio tools, software performance analysis systems, database systems, and general purpose game development libraries.About EAIt’s not easy building the world’s best digital playground. It’s hair-standing-up-on-end-exhilarating. It’s down-in-the-trenches-challenging. Its stroke-of-brilliance-at-midnight creative. It’s you—taking risks, challenging yourself, pursuing ideas, changing the way millions of people do something they love: Play. We’re EA—we’ve been making games for decades but you wouldn’t know that walking through our studios. We’re still buzzing with the same innovative spirit we began with, though we’ve learned enough to earn our rank as a leading developer, publisher and distributor of the world’s best games. What began as a small group of people determined to “put real life in a box” has become an 8,000-people strong, worldwide organization delivering on that very dream. If you’ve played The Sims lately, you know exactly what we mean. And if you’ve played Battlefield 4, maybe you’d say that we’ve done real life one better.Whether you’re building Springfield on your mobile or your palms are sweaty from clutching your controller during intense games of FIFA 15, chances are you’ve played an EA game. And if you haven’t, well, what are you waiting for? In an industry that’s changing every day—whether it’s through new social channels, advancing technology, new audiences or unique opportunities for monetization—EA is positioned for growth thanks to smart business plans, strategic acquisitions, and most importantly, our creative people around the world who gather each day to unite the world through play. We take that last part very seriously, so if what you’re reading excites you as much as it does us, we invite you to get to know us better.",
	"job_requirements" : "Qualifications• Experience with client-server software architecture• Prefer an 8 month co-op term• Passionate about new cutting edge technology (mobile, gadgets, etc…)• Demonstrated knowledge of good software engineering practices• Good communication and writing skills• Excellent problem solving skills• Strong math skills• Self-starter who can work with others in a team-oriented environment as well as independently• Ability to adapt to quickly changing project requirements and continuous feedback• Ability to learn and adapt quickly to new technology, platforms, and game areas• The best candidates will have completed personal game or domain expertise projects independent of school• And of course - enjoys working (and playing!) in a dynamic, cutting edge environmentTechnical Qualifications:• C++• Object oriented design & implementation• C, Assembly and C# also helpful• Multithreaded processing• Experience in ActionScript and Flash• Experience in some of: Networking, SQL/Database, UNIX, and/or Linux• Action Script and Scaleform also helpfulOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://ea.avature.net/university?tags=lwhittle",
	"company" : "Electronic Arts Inc.",
	"division" : "Burnaby"
}