{
	"id" : "54062",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op Student",
	"job_location" : "Richmond BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Project Description:Macdonald, Dettwiler and Associates (MDA) is providing Canada’s Department of National Defense (DND) eight radar surveillance systems for integration into the CP-140 Aurora fleet. The CP-140 Aurora fleet is Canada’s Intelligence, Surveillance and Reconnaissance Aircraft. The fleet is used by the Royal Canadian Air Force in activities such as domestic surveillance of Canada’s maritime approaches, search and rescue missions, and maritime and overland operations. The additional radar surveillance systems supplement the previous radar surveillance systems developed and delivered by MDA under this program.The Position:The project is looking for one motivated senior co-op software engineer to participate in software upgrades, enhancements, integration & testing and software sell-off to end customer.Responsibilities:Prototyping, evaluation and integration of third party COTS software and hardware.C++ software development, integration and testing.Technical documentation and likely some travel (within Canada and USA) and onsite work.",
	"job_requirements" : "Experience and Skills Required:Senior student working towards Bachelor’s degree in Electrical/Computer Engineering or Computer Science.Knowledge in Unix OS, MS Window tools and software CM process.Knowledgeable in C++ design, development and I&T.Excellent verbal and written communication skills.Strong math, analytical and problem solving skills.Experience with graphical user interface development is desirable.Comments/Special Considerations:Successful candidate(s) must be able to obtain and hold security clearance at the Reliability level, and pass security assessment for the Controlled Goods Program.Please apply with cover letter, resume and transcript quoting position&nbsp;2015-05-MDA-A&D.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "MDA Corporation",
	"division" : "Corporate Headquarters"
}