{
	"id" : "54074",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Software Developer Co-op",
	"job_location" : "Burnaby",
	"number_of_positions" : "2",
	"salary" : "$18.00 - $24.00",
	"frequency" : "Hourly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "The Ericsson Co-op Experience:At Ericsson our co-ops are a tightly knit group of about 20 students each term working on various projects. Our co-ops benefit from social gatherings planned amongst themselves and through the office. They frequently go out for lunch as a group and also get to work in a dynamic environment of managers and other permanent Ericsson employees. Our co-ops work on exciting projects that revolve around the Networked Society. Other benefits of the Burnaby office include free gym membership, free pastries every Friday and flexible working hours.A co-op at Ericsson is a great step in the door as well to future full time opportunities after graduation!Ericsson OverviewEricsson is a world-leading provider of telecommunications equipment and services to mobile and fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, and more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business and society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people and society to help shape a more sustainable world.We are truly a global company, offering a diverse, performance-driven culture and an innovative and engaging environment where employees enhance their potential every day. To ensure professional growth, Ericsson offers a stimulating work experience and continuous learning and growth opportunities that allow you to acquire the knowledge and skills necessary to reach your career goals.Ericsson is present in 4 major Canadian cities: Montreal, Ottawa, Toronto and Vancouver.70% of the mobile traffic in Canada goes through Ericsson systems. We strive to deliver the highest quality products and services to our customers.Co-op DescriptionYou will work with a team of engineers involved in embedded software development for the Ericsson’s IP Operating System that powers an entire portfolio of routing products from Ericsson’s SSR 8000 family to MINI-LINK SP 415 and SP 420 platforms delivering a best-in-class end-to-end solution for IP networks.You will gain in-depth hands-on experience with Linux, IP networking, virtual machines, software development life cycle, embedded software design, and multi-threaded programming in a multi-core/multi-processor distributed environment. Depending on your interests and ability, there may be an opportunity to learn about low-level assembly programming, routing hardware and the latest generation network processing ASICs.You will have the opportunity to work on one or more phases of software development, from design and implementation to unit testing and system integration. Your main tasks will include collaborating with senior team members in designing, writing, and maintaining our software. You’ll get great experience to learn and apply industry best practices for ensuring carrier-class quality.You’ll also get the chance to have a look inside a Carrier Grade Multi-Service Edge Router used by most top 20 internet providers!Ericsson offers a supportive and friendly working environment. Our Co-op students are included in important projects and they get to contribute in the development of network infrastructures that help support connected devices for billions of users around the globe.",
	"job_requirements" : "Qualifications• Enrolled in a Bachelor or Master’s degree, specializing in Computer Sciences, Computer or Software Engineering or Electrical Engineering (or equivalent)• Previous co-op experience is an asset• Experience in programming in C language for real-time, embedded software systems• Experience with scripting languages, such as Python and Perl• Experience in configuring routers and other traffic sources is an advantage• Relevant personal projects that showcase your coding and programming experience will be consideredTechnical environment• Experience in C programming• Knowledge of data structures and algorithms.• Familiarity with real-time & multi-threading programming• Experience with GNU Software development tools and Linux.Interpersonal qualities• “Go-getter” attitude, team player, with a solid work ethic, and passion for meeting or exceeding expectations• Positive attitude, quick learner, adaptability and enjoys continuous improvement & learning• Excellent verbal and written communication skillWhat can you learn at Ericsson?Here is what some of our former co−ops are saying:What I learned from Ericsson? − Perl, Networking protocols, scripting language, routing and switching information, debug, verify and update test scripts. I also learned how the testing cycle runs and working productively in a time constrained environment.What I enjoy about Ericsson? − Excellent work space and nice building, Weekly Friday pastries, flexible working hours, friendly co−workers, 50 cent vending machine.Working at Ericsson has given me an idea of the daily operations and activities of a software company. Just by being in this environment made me learn more than I could in a classroom. I felt immediately welcome on my team, and was treated like a significant member. I enjoyed working on a project with deadlines and learning from those around me. I would highly recommend a term with a company that is so driven!http://www.ericsson.com/thinkingahead/networked_society*please note all roles at Ericsson’s Vancouver site are subject to compliance with US Export laws. We thank all of those interested in Ericsson, however only selected applicants will be contacted for an interview.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"end_date" : "12/18/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Please include transcripts, cover letter and resume in application.Company:Ericsson",
	"division" : "Ericsson (Montreal)"
}