{
	"id" : "54070",
	"application_deadline" : "Jan 25, 2015 1159PM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Co-op Student, Electrical Engineer (35829)",
	"job_location" : "Fort McMurray, Alberta",
	"number_of_positions" : "1",
	"salary" : "NA",
	"frequency" : "Monthly",
	"job_description" : "JOB OVERVIEWSuncor is hiring several Electrical Engineering co-op students throughout Oil Sands & In-Situ.• The positions are available for eight month work terms• Students must be currently enrolled in and returning to full-time studies after the work term to be eligible• A copy of your transcripts must accompany your application in order to be considered for a work term with Suncor Energy&nbsp;KEY ACCOUNTABILITIES1) ELECTRICAL/INSTRUMENTATION (E/I) RELIABILITYThis position is for an eight month work term and is located in Fort McMurray. As a team member of Electrical/Instrumentation (E/I) Reliability Engineering team, the E/I engineering co-op student will work closely with Tailings Reduction Operation (TRO)/Tailings operations and maintenance groups to support safe and reliable operations of E/I assets. The student will be responsible for:• Assisting Senior Engineers with daily reliability engineering work including but not limited to Asset criticality, Equipment strategy development, engineered scope preparation, and field troubleshooting• Assisting with the scope development of all major and turnaround maintenance events• Providing assistance to the electricians and Instrument technicians in troubleshooting difficult problems• Assisting with the development and on-going improvements to all necessary procedures, check-sheets and work practices&nbsp;2) IN SITU RELIABILITYThis position is for an eight month work term and is located in Fort McMurray. The Electrical Engineer co-op student will be working within the Reliability and Maintenance Engineering Department at the Mackay River site. The student will be responsible for:• Working with maintenance and operation to investigate and resolve system deficiencies• Preparing work packages and bill of materials in support of engineering processes• Preparing new and revise existing documentation in support of engineering packages• Field checking equipment for technical information with the assistance of plant electricians, instrument techs, or control system specialists• Investigating equipment failures, malfunctions, and reliability problems relating to electrical and instrumentation systems• Using Microsoft Office suite and other engineering tools to support daily work• Developing work procedures to carry out repairs and improvements safely and efficiently• Utilizing engineering tools and systems to create and update engineering information in support of engineered in-house projects&nbsp;3) ASSET INFORMATION MANAGEMENTThis position is available for an eight, twelve, or sixteen month work term and is located in Fort McMurray. The Mechanical/Electrical Engineer co-op student will provide document and engineering data management service to Oil Sands Business areas by managing Asset Information throughout the asset life cycle. This position is part of the Asset Information Management (AIM) team in Oil Sands and the student will support senior AIM Technical Specialists. The student will be responsible for:• Supporting CAD & SPI AIM Specialist and As-Building Coordinators• Creating/Updating drawings on AutoCAD as directed by As-Building Coordinators• Auditing drawing package, attend meetings, create work process etc. as directed by CAD/SPI AIM Specialist and As-Building Coordinators• Providing general drawing & data management support• Providing general technical support for data integrity cleanup work• Working on AIM process improvement initiatives as directed by CAD AIM SpecialistADDITIONAL INFORMATION• Salary varies with years of education and experience• Please provide a transcript and cover letter with your application• Please clearly indicate when you're available to start, what length of term you are available for, and what position you're most interested inPlease apply online at www.suncor.com/campus",
	"job_requirements" : "REQUIRED QUALIFICATIONSSuncor is committed to employment equity and encourages applications from all qualified individuals.&nbsp;Education and Experience:• Second or third year student attending Bachelor's program from an eligible University in Canada with a major in Electrical or Instrumentation engineeringSkills and Knowledge:• Sound knowledge of engineering principles within the electrical/ instrumentation field• Familiarity with local and international engineering standards such as IEEE, CEC, CSA and ISA• Self-motivated with excellent communication, interpersonal and organizational skills• Ability to work in a multidisciplinary integrated team environmentWORKING CONDITIONS• You must be available to start May 2015• You should be comfortable with relocating to Fort McMurray for the duration of the work term• Shared accommodation in Fort McMurray is provided at no cost to you, as well as travel assistance to & from Fort McMurray• Coach busses run from town to site & back every day at no cost to you• Achieving world-class safety excellence is key to Suncor's goal of becoming a sustainable energy company. We work hard to maintain an exceptional workplace• This position is based in Fort McMurray with worked schedule of 40 hours a week from Monday to FridayOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.suncor.com/campus",
	"company" : "Suncor Energy Inc.",
	"division" : "Corporate Head Office",
	"website" : "www.suncor.com/oncampus"
}