{
	"id" : "54073",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Smart Services Router Integration & Verification Co-op",
	"job_location" : "Burnaby",
	"number_of_positions" : "1",
	"salary" : "$18.00 - $24.00",
	"frequency" : "Hourly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "The Ericsson Co-op Experience:At Ericsson our co-ops are a tightly knit group of about 20 students each term working on various projects. Our co-ops benefit from social gatherings planned amongst themselves and through the office. They frequently go out for lunch as a group and also get to work in a dynamic environment of managers and other permanent Ericsson employees. Our co-ops work on exciting projects that revolve around the Networked Society. Other benefits of the Burnaby office include free gym membership, free pastries every Friday and flexible working hours.A co-op at Ericsson is a great step in the door as well to future full time opportunities after graduation!Ericsson OverviewEricsson is a world-leading provider of telecommunications equipment and services to mobile and fixed network operators. Over 1,000 networks in more than 180 countries use Ericsson equipment, and more than 40 percent of the world's mobile traffic passes through Ericsson networks. Using innovation to empower people, business and society, we are working towards the Networked Society, in which everything that can benefit from a connection will have one. At Ericsson, we apply our innovation to market-based solutions that empower people and society to help shape a more sustainable world.We are truly a global company, offering a diverse, performance-driven culture and an innovative and engaging environment where employees enhance their potential every day. To ensure professional growth, Ericsson offers a stimulating work experience and continuous learning and growth opportunities that allow you to acquire the knowledge and skills necessary to reach your career goals.Ericsson is present in 4 major Canadian cities: Montreal, Ottawa, Toronto and Vancouver.70% of the mobile traffic in Canada goes through Ericsson systems. We strive to deliver the highest quality products and services to our customersCo-op Position Overview:We are currently recruiting for one Co-op in our Smart Services Router Platform-as-a-Service (PaaS) Integration & Verification Team.&nbsp; PaaS is a multi-site team spanning across Burnaby, BC, and San Jose, California, part of a global R&D organization spanning across, Bangalore, India, and Budapest, Hungary. This position is for an 8-month term.As a PaaS I&V Engineer on one of our I&V Engineering Teams you will work with a team of talented and enthusiastic I&V and Design Engineers involving in verification and validation for the Ericsson Smart Services Router. You will be responsible for test execution, test results & error management, test automation script development, and test system integration.Job Responsibilities:• Test execution & test case design• Work closely with other I&V or Design Engineers on system problems root cause analysis• Test reporting and error management• Test equipment setup and maintenance• Test automation scripting in UNIX shell scripting languages• Test deliverables management• Sustaining activities – including bug re-test and regression testing",
	"job_requirements" : "Core/Critical Competencies• Good network knowledge: LAN/WAN, TCP/IP, Routing/Switching protocols, QoS, IP Multicasting, MPLS, Metro Ethernet, 4G/LTE & EPC, Mobile Backhaul, Cloud Networking/SDN/NFV, etc.• Nice to have knowledge of router configuration & CLI commands, e.g., Cisco, Juniper• Perl, TCL/Tk, Expect, and other UNIX shell scripting languages• Good UNIX (Linux/Solaris) experience• Sound network engineering and network debugging/troubleshooting technique• Enthusiasm on learning and contributing in highly motivated teams• Strong written and verbal communication skills• Strong verification/development mindset and experience are definite assets• Experience in different phases of the software development cycle• Strong programming skills• Fast learner with can-do attitudeEducation Requirements• 3rd year or higher university education preferred• Completed the 2 or more of the following academic courses at 3rd or 4th level:o Computer Networkingo Data Communicationso Computer Systemso Operating Systemso Database Systemso Digital Systems Design• Previous co-op/intern experience in networking R&D industry, or help desk or network supportWhat can you learn at Ericsson? Here is what some of former co−ops are saying:What I learned from Ericsson? − Perl, Networking protocols, scripting language, routing and switching information, debug, verify and update test scripts. I also learned how the testing cycle runs and working productively in a time constrained environment.What I enjoy about Ericsson? − Excellent work space and nice building, Weekly Friday pastries, flexible working hours, friendly co−workers, 50 cent vending machine.Working at Ericsson has given me an idea of the daily operations and activities of a software company. Just by being in this environment made me learn more than I could in a classroom. I felt immediately welcome on my team, and was treated like a significant member. I enjoyed working on a project with deadlines and learning from those around me. I would highly recommend a term with a company that is so driven!http://www.ericsson.com/thinkingahead/networked_society*please note all roles at Ericsson’s Vancouver site are subject to compliance with US Export laws. We thank all of those interested in Ericsson, however only selected applicants will be contacted for an interview.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"end_date" : "12/18/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Please include transcripts, cover letter and resume in your application.&nbsp;Company:Ericsson",
	"division" : "Ericsson (Montreal)"
}