{
	"id" : "54082",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Software Developer Co-op",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "JOB DESCRIPTIONIn 2015, our Technology team has some big goals - we are aiming to completely change the online shopping experience for our customers.&nbsp; What does this mean for you?&nbsp; Well, we are going to be working on a range of projects to see our vision come to life.&nbsp; As a Software Developer Co-op, your job will be to participate in analyzing and designing creative solutions for parts of a project.&nbsp; You will see a solution through the Agile process and support our two week sprints.&nbsp; We will give you the autonomy to solve problems on your own and work with limited direction.&nbsp; You won’t be without the support you need though, with a great team of engineers available to answer any questions you have.&nbsp; &nbsp;What You’ll Do•&nbsp; Work as part of a team of talented engineers to build and develop products that will completely change our customer shopping experience •&nbsp; Participate in&nbsp; the design, development and implementation of business enterprise applications using .NET Framework 4.5 and SQL Server 2012•&nbsp; Assist in the design and development of web based applications and RESTful API's•&nbsp; Develop applications and systems with a Test Driven Development methodology •&nbsp; Write code, write unit tests, test software, and debug software•&nbsp; Investigate, analyze, correct, and document reported defects •&nbsp; Create and maintain technical documentation&nbsp;What You’ll Learn•&nbsp; Agile/Scrum process•&nbsp; How to work in a .Net environment•&nbsp; Technology products that support an eCommerce site•&nbsp; How to support a rapidly expanding organization&nbsp;A little more about us….&nbsp;BuildDirect is a privately held technology company that is knocking down walls, changing the foundation and building a smarter, simpler and empowered home improvement industry. With our BuildDirect Demand Rank™ and BuildDirect Product Rank™ custom analytic and forecasting tools, we can identify in real-time, consumer interest in a product, its competitiveness in the marketplace, and locations it will best perform.&nbsp;We love the people we work with and the culture we’ve built. For us, curiosity is a mindset that sees a problem as the start of a great solution. We believe the best learning and greatest discoveries come from trying, even if you fail. We love that we aren’t perfect, but every day we are trying to get better at what we do. &nbsp;BuildDirect offers an environment where you will have a chance to learn and work in a team based setting with exceptional people.&nbsp; We provide an open atmosphere where better ways of doing things are encouraged, and people are inspired to perform at their fullest potential.",
	"job_requirements" : "What You’ll Need•&nbsp; You’ll need to be currently enrolled in a Computer Science or Computer Engineering degree•&nbsp; Confidence in your ability to interpret written business requirements and technical specification documents •&nbsp; Your written communication skills are at a level where you can write clear technical documents•&nbsp; You are comfortable working both independently and as part of a larger team•&nbsp; You have experience with an Object Oriented programming language such as C#, C++, or Java •&nbsp; Your technical skills are first-rate and you can understand and troubleshoot algorithms •&nbsp; You have the ability to come up with innovative solutions to new problems•&nbsp; It’s a bonus if you have .NET development experience, multi-thread programming experience or experience creating, documenting and implementing unit test plans, scripts, and test harnesses.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; What You Must Have•&nbsp; An audacious spirit that embraces uncertainty and challenges with enthusiasm•&nbsp; High levels of integrity and a commitment to do what you say you are going to do •&nbsp; Strong entrepreneurial spirit that has grit, determination and challenges the status quo•&nbsp; High degree of empathy and the ability to see other’s perspective•&nbsp; Strong sense of curiosity and the desire to learn and get better everydayOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "BuildDirect",
	"division" : "Technology"
}