{
	"id" : "54089",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Software Developer",
	"job_location" : "Vancouver",
	"number_of_positions" : "2",
	"salary" : "18",
	"frequency" : "Hourly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "We’re a cool little start-up in Gastown beating out the biggest competitors in our space. We’re currently the underdog. But we have a clear mission and won’t stop until we’re the overdog. We’re carving out a role as an industry leader in scheduling. We’re not like other enterprise software – we’re injecting the freshness of consumer software into powerful business tools. Fortune 500 companies are optimizing their schedules and slashing costs with our software and loving every minute of it.RESPONSIBILITIES:We want someone who wants to be part of a team of all-star developers. You’ll be diving head-first into some challenging, high-visibility projects. The successful candidate won’t be afraid to break down the problem, drive the planning and design process with the team, and deliver innovative solutions that provide value to customers.You’re hungry, you’re passionate, and you’re eager to learn how to ship a great product.VALUES:• Empathy: You understand that the code you’re writing is for the customers that use it, not you. When you’re working on a feature you think of ways to build it so that customers will want to hug you.• Brains: You know there’s no perfect architecture but you feel pretty good when you’ve come close! You love a little mental sparring with your teammates that result in nuggets of pure genius.• Drive: You want to build an amazing product. You know what needs to be done. You own it. You nail it. And you help everyone else on the team to do the same. High five!The EDP Team:We get along because honestly, you need to get along to do awesome things. Yes, we work hard and push ourselves to be creative, learn, and improve but we thrive on it and enjoy working with smart people. We like jokes, random quizzes during the day, and dominating trivia nights (tentative team name: Trivia Knights). We remember to laugh during conference calls, BBQ on the roof, go for tacos, and enjoy a beer at the end of the week.Location:We’re located in a gorgeous heritage building in the heart of Gastown with cedar floors, brick walls, and a gym. There’s a rooftop patio with two natural gas grills and an unparalleled view of the mountains. The lunch options are endless and it’s painless to get here from almost anywhere via public transportation, bike, or walking.",
	"job_requirements" : "REQUIREMENTS:• Outstanding programming fundamentals. You know your data structures and object-oriented programming well, you scoff at inefficient algorithms, and you love a good challenge.• It doesn’t matter if you’ve used our development stack but you tinker with the latest platforms and keep tabs on what’s going on in the industry.• Hands-on experience with C#, ASP.NET, MVC, WebAPI, and AngularJS would be a great bonus.• Working towards a degree in computer science, engineering, or math.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Engineering ComputerMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:01/05/2015",
	"end_date" : "04/24/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "EDP Software",
	"division" : "Vancouver Development Office",
	"website" : "www.edpsoftware.com"
}