{
	"id" : "54083",
	"application_deadline" : "Feb 13, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Engineering Student Summer Position",
	"job_location" : "Williams Lake, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "The City of Williams Lake is now accepting resumes for a summer engineering student position. Submit resumes by Friday, February 13, 2015.",
	"job_requirements" : ".Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science in GeologicalMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering CivilMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.williamslake.ca/Jobs.aspx?UniqueId=98&From=All&CommunityJobs=False&JobID=Engineering-Student-Summer-Position-34",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Please apply directly to the recruiter by email as instructed on the employer website.Company:City of Williams Lake",
	"division" : "City of Williams Lake"
}