{
	"id" : "54084",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Software Test Engineer ? Co-op Position",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Company OverviewSierra Wireless is a global leader in providing wireless communication solutions that enable mobile professionals to improve their productivity and lifestyle. Products designed by Sierra Wireless are recognized as unique, offering differentiated and reliable solutions, backed by world-class customer support.&nbsp;Job DescriptionSierra Wireless is looking for a top student with strong interest in wireless data communication and software / firmware testing and automated tool development. A work term with Sierra Wireless offers students the following experience:Wireless data communication modemsWireless network data communication protocolsDevelopment of software test automation and toolsComplete understanding of Software Test methodology and techniquesCommercial software development life cycle&nbsp;&nbsp;ResponsibilitiesImplement and maintain software test automationAnalyze requirements and develop comprehensive test casesExecute manual and automated tests for product releasesAnalyze defects and create clear bug reports and verify bug fixesAssist the development team with troubleshooting technical issues",
	"job_requirements" : "QualificationsStrong written and oral communication skillsExperience in writing test plan and complex test casesSoftware test development, programming, or scripting experienceKnowledge of data communication, networking, and protocolsAbility to work effectively both independently and within team environment&nbsp;Interested students should send a cover letter and resume to their Co-op coordinator.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Sierra Wireless Inc.",
	"division" : "Head Office"
}