{
	"id" : "54081",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Quality Assurance Engineer Co-op",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "JOB DESCRIPTIONIn 2015, our Technology team has some big goals - we are aiming to completely change the online shopping experience for our customers.&nbsp; What does this mean for you?&nbsp; Well, we are going to be working on a range of projects to see our vision come to life.&nbsp; As a QA Engineer Co-op, your job will be will help us automate our manual testing.&nbsp; As part of the team, you’ll learn the QA process to ensure quality products are delivered.&nbsp; Your exposure won’t be limited to the QA world as you work hand-in-hand with development on Agile projects.&nbsp; For the QA team at BuildDirect, it’s knowing that quality is not a nice to have but an absolute must in terms of delivering value products.&nbsp; &nbsp;What You’ll Do•&nbsp; Work as part of a team of talented QA engineers to automate and plan the testing of new features that will completely change our customer shopping experience •&nbsp; Improve existing UI and API automation to be more robust and reliable•&nbsp; Analyze current automation coverage and help fill any coverage gaps•&nbsp; Communicate with cross functional areas impacted by automation, including the effective dealings with related business functions&nbsp;What You’ll Learn•&nbsp; How to automate test procedures •&nbsp; Agile/Scrum process•&nbsp; How to work in a .Net environment•&nbsp; Technology products that support an eCommerce site•&nbsp; How to support a rapidly expanding organization&nbsp;A little more about us….&nbsp;BuildDirect is a privately held technology company that is knocking down walls, changing the foundation and building a smarter, simpler and empowered home improvement industry. With our BuildDirect Demand Rank™ and BuildDirect Product Rank™ custom analytic and forecasting tools, we can identify in real-time, consumer interest in a product, its competitiveness in the marketplace, and locations it will best perform.&nbsp;We love the people we work with and the culture we’ve built. For us, curiosity is a mindset that sees a problem as the start of a great solution. We believe the best learning and greatest discoveries come from trying, even if you fail. We love that we aren’t perfect, but every day we are trying to get better at what we do. &nbsp;BuildDirect offers an environment where you will have a chance to learn and work in a team based setting with exceptional people.&nbsp; We provide an open atmosphere where better ways of doing things are encouraged, and people are inspired to perform at their fullest potential.&nbsp;",
	"job_requirements" : "What You’ll Need• &nbsp;You’ll need to be working towards a degree in Computer Science or Computer Engineering•&nbsp; You are familiar with Selenium, .NET or RESTful API’s•&nbsp; You are familiar with continuous integration systems or eager to learn about them•&nbsp; You have gained an understanding of an object orientated language such as C# or Java•&nbsp; You are comfortable with promoting and executing automation processes and methodologies•&nbsp; You are happy working both independently and as part of a larger team&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; What You Must Have•&nbsp; An audacious spirit that embraces uncertainty and challenges with enthusiasm•&nbsp; High levels of integrity and a commitment to do what you say you are going to do •&nbsp; Strong entrepreneurial spirit that has grit, determination and challenges the status quo•&nbsp; High degree of empathy and the ability to see other’s perspective•&nbsp; Strong sense of curiosity and the desire to learn and get better everydayOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "BuildDirect",
	"division" : "Technology"
}