{
	"id" : "54097",
	"application_deadline" : "Jan 15, 2015 1159PM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Energy and Environment",
	"job_location" : "Prince George, BC",
	"number_of_positions" : "1",
	"salary" : "$18-24",
	"frequency" : "Hourly",
	"job_description" : "STUDENT OPPORTUNITY – (4 or 8 month term)POSITION:Energy and EnvironmentDIVISION: Canfor Administration CentreSTART DATE: May 2015DESCRIPTIONWhen you work at Canfor you work with people who have a passion for excellence. Our obsession with finding better ways to do things creates an exhilarating work environment with tremendous growth opportunities.Learn more at www.Canfor.com or LinkedIn.comPOSITION SUMMARYThis is a developmental role which will be reporting to the corporate Energy Manager on energy matters and to the Director of Environment, Energy & Climate Change Policy on environmental matters. The successful candidate will utilize engineering principles to help Canfor move toward improved energy efficiency and maintain environmental sustainability through specific projects and assignments.&nbsp; Depending on the successful candidates’ skills and interests, there is potential to tailor and grow the responsibilities of this position.SKILLS YOU’LL LEARN• Sustainable Energy Management;• Engineering principles related to Energy and Environmental management;• Presentation and communication skills;• Strategy development and analytical techniques;• Knowledge in the areas of industrial processes, project development and application of practical solutions relating to Energy and Environment issues;• Working with corporate, operations and BC Hydro personnel.LOCATION – PRINCE GEORGE, BCKnown as BC's northern capital, Prince George is a bustling city located on the traditional territory of the Lheidli T'enneh with a population of approximately 76,000 situated at the crossroads of Highway 97 (north-south) and Highway 16 (east-west), and at the confluence of the Fraser and Nechako Rivers. As a major city of the Pacific Rim, Prince George is firmly tied to the global market.&nbsp; The City of Prince George is a vibrant, active and diverse community that provides a strong focal point and identity to the north, with a thriving economy that offers full opportunities for housing, employment, education, recreation and the cultural life of residents.&nbsp; Prince George is a community that is known for opening its doors and showing our visitors the beauty and magic of the north.RESPONSIBILITES / DUTIESThe position will report directly to the Energy Manager on a day to day basis and potentially to the Director of Environment, Energy & Climate Change Policy on a project specific basis.&nbsp;&nbsp;• Develop and improve energy management systems to move Canfor towards its energy reduction targets;• Analyze energy trends and generate summary reports;• Work with Canfor managers and individual sites on specific energy and environmental projects;• Monitor key performance indicators;• Implement and perform efficiency studies related to the overall process.SALARY & BENEFITS• Competitive salary - $18-24/hour depending on year of study and experience.• Benefits package includes core medical coverage.&nbsp; Depending on location may include housing, moving, travel expenses.• Opportunity to be mentored by a P.Eng.• Co-op fees covered and paid for by Canfor.",
	"job_requirements" : "ELIGIBILITY / EDUCATION REQUIREMENTS• Currently enrolled in 3rd or 4th year of post-secondary studies or have graduated within the last year from post-secondary Electrical, Mechanical, Environmental Engineering, or related engineering field.THE IDEAL CANDIDATE• Must be a self-motivated individual with an interest in sustainability and system efficiency• Strong written and verbal communication skills• Analytical and organizational skills• Computer skills, with strong knowledge of Microsoft Office• Programming skills (C#, JavaScript, JQuery) would be an asset• Well developed people and team building skills• Excellent interpersonal and problem solving skillsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalEnvironmentalIntegratedMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.canfor.com/careers",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Interested applicants should submit their resume by January 15th 2015 to the following:Canfor, Human Resourceswww.canfor.com/careersCompany:Canfor Corporation",
	"division" : "Prince George Office",
	"website" : "http://www.canfor.com/"
}