{
	"id" : "54093",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Render Wrangler / Data Operator",
	"job_location" : "Montreal",
	"number_of_positions" : "2",
	"salary" : "TBC",
	"frequency" : "Monthly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "We are Framestore. We create extraordinary experiences. We combine award-winning craft and relentless creativity with tomorrow’s technologies. We make the impossible possible.We make moving images, content, design and digital for the advertising, entertainment and film industries. We are global leaders in visual effects, having won every major industry award.We collaborate from the conception of a project and bring a creative and technological problem-solving approach to our partners’ business challenges. We engage consumers through groundbreaking visual experiences that are driven by insight and innovation.We’re proud to offer a scalable talent pool for clients and partners. Our global team is connected through a realtime production pipeline, enabling 900 colleagues to collaborate on projects, wherever we are in the world.Our reputation is built on our trusted relationships. We never stand still and work tirelessly with our partners to deliver their vision. Our talent, experience, and innovative technology continue to help our clients push boundaries and break new ground.&nbsp;visite framestore.com for more info&nbsp;DescriptionThe Render Support department monitors and manages the physical render farm cluster and the software which the render farm runs ensuring high availability of resources 24/7. The Render Support team also support the Data Operations department with providing out of hours data support.",
	"job_requirements" : "Responsibilities:Monitor and report on render jobs for each showMonitor, track and report render resource usage for each projectBalance multiple shows resource needs within the Company's physical capacityIdentify render errors and fix/escalate to the relevant departmentLiaise with TDs regarding possible render optimisationAssist with out of hours data operations requestsMonitor disk/data usage out of hours to ensure availability of disk resourcesEssential Skills:Excellent communication skillsFundamental understanding of visual effects and computer graphics concepts and terminologyFamiliarity with LinuxOpen To All Majors:Yes",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Framestore",
	"division" : "Film - Montreal",
	"website" : "http://www.framestore.com/"
}