{
	"id" : "54092",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2013",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Software Developer",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "1500-2000",
	"frequency" : "Monthly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "The Company: ShnarpedWe are a young, energetic, and disciplined team that is passionate about building communities!&nbsp; We believe that a positive, encouraging community of motivated people working towards the same goal is the surest way to both win a Stanley Cup and to build a legacy company, and you will see these values throughout our team and our social platform.After airing a great episode of Dragons’ Den last year we have been adding many players, teams, and partners to the platform in anticipation of an exciting 2014-2015 season of hockey. Over 150 NHL players, 1,000 NHL prospects, and 50 teams have adopted Shnarped to connect with their fans in a positive, youth-friendly environment, and we are looking for like-minded individuals to join our cause and connect sports fans to their heroes!Check out some of our recent press attention:Techvibes– October 2014: How we Raised $1 Million Without Venture Capitalists’http://www.techvibes.com/blog/how-we-raised-1-million-without-any-venture-capitalists-2014-10-21Vancity Buzz– Sept 2014: Vancouver Entrepreneurs: Shnarpedhttp://www.vancitybuzz.com/2014/09/vancouver-entrepreneurs-shnarped/Canadian Press– April 2014: Shnarped Makes Second Appearance on Dragons’ Denhttp://www.princegeorgecitizen.com/news/shnarped-hockey-makes-second-appearance-on-dragons-den-tv-show-1.941358The Globe and Mail– Nov 2013: Teammates Hope Mobile App Becomes NHL Starhttp://www.theglobeandmail.com/sports/hockey/ex-teammates-hope-new-mobile-app-will-become-star-in-nhl/article15195972The Position: Developer (Co-op)We are seeking a highly motivated developer to help build out the Shnarped platform.&nbsp; We have many complex challenges to tackle in the areas of performance scaling, machine learning, system optimization, big data, UI/UX development, and testing.&nbsp; If you love sports and have a passion for solving big problems, this role is for you.&nbsp; Strong attention to detail and a results-oriented outlook are key characteristics for success in this role.In addition, by being part of the small start-up team you would gain direct access to the business executives and interpret the analytics that give us market insight and guide the applications’ future direction.&nbsp; This would be a wonderful opportunity to learn a great deal within a short period of time!",
	"job_requirements" : "The Right CandidatePassions, skills, and competencies would include:• Living in Vancouver (or willing to move here somewhat promptly) with a degree in computer science or engineering, and a drive for solving big problems.• Competent in OO design principles, data model design, and the MVC pattern.• A keen eye for detail, and a passion for sports, gaming, and social media.• Familiarity with hockey, and knowledge of related statistics an asset.• Knowledge in RoR, iOS, Android, Web, Angular, or SQL development platforms an asset.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Project examples, websites, GIT repos",
	"company" : "Shnarped Hockey",
	"division" : "Vancouver"
}