{
	"id" : "54096",
	"application_deadline" : "Feb 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "2015 CLP Internship Programme",
	"job_location" : "Hong Kong",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"company_type" : "Private Business",
	"job_description" : "2015 CLP Internship ProgrammeCompany ProfileFounded in 1901 as China Light and Power Company Limited in Hong Kong, CLP Group has grown from a Hong Kong-based power utility into a leading investor and operator in the Asia Pacific Region’s electricity market. Its portfolio comprises over 60 generation assets of gas, coal, nuclear and renewable energy, distribution and transmission assets and retail operations. The CLP Group is owned by CLP Holdings, a company listed on the Stock Exchange of Hong Kong.What is CLP?The CLP Internship Programme (CIP) is part of our group-wide talent acquisition strategy. Our vision is to build a long-term partnership with tertiary institutions to identify and nurture young talent in meeting our future business needs. The Programme aims to create a win-win-win situation benefiting the students, universities and CLP.CIP offers full-time training to students during the summer vacation or for a longer period (e.g. 12 months) as part of their curriculum requirements. Selected candidate will each be assigned a specific project and a mentor. These projects, whether in Engineering, Finance/Accounting, IT orother functional areas, have well defined deliverables, providing participants with practical experience.CLP Engineering Studies AwardCLP introduced the Engineering Studies Award (ESA) in 2009 to provide financial support, mentorship, and an excellent career opportunity for outstanding engineering students to join CLP as Graduate Trainees. The award is designed for undergraduate students in Electrical, Mechanical and Electronic engineering.ESA also enables awardees to concentrate their effort on academic studies for their final year studies, and to prepare themselves for a professional engineering career.The Awardees, upon satisfactory completion of an internship programme, will be presented the ESA which includes:• A Cash Award with a value equal to the prevailing annual tuition fee for a bachelor degree in universities in Hong Kong• An employment contract as Graduate Trainee in CLP upon graduation from the university• A Mentoring Programme with a senior engineering manager from CLP during the final year studyBefore appointment confirmation, according to “Statutory Minimum Wage: Notes for Student Employees and Employers” issued by Labour Department, selected students will be required to provide relevant official document(s) to confirm their “student intern” status or “work experience student” status under the Minimum Wage Ordinance. For details, please visit: http://www.labour.gov.hk.&gt; English &gt; Topical Issues (Statutory Minimum Wage) &gt; “Statutory Minimum Wage: Notes for Student Employees and Employers”",
	"job_requirements" : "How to Apply?Go to our website www.clpgroup.com &gt; Careers &gt; Job Opportunities &gt; Development Programmes &gt; Hong Kong &gt; training and development programmes &gt; CLP Internship Programmeordirectly click onhttps://www.clp.com.hk/ourcompany/careers/studentsandgraduates/clpinternshipprogramme/Pages/clpinternshipprogramme.aspxThe application will only be accepted by submitting the “CLP Online Application Form” (LINK) available at our website (LINK) on or before 27 February 2015.&nbsp; No late applications will be accepted.&nbsp;To join us, you need to have:A valid permit to work in Hong Kong SARA bachelor or advanced degree studentship continuing a full-time university degree course after the internshipGood academic results with a GPA of 3.0 or above, or equivalentUniversity endorsement that the internship programme is a part of the curriculumGood communication skills. High proficiency in both written and spoken English. Fluent spoken and written Chinese would be advantageousActive in extracurricular activities is a plusTo be a good team playerAvailable full-time during the internship period&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science in GeologicalMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering CivilMaster of Engineering Clean EnergyMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://www.clp.com.hk/ourcompany/careers/studentsandgraduates/clpinternshipprogramme/Pages/clpinternshipprogramme.aspx",
	"company" : "CLP Group",
	"division" : "CLP Group"
}