{
	"id" : "54109",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Intern, Build Engineer (CA-60189590-EN-15-001)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Intern, Build Engineer -&nbsp;https://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E495DF47D4C9A8F1A6620050568F01E2#mainView=search;popUps=1As market leader in enterprise application software, SAP helps companies of all sizes andindustries run better. From back office to boardroom, warehouse to storefront, desktop to mobiledevice – SAP empowers people and organizations to work together more efficiently and usebusiness insight more effectively to stay ahead of the competition.PURPOSE AND OBJECTIVESYou will be accountable for ensuring every component of each project is successfully built eachday with expected quality, working with developers to isolate and solve problems as well astroubleshooting any issues that may cause a build break. As part of the team you are inconstant communication with all teams across the organization involved in product developmentand delivery. This role allows you to gain a global vision of every product’s entire Life Cycle,giving you great exposure and experience during your coop term with a world leading softwarecompany, regardless of the path you decide to follow in your career in the Software Industry.In addition to build and assembly responsibilities, you will also be involved with all aspects ofsoftware development, from requirements through development to roll-out. You are anindependent worker, yet a team-player with a strong customer focus. You enjoy helping peopleand have a keen enthusiasm for learning and using SAP Business Objects products as part ofyour solutions.EXPECTATIONS AND TASKSSetting up and configuring builds in support development activitiesPerforming source control functions and integrationsMonitoring daily build activities and troubleshooting issues that ariseEnsuring the quality of daily builds by providing smoke test resultsBeing responsive to our internal customers and an innovative problem solver&nbsp;",
	"job_requirements" : "EDUCATION AND QUALIFICATIONS / SKILLS AND COMPETENCIESStudent must be currenctly enrolled in an undergraduate program of Computer Science orEngineeringWORK EXPERIENCEUnderstanding of source control management (SCM) theory and systemsExperience using a source control system (Perforce is an asset)Understanding of Java, C++, .NET, Perl, make and NANTWorking knowledge of Windows and Unix operating systemsWorking knowledge of Database applications and SQLExperience with troubleshooting / debugging toolsFlexible team-player with excellent interpersonal skillsAble to work in a challenging environment under minimal supervisionEnthusiasm for learning new technologiesCustomer oriented, dedicated, proactive, professional and truthfulExcellent written and verbal communication skillsFlexible and able to adapt and deliver solutions in a fast and changing environmentOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"if_by_website,_go_to" : "https://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E495DF47D4C9A8F1A6620050568F01E2#mainView=search;popUps=1",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):CO-OP NOTE: All students MUST apply via EngCORE as well as through the SAP website in order for your application to be considered.&nbsp;SAP'S DIVERSITY COMMITMENTTo harness the power of innovation, SAP invests in the development of its diverse employees.We aspire to leverage the qualities and appreciate the unique competencies that each personbrings to the company.&nbsp;Company:SAP",
	"division" : "Vancouver Office"
}