{
	"id" : "54106",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Intern, Database Administrator (CA-60194415-EN-15-001)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Intern, Database Administrator-&nbsp;https://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E4969F620628E2F1A7AB0050568F01DB#mainView=search;popUps=1As market leader in enterprise application software, SAP helps companies of all sizes andindustries run better. From back office to boardroom, warehouse to storefront, desktop to mobiledevice – SAP empowers people and organizations to work together more efficiently and usebusiness insight more effectively to stay ahead of the competition.PURPOSE AND OBJECTIVESThe Infrastructure group's mission is to provide environments for testing and developmentteams of the department P&I Hana Platform Infrastructure. This group is based in Vancouver,Bangalore, Shanghai and Levallois. Its missions are built around a strategy of on-demand”resources of testing and development based on environment creation of back-end servers anddatabases. Most of the technologies and database servers on the market are supported.EXPECTATIONS AND TASKSThe DBA will be responsible for managing a collection of databases supporting test data andsupport users on these technologies. It will specifically support the support of HANA, DB2,Oracle and SQL Server. They will work in collaboration with colleagues worldwide to ensure ahigh level of service to user’s connectivity to databases.",
	"job_requirements" : "EDUCATION AND QUALIFICATIONS / SKILLS AND COMPETENCIES• Installation of databases on heterogeneous environments (Windows, Unix)• Knowledge of UNIX and Windows and at least another database (Oracle, MS SQLServer,MySQL)• Administration, monitoring of database testing• Support users on the database and associated client connectivity• Automate tasks of installation and administration through the development of scripts• Administrator skills with various DB technologies• Knowledge of Unix scripting technologies (Shell, Perl)• Good knowledge of MVS (JCL, RACF, SDSF, TSO, etc ....)• Willingness to invest and work in a multi file technologies (Netezza, Progress, Teradata,Greenplum)• Concepts of databases and AS400, DB2, Logical Units of Work (LUW)Also preferred:• Ability to work in a multi-cultural environment• Strong service orientation• Good oral and written communication• Familiarity with SAP systems and applicationsWORK EXPERIENCERequires candidates to currently be enrolled in an undergraduate or Masters degree programwhich is applicable to the position.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"if_by_website,_go_to" : "https://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E4969F620628E2F1A7AB0050568F01DB#mainView=search;popUps=1",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):CO-OP NOTE: All students MUST apply via EngCORE as well as through the SAP website in order for your application to be considered.&nbsp;SAP'S DIVERSITY COMMITMENTTo harness the power of innovation, SAP invests in the development of its diverse employees.We aspire to leverage the qualities and appreciate the unique competencies that each personbrings to the company.&nbsp;Company:SAP",
	"division" : "Vancouver Office"
}