{
	"id" : "54108",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 or 12 months",
	"job_title" : "Intern, Product Support (CA-60189936-EN-15-001)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "3",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Intern, Product Support -&nbsp;https://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E495F468FACC2EF1A6620050568F01E2#popUps=1;mainView=searchAs market leader in enterprise application software, SAP helps companies of all sizes andindustries run better. From back office to boardroom, warehouse to storefront, desktop to mobiledevice – SAP empowers people and organizations to work together more efficiently and usebusiness insight more effectively to stay ahead of the competition.PURPOSE AND OBJECTIVESSAP is the 19th Most Valuable Global Brand for 2014 (http://davidroth.com/2014top100/#p=14).It is the Global Market Leader in Enterprise Application Software, the Top Cloud Vendor andLeading Mobility Vendor, with offices and labs located worldwide SAP serves over 260,000customers in 190 countries, including 86% of the Global Fortune 500 and 98% of the 100 mostvalued brands. 74% of the world’s transaction revenue touches an SAP system(http://www.sap.com/corporate-en/factsheet).The SAP community of employees, partners and customers is vast - the SAP CommunityNetwork (http://scn.sap.com) has over 2.5 million members and the Americas' SAP Users'Group (http://www.asug.com) has over 3,700 member companies in more than 17 industries.The worldwide Product Support team of ~3000 is committed to the success of our customersthrough outstanding technical support. We are not merely a Call Centre! We activelyinvestigate customer issues by mastering diverse technologies and by working intensively withthe products we offer. We measure our success by customer satisfaction.Make a difference - become a member of the SAP Community and help the world Run Better(https://www.youtube.com/watch?v=qt-kBjcI8y4)!EXPECTATIONS AND TASKSAmong other responsibilities, you should expect to do many of the following:• Investigates and resolve critical system issues for Enterprise level Fortune 500 companies.• Analyzing complex, real world, unique problems; often working in production environments.• Feel the satisfaction from delivering a solution to customers that make their businesses runsimpler and better.• Meet, work and talk with colleagues and customers from all around the world!• Master SAP software that is being used by industries, governments and multinationalcompanies around the globe.Be part of a small, tight-knit team of professionals:• Working collaboratively to provide solutions to customers.• Learn new skills and technologies that will open paths to many new possible careers. Thelearning never ends – you are expected to continuously learn and up-skill during your time here.• Be a social media guru and create Knowledge Bases, blogs, wikis, and videos, for colleaguesand customers.• Get involved with SAP’s active Intern Community and experience what it is like to be earlytalent at one of the biggest software companies in Canada.• Get the small startup feel with big enterprise backing.• Innovate and create new tools that will help SAP run simple. Anything you can think of to makethe business run better will get SAP support.• Join the global SAP Family and become an ambassador for the Support Organization.",
	"job_requirements" : "EDUCATION AND QUALIFICATIONS / SKILLS AND COMPETENCIES• Currently enrolled in a University degree or College diploma program in Computer Science,&nbsp;Business and Technology, or related areas.Required:• Excellent English communication skills (written and oral)• Excellent diagnostic and technical analysis skills• Ability to assess, plan and troubleshoot while collecting information about the customer issueAt least one of the following subject matter:• Databases (SAP HANA, Oracle, DB2, SQL Server, SQL Anywhere, ASE, MySQL, etc.)• Operating systems (Windows Server, Linux, AIX, etc.)• Object-oriented programming (Java, C++, ABAP, etc.) and programming logic• SAP Products & Solutions (SAP NetWeaver, SAP Business Suite, SAP BusinessObjects, etc.)Preferred:• Experience in troubleshooting distributed systems, including installation, migration andnetworking• Knowledge of business and financial processesWORK EXPERIENCE• Experience working with customers is a plus• Previous internship experience would be an asset• Please specify your availability in your cover letter (8 months or 12 months)• Please upload unofficial transcripts• Foosball, ping pong and/or pool skills not required but appreciated ;-)Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"if_by_website,_go_to" : "https://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E495F468FACC2EF1A6620050568F01E2#popUps=1;mainView=search",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):CO-OP NOTE: All students MUST apply via EngCORE as well as through the SAP website in order for your application to be considered.&nbsp;SAP'S DIVERSITY COMMITMENTTo harness the power of innovation, SAP invests in the development of its diverse employees.We aspire to leverage the qualities and appreciate the unique competencies that each personbrings to the company.&nbsp;Company:SAP",
	"division" : "Vancouver Office"
}