{
	"id" : "54115",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Co-op Term Student",
	"job_location" : "Burnaby",
	"number_of_positions" : "1",
	"salary" : "$20.00 / hr - Experience dependent",
	"frequency" : "Monthly",
	"industry" : "Consulting - Various",
	"company_type" : "Private Business",
	"job_description" : "Primary Engineering and Construction Corporation (Primary) is a growth-oriented industry leader providing professional electrical engineering and construction services and specializing in emerging marketplaces in British Columbia, Alberta and Saskatchewan.We offer design and design/build services for all types of electric utility distribution infrastructure to a wide variety of clients including electric utility companies, developers, builders, commercial and industrial businesses, oil companies, government, and private contractors.&nbsp; We pride ourselves on the backbone of our organization as a team of dedicated veterans with a combined 175+ years of experience in utility distribution design, maintenance, and construction.&nbsp; Our devotion to excellence has attracted some of the best young professional minds to our company.We are seeking a Co-op Term Student, in our Burnaby Office. The applicant we a seeking will augment our growing team of designers and engineers working on electrical distribution projects. They will be responsible for providing overhead and underground electric utility design, drafting, project estimating and process innovations.",
	"job_requirements" : "Required Qualifications:A valid BC Driver’s LicenseThird or fourth year student of Electrical Engineering from a recognized universityStrong work ethic, and enjoy working in a fast paced, dynamic, professional environmentDesired Qualifications:Electrical utility experience, especially with BC Hydro is an assetExperience in electrical distribution engineeringExperience with AutoCAD, Smallworld GIS (DAD)Experience with PLS-CADD, CYME and AGI32 softwareDesign of underground and overhead electrical distribution infrastructure (4kV – 25kV system voltages)Customer meetings and site inspectionsProject schedule management and trackingDesign coordination with customers, municipal authorities, other utilities & various project stakeholdersLighting design and analysis in AGI32 simulation softwareVoltage drop and pulling calculations to BC Hydro StandardsProject management and trackingDesign coordination with various project stakeholdersOther duties as requiredOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"end_date" : "08/28/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Primary Engineering and Construction",
	"division" : "Burnaby",
	"website" : "primaryeng.com"
}