{
	"id" : "54118",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Microsoft Foundry ? Software Engineer (SWE):",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "The Foundry is an innovative program that gives university students the opportunity to work with industry leaders and their peers to build apps for the latest Microsoft platforms.&nbsp; Foundry students work in small teams with modern engineering toolsets to build and ship their work.&nbsp; Each team is responsible for an app, starting with product definition, working through design and development; and if successful, wrapping up with the public launch of the app in the Store.&nbsp; Coaches and technical leaders from across Microsoft provide guidance and expertise.&nbsp;The Foundry launched in 2012 in Cambridge, MA and expanded in 2014 to Vancouver, Canada and Hyderabad, India. We are currently recruiting for our Cambridge and Vancouver programs.Foundry Principles:• INVEST IN GREAT TALENTThe Foundry provides an opportunity for students to experience the breadth of Microsoft and to practice engineering in a fast-paced environment.&nbsp; We grow talent and provide an on-ramp for interns to move into future internship or full-time positions at Microsoft.• BUILD ON MICROSOFT PLATFORMSMicrosoft’s strategic platform is constantly moving forward.&nbsp; Our teams build apps and cloud-powered services on Windows, Windows Phone, Xbox One and Azure with APIs from OneDrive, OneNote, Xbox Live, and others.&nbsp;&nbsp;• SHIP FAST WITH QUALITYThe Foundry uses modern engineering infrastructure and an agile development model to ship apps in 12 weeks.&nbsp; Our apps ship to Microsoft’s app stores and have received accolades from press, partners, and customers alike.Foundry teams get:• Unique development and design experience building for the latest Microsoft platforms and devices• Opportunity to build an app end-to-end in a professional engineering environment• Access to Microsoft’s technical leaders, modern engineering infrastructure, tools, and design resources• The chance to strengthen communication, presentation, and demo skills through multiple opportunities to share their work with other Foundry students and Microsoft leadersAs a Software Engineer in the Foundry, you’ll bring a product to life by working with a small team of other software engineers and a designer, with guidance and insight from a team of experienced technical coaches and mentors.&nbsp; You will work closely with your team and have end-to-end ownership for development and quality of a product (and associated services) that will delight customers and add strategic value for Microsoft. Working closely with your team’s designer and other software engineers, you will evaluate requirements, estimate costs, create and implement features and services. You will define and implement the quality criteria for your app, using measurements and insights to understand and validate the quality of experience for customers. You will manage risks, leverage other products and technologies, and drive integration with the broader ecosystem.&nbsp; As an SWE, you are dedicated to producing the world’s most advanced software.",
	"job_requirements" : "Qualifications:• Pursuing a Bachelor’s, Master’s or Ph.D. degree in Engineering, Computer Science or related field• 1-2 years of experience programming in C++, Java or other computer programming languages preferred• 1-2 years of experience in C/C++/C#/VB.NET and experience designing and developing tool architecture preferred• Strong technical prowess, including understanding of algorithms, systems architecture and end-user experience&nbsp;• Expertise in feature definition, design and feasibility• Demonstrated skill in estimating development time• Ability to author test plans and cases, conduct security and stress tests and debug at source level after identifying, investigating and prioritizing bugs• Proactive work ethic, capable and creative problem solver who is not afraid of big challenges• Able to work closely with other team members in a collaborative productive multidisciplinary environmentMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, gender, sexual orientation, gender identity or expression, religion, national origin, marital status, age, disability, veteran status, genetic information, or any other protected status.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Microsoft Corporation",
	"division" : "Redmond Head Office"
}