{
	"id" : "54116",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Intern, Agile Developer (CA-60184168-EN-15-001)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "10",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Intern, Agile Developerhttps://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E4952071A366E2F1A7AB0050568F01DB#popUps=1;mainView=searchAs market leader in enterprise application software, SAP helps companies of all sizes andindustries run better. From back office to boardroom, warehouse to storefront, desktop to mobiledevice – SAP empowers people and organizations to work together more efficiently and usebusiness insight more effectively to stay ahead of the competition.PURPOSE AND OBJECTIVESAs the global market leader for business software, SAP helps the best run businesses runbetter! Do you want your career to run better?Have you ever wondered how a 75 billion euro company, with over 60,000 employeesworld-wide sustains double digit revenue growth? By employing Enterprise Agile developers,you can work side-by-side with the scrum teams to bring better features, faster and with higherquality, to the market in a single work term!Multiple scrum teams in the SAP Suite of products have co-op openings:• Business Intelligence Platform• Reporting• Advanced Analytics• Business Intelligence On-Demand• Deployment LogisticsThese teams are responsible for releasing our core products including Crystal Reports, SAPBusiness Objects Enterprise, Analysis - OLAP Edition and BI On Demand. Operating in a scrumteam, features are created end-to-end. Many of these features are built using technologies suchas Eclipse tools, Eclipse RCP, JQuery, Flex, Data mining, Ruby on Rails just to name a few.EXPECTATIONS AND TASKSDo you have what it takes?• Are you self-motivated and wanting to expand your development knowledge?• Are you creative in designing and writing code to spot problems, isolating problems, anddebugging problems?• Can you learn quickly and collect requirements, propose sound designs/UI, implement andmaintain the code?• Do complex software problems, architecture and system design excite you?• Can you adapt and contribute to an incredibly fast development life cycle?Then you can run better!• Gain experience in communication and technical skills working with Product Owners and otherAgile Developers.• Develop superior skills in software design, testing and analyzing code, and first-to-marketstrategy.• Design and execute test scenarios to fully exercise user stories.• Employ continuous integration, test driven-development, unit tests, end-to-end automation,risk-analysis, testing best practices.• Participate in Sprint planning meetings, effectively estimate user stories, commit and executeon team tasks.",
	"job_requirements" : "EDUCATION AND QUALIFICATIONS / SKILLS AND COMPETENCIESRequired Skills: Strong programming skills in Java and C++. A strong working knowledge ofdata structures/algorithms and principles of OO design. Understanding of operating systems,databases (relational/OLAP), and web application servers.Desired Skills: Design patterns, web application servers configuration, client/server, Linux/Unix, vulnerabilities (Cross Site Scripting, SQL Injection). Web technologies such as XML, JSP, ASP, JavaScript and/or AJAX.WORK EXPERIENCE• Previous internship experience would be an asset.• Seeking students who can commit to 8 months. Please state on your cover letter and/orresume how long you can commit for.• Please upload your unofficial transcript.Expected Start Date: May 4, 2015Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"if_by_website,_go_to" : "https://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E4952071A366E2F1A7AB0050568F01DB#popUps=1;mainView=search",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):CO-OP NOTE: All students MUST apply via EngCORE as well as through the SAP website in order for your application to be considered.&nbsp;SAP'S DIVERSITY COMMITMENTTo harness the power of innovation, SAP invests in the development of its diverse employees.We aspire to leverage the qualities and appreciate the unique competencies that each personbrings to the company.&nbsp;Company:SAP",
	"division" : "Vancouver Office"
}