{
	"id" : "54110",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Intern, Tools Developer (Translation tools) (CA-60189147-EN-15-001)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Intern, Tools Developer (Translation tools) -&nbsp;https://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E495D44659CA2CF1A6620050568F01E2#mainView=search;popUps=1As market leader in enterprise application software, SAP helps companies of all sizes andindustries run better. From back office to boardroom, warehouse to storefront, desktop to mobiledevice – SAP empowers people and organizations to work together more efficiently and usebusiness insight more effectively to stay ahead of the competition.PURPOSE AND OBJECTIVESSAP Language Services (SLS) is a global team responsible for translating all SAP softwareproducts and a variety of internal and customer-facing content into more than 35 languages.As a member of the SAP Language Services team in Vancouver, you will work in a dynamicenvironment and maintain internal systems and applications to support the localization process.The ideal candidate for this position is a team player, possesses excellent communication skills,and demonstrates a strong understanding of software development and localization practices.EXPECTATIONS AND TASKS• Prepare, reintegrate and manage localizable resources for translation.• Work with localization project managers to ensure the localization process runs smoothly andon schedule.• Develop and maintain internal tools and scripts to support and improve the localizationprocess.• Monitor and maintain support queues. Provide primary support.• Troubleshooting with respect to system failure in the production environment, includingcommunications with affected users as required.• Analyze, define and document new requirements for data, workflow, business processes.• Provide estimates for assigned work.• Coordinate testing, integration and documentation of solution",
	"job_requirements" : "EDUCATION AND QUALIFICATIONS / SKILLS AND COMPETENCIES• Web application development experience in:.NET C#, Java, Perl• Development experience with SQL Server and Oracle, trigger and stored procedures.• Ability to meet aggressive deadlines and quickly understand the existing framework andbusiness requirements.• Flexible team-player with excellent interpersonal skills• Strong problem solving skills• Ability to prioritize and work on multiple tasks• Very organized with high attention to detailWORK EXPERIENCE• Candidates to currently be enrolled in an undergraduate, Masters or PhD degree programwhich is applicable to the position (computer science or equivalent proven experience).• Knowledge of TMS, CAT tools an assetOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"if_by_website,_go_to" : "https://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E495D44659CA2CF1A6620050568F01E2#mainView=search;popUps=1",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):CO-OP NOTE: All students MUST apply via EngCORE as well as through the SAP website in order for your application to be considered.&nbsp;SAP'S DIVERSITY COMMITMENTTo harness the power of innovation, SAP invests in the development of its diverse employees.We aspire to leverage the qualities and appreciate the unique competencies that each personbrings to the company.&nbsp;Company:SAP",
	"division" : "Vancouver Office"
}