{
	"id" : "54117",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Intern, Technical /QA Consultant (CA-60184083-EN-15-001)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Intern, Technical /QA Consultanthttps://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E4951E89BDCABFF1A7AB0050568F01DB#mainView=search;popUps=1As market leader in enterprise application software, SAP helps companies of all sizes andindustries run better. From back office to boardroom, warehouse to storefront, desktop to mobiledevice – SAP empowers people and organizations to work together more efficiently and usebusiness insight more effectively to stay ahead of the competition.PURPOSE AND OBJECTIVESSAP is ready to challenge your next work term with a role that combines development withtesting. You will work with Senior Solution Architects in SAP IT on projects in the area of theSAP CRM based Partner Relationship Management applications.You will learn the SAP programming language as well as unit test and validate code, performsmall code enhancements, support code releases.You will also support unit and integration test activities as part of our project delivery lifecycle.EXPECTATIONS AND TASKS- Self motivated and have the desire to expand your development knowledge- Adaptable to new work environment, processes and tools- Quick at learning new development languages- Keen on learning how SAP applications work- Able to test applications and solutions- Strong will to pursue a problem, identify the source and propose possible solutions.",
	"job_requirements" : "EDUCATION AND QUALIFICATIONS / SKILLS AND COMPETENCIES- Strong programming skills in a language such as :Java, C#, C++, .Net or any object orientedprogramming language- Solid understanding of software applications and software development lifecycleWORK EXPERIENCERequires candidates to be currently enrolled in an undergraduate program, which is applicableto the position.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"if_by_website,_go_to" : "https://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E4951E89BDCABFF1A7AB0050568F01DB#mainView=search;popUps=1",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):CO-OP NOTE: All students MUST apply via EngCORE as well as through the SAP website in order for your application to be considered.&nbsp;SAP'S DIVERSITY COMMITMENTTo harness the power of innovation, SAP invests in the development of its diverse employees.We aspire to leverage the qualities and appreciate the unique competencies that each personbrings to the company.&nbsp;Company:SAP",
	"division" : "Vancouver Office"
}