{
	"id" : "54112",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Intern, Technical Consultant - Enterprise Analytics and Planning (CA-59679732-EN-15-001)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Intern, Technical Consultant - Enterprise&nbsp;Analytics and Planninghttps://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E49526968C574AF1A7AB0050568F01DB#mainView=search;popUps=1As market leader in enterprise application software, SAP helps companies of all sizes andindustries run better. From back office to boardroom, warehouse to storefront, desktop to mobiledevice – SAP empowers people and organizations to work together more efficiently and usebusiness insight more effectively to stay ahead of the competition.PURPOSE AND OBJECTIVESSAP's Business Innovation & Application Services Department (part of Global IT) is a criticalenabler of our business success by providing advanced and efficient IT solutions, technologyand operational support to our internal clients. Supporting more than 60,000 internal andexternal users and thousands of SAP systems, BI&AS is responsible for SAP's worldwideinternal Business Applications.As part of BI&AS, the Enterprise Analytics and Planning team is the end-to-end service providerresponsible for planning, building, and running Analytics solutions and platforms for SAP. Theteam supports all lines of business with a wide range of services based on SAP Analyticsproducts.This internship offers an excellent opportunity for broad exposure working with aglobal and diversified team of Business Intelligence professionals.The Technical Consultant intern will assist and provide support primarily on project workrevolving around developing and implementing Analytics solutions for SAP’s internal operations.The selected candidate will be a member of the BI&AS department and work closely with othermembers of the team and business colleagues.EXPECTATIONS AND TASKS• Assist with development of Analytics solutions• Assist with system implementations and testing• Direct interaction with global team members and end-users• Prepare and present presentations/status reports• Document architecture and procedures",
	"job_requirements" : "EDUCATION AND QUALIFICATIONS / SKILLS AND COMPETENCIES• Enrollment in a Computer Science, Information Systems or similar (Information Technologyfocused), MIS or DSS degree program preferred• Position is open to undergraduate & graduate students• Communication Skills (written, verbal, and listening)• Ability to work independently and to multi-task (reliable, responsible, and accountable)• Attention to details• Flexible team player• Experienced with data modeling and database design• Knowledgeable on SAP HANA,SAP BW and SQL scripting• Experience with HANA XS, SAPUI5, HTML5, JavaScript and SQLScript is a plusWORK EXPERIENCE• 6-8 months of previous co-op, internship or work experienceOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"if_by_website,_go_to" : "https://careercenter.sap.com/sap/bc/bsp/rcfuix/flex_ui_ext/saperecruiting.html?jobId=E49526968C574AF1A7AB0050568F01DB#mainView=search;popUps=1",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):CO-OP NOTE: All students MUST apply via EngCORE as well as through the SAP website in order for your application to be considered.&nbsp;SAP'S DIVERSITY COMMITMENTTo harness the power of innovation, SAP invests in the development of its diverse employees.We aspire to leverage the qualities and appreciate the unique competencies that each personbrings to the company.&nbsp;Company:SAP",
	"division" : "Vancouver Office"
}