{
	"id" : "54129",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Hardware Designer - Co-op (SW)",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Job Title:&nbsp; Hardware Designer, Co-op&nbsp;&nbsp;&nbsp;&nbsp;Department:&nbsp; EngineeringTerm/Duration: 8 Month Term (Fall 2014 Placement)Company Profile:Sierra Wireless (www.sierrawireless.com) is a global leader in providing wireless communication solutions that enable mobile professionals to improve their productivity and lifestyle. Products designed by Sierra Wireless are recognized as unique, offering differentiated and reliable solutions, backed by world-class customer support.Position OverviewThe main responsibilities in this position include assisting the engineering team with design tasks, prototyping and PCB assembly and testing.&nbsp; You will also assist with the introduction of products into a factory as well as product and component qualification.&nbsp; Other responsibilities will include helping to prepare product documentation, schematics and test reports, assisting with component sourcing and purchasing and occasionally conducting technical research.",
	"job_requirements" : "RequirementsThe successful candidate will have an interest in communications technologies and the ability to perform basic soldering and prototyping functions.&nbsp; A good working knowledge of digital and/or analog design is essential, and C / VisualBasic programming would also be an asset.&nbsp; A work term with Sierra Wireless will give the student experience with the following technologies: following technologies: communications protocols; miniaturized PCB designs incorporating the latest in Microprocessor, IC, and SMT technology; state of the art RF design and manufacturing; and exposure to a wide range of processes in taking a design through prototype stages to volume manufacturing.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Sierra Wireless Inc.",
	"division" : "Head Office"
}