{
	"id" : "54120",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Junior Software Developer (CO-OP)",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "With offices around the world, Transoft Solutions is an international leader in the development of innovative software for the transportation engineering design sector. We currently have an opening for a Junior Software Developer (co-op) at our head office in Richmond, BC.About the Role• Assist in design and implement Windows, Web or CAD based software products for the engineering and architectural design communities• Maintain and improve existing company products• Work within the guideline of the development process• Collaborate with other stakeholdersAbout YouYou have a practical knowledge of C/C++, creative and hard working.&nbsp; You want to work with a group of dedicated software professionals and get a taste of a fast growing, leading edge and competitive software company.About UsSince 1991, Transoft Solutions has invested in people, software, and technology to help our clients achieve their full potential. But we're not just in the business of developing engineering software; we also believe in delivering outstanding sales and technical services.We develop and support innovative and time-saving CAD-based software for engineers, architects, and drafters for their civil and infrastructure design and planning needs. Transoft's products have become the de facto standard of the departments of transportation of many state and national agencies throughout the world - a level of success that clearly makes us a worldwide leader in our field!We wish to thank all applicants for their interest, however, only candidates selected for interviews will be contacted.",
	"job_requirements" : "Qualifications• 3rd year computer science or above• Knowledge of UML, database, MVC, UI design and software life cycle tools.• Working knowledge in several of the following technologies:&nbsp;&nbsp; .NET, ASP.NET, HTML5, SQL, Javascript, C#, C/C++, MFC and WPF• Communicate well with other stakeholders with diverse background• Self motivated and driven to be successful in life.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Transoft Solutions Inc",
	"division" : "Transoft Solutions Inc"
}