{
	"id" : "54121",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Engineer for Manufacturing Automation",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Kardium Inc. - Co-Op Job PostingJob Title:&nbsp; Software Engineer for Manufacturing AutomationKardium is a dynamic company made up of a group of highly talented individuals with expertise in business, management, electrical engineering, mechanical engineering, and software development.&nbsp; We are focused on developing innovative, highly differentiated medical devices.&nbsp; Kardium has assembled a highly skilled product development team and a fully-equipped rapid prototyping workshop and laboratory in order to commercialize several innovative medical devices, including unique percutaneous approaches to treating atrial fibrillation and mitral valve regurgitation.Kardium is developing a novel catheter-based system for treatment of atrial fibrillation.&nbsp; The successful candidate will be involved in the design, coding, and testing of software and firmware for automated manufacturing (robotics) of medical devices.&nbsp;The student will receive requirements for manufacturing apparatus from R&D engineers, and will apply those requirements to a design concept which will be reviewed and approved by team members.&nbsp;The student will be required to help develop and maintain validation protocols, and to carefully document both the design and testing of the automated apparatus. The successful candidate will:&nbsp;&nbsp;&nbsp; * Have excellent communication skills.&nbsp;&nbsp;&nbsp; * Have a keen desire to help produce high quality code.&nbsp;&nbsp;&nbsp; * Have good object-oriented programming skills, typically with C#, Java or C++.&nbsp;&nbsp;&nbsp; * Be highly proactive and able to execute tasks with minimal instruction and guidance.&nbsp;&nbsp;&nbsp; * Be enthusiastic about finding innovative solutions to unforeseen challenges.&nbsp;&nbsp;&nbsp; * Have a history of success working in a team setting.",
	"job_requirements" : "The following factors are greatly desired and will greatly increase the suitability of the candidate:&nbsp;&nbsp;&nbsp; * Have experience with electrical design and hands-on ability: wiring, soldering, debugging etc.&nbsp;&nbsp;&nbsp; * Experience with data acquisition, motion control, machine vision, and database development.&nbsp;&nbsp;&nbsp; * Experience in using eCAD, particularly Altium.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaster of Software SystemsMechanicalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Kardium Inc.",
	"division" : "Kardium"
}