{
	"id" : "54134",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Embedded Software Engineering Co-op (4 Month Term)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Embedded Software Engineering Co-op (4 Month Term)NSERC Eligibility is REQUIRED for this application.&nbsp; To be NSERC eligible, you must:Be a Canadian Citizen or Permanent Resident of Canada;Be a Full-time student at the time of application;have a CGPA of 2.7 or higher;be an Undergraduate student; andhave not held an NSERC award within the current fiscal year (April 1 to March 31)Company DescriptionDelta-Q Technologies develops and supplies battery chargers to original equipment manufacturers(OEMs) of electric vehicles and industrial equipment. Delta-Q’s unique blend of engineering capability inhigh efficiency power electronics and embedded software design delivers innovative battery chargingsolutions to meet the evolving needs of its customers. With nearly a million vehicles and industrialmachines already using its products, Delta-Q’s innovation is enabling the widespread adoption ofenvironmentally friendly electric drive systems. Delta-Q was founded in 1999 and is a privately heldcompany located in Vancouver, Canada. Find out more about our company on www.Delta-Q.com.LocationYou will be working out of our head office in Burnaby, BC, right across the street from the BCIT campus.We are nearby transit and close to many malls, restaurants, parks and trails. We offer free parking andhave onsite fitness facilities available to all employees.ReportingYou will be reporting to the Manager of Software Engineering. This individual has his Master’s degree inElectronic Engineering from one of the UK’s top universities and has been working with softwaredevelopment, largely in the automotive industry, for almost 15 years. This individual started his career asa co-op student and knows what it takes to be a great support and mentor for you.What We Offer You• A friendly and supportive learning environment promoting innovative thinking and creativity• An environment where teamwork, dedication and having fun are highly valued• Professional development and career advancement opportunitiesPosition SummaryThe Embedded Software Engineer Co-op works as part of a multi-disciplinary team focusing onembedded software products. This role involves making continuous improvements on existing productsand supporting application engineering and production support teams. The Embedded SoftwareEngineer Co-op designs, codes, integrates, tests and debugs software programs under the guidance ofsenior engineering staff.Principal ActivitiesYou will participate in and gain exposure to:• Implementing feature improvements• Working as part of the agile development team• Troubleshooting problems and correcting known issues following corporate coding standards• Documenting software changes using on-line tools and company approved documentationstandards• Participating in peer code reviews• Performing thorough validation to ensure the software changes are production ready• Providing technical support for application engineers and the product support team• Recording daily activities and reporting project progress to supervisor• Other duties in support of engineering objectives as requiredFor more information about Delta-Q Technologies and current career opportunities please visit us atwww.delta-q.com.",
	"job_requirements" : "Requirements• A third or fourth year student enrolled in a Bachelors Degree in Electrical Engineering, ComputerScience or a related discipline is preferred• Applicants must be NSERC eligible• 1 to 2 years of embedded software development experience is preferred• Experience with C and familiarity with embedded software development tools• Able to operate basic lab equipment such as oscilloscopes, DMMs, data acquisition units, electronicloads• Ability to understand hardware component data sheets and basic schematics• Experience with AC power systems and digital control systems are definite assets• Experience with software state machines• Experience with AC power systems and digital control systems are definite assets• Keen interest in continuously expanding knowledge in software technology and high reliabilitysoftware development• Strong written and oral communication skills with high attention to detail• Ability to work effectively on an individual basis and in a teamThe following skills would be beneficial:• Competency in other programming languages, including scripting languages• Experience using an RTOS• Experience with Microsoft Office applications• Renesas RX or TI MSP430 microcontroller experienceOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):How to ApplyNSERC Eligibility is REQUIRED for this application.&nbsp; To be NSERC eligible, you must:Be a Canadian Citizen or Permanent Resident of Canada;Be a Full-time student at the time of application;have a CGPA of 2.7 or higher;be an Undergraduate student; andhave not held an NSERC award within the current fiscal year (April 1 to March 31)Apply today to join Delta-Q—a company with a dynamic culture that embraces honesty, integrity,perseverance and innovation.Applications should include:• An updated resume and brief cover letter outlining your experience and interest in the position• A copy of your unofficial transcriptCompany:Delta-Q Technologies Corp.",
	"division" : "Main"
}