{
	"id" : "54135",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "PC Software Engineering Co-op (4 Month Term)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "PC Software Engineering Co-op (4 Month Term)NSERC Eligibility is REQUIRED for this application.&nbsp; To be NSERC eligible, you must:Be a Canadian Citizen or Permanent Resident of Canada;Be a Full-time student at the time of application;have a CGPA of 2.7 or higher;be an Undergraduate student; andhave not held an NSERC award within the current fiscal year (April 1 to March 31)Company DescriptionDelta-Q Technologies develops and supplies battery chargers to original equipment manufacturers(OEMs) of electric vehicles and industrial equipment. Delta-Q’s unique blend of engineering capability inhigh efficiency power electronics and embedded software design delivers innovative battery chargingsolutions to meet the evolving needs of its customers. With nearly a million vehicles and industrialmachines already using its products, Delta-Q’s innovation is enabling the widespread adoption ofenvironmentally friendly electric drive systems. Delta-Q was founded in 1999 and is a privately heldcompany located in Vancouver, Canada. Find out more about our company on www.Delta-Q.com.LocationYou will be working out of our head office in Burnaby, BC, right across the street from the BCIT campus.We are nearby transit and close to many malls, restaurants, parks and trails. We offer free parking andhave onsite fitness facilities available to all employees.ReportingYou will be reporting to the Manager of Software Engineering. This individual has his Master’s degree inElectronic Engineering from one of the UK’s top universities and has been working with softwaredevelopment, largely in the automotive industry, for almost 15 years. This individual started his career asa co-op student and knows what it takes to be a great support and mentor for you.What We Offer You• A friendly and supportive learning environment promoting innovative thinking and creativity• An environment where teamwork, dedication and having fun are highly valued• Professional development and career advancement opportunitiesPosition SummaryIn this position, you will contribute towards software development and testing of state of the art powerelectronics products for electric and hybrid vehicles and for volume production.Principal ActivitiesYou will participate in and gain exposure to:• Implementing feature improvements• Working as part of the agile development team• Troubleshooting problems and correcting known issues following corporate coding standards• Documenting software changes using on-line tools and company approved documentationstandards• Participating in peer code reviews• Writing software for data analysis• Performing thorough validation to ensure the software changes are production ready• Providing technical support for application engineers and the product support team• Recording daily activities and reports project progress to supervisor• Other duties in support of engineering objectives as required",
	"job_requirements" : "Requirements• A third or fourth year student enrolled in a Bachelors Degree in Computer Science or a relateddiscipline is preferred• Applicants must be NSERC eligible• Previous co-op or work experience is an asset• Good knowledge of Java, C, C++, Microsoft Visual C++, C#, Visual Basic (VB.NET) programminglanguages• Good knowledge of database designs and technologies• Software development experience using the Visual Studio IDE• Understand and can put into practice OO design methodologies• Keen interest in continuously expanding knowledge in software technology and high reliabilitysoftware development• Software testing experience including knowledge of different methodologies and the use of thirdparty tools• Strong written and oral communication skills with high attention to detail• Ability to work effectively on an individual basis and in a team• Fluency in EnglishThe following skills would be beneficial:• Competency in other programming languages, including scripting languages• Experience with Microsoft Office applications• Microsoft WPF (Windows Presentation Foundation) experience• Microsoft WCF (Windows Communication Foundation) experience• Experience with writing PC Windows device drivers (either user or kernel mode using the WindowsDDK/WDK)• Experience with implementing IETF (Internet Engineering Task Force) protocols, especially FTP• A good understanding of databases in general; experience with MS SQL Server• VSTO (Visual Studio Tools for Office) experience• Artistic abilityOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):How to ApplyNSERC Eligibility is REQUIRED for this application.&nbsp; To be NSERC eligible, you must:Be a Canadian Citizen or Permanent Resident of Canada;Be a Full-time student at the time of application;have a CGPA of 2.7 or higher;be an Undergraduate student; andhave not held an NSERC award within the current fiscal year (April 1 to March 31)Apply today to join Delta-Q—a company with a dynamic culture that embraces honesty, integrity,perseverance and innovation.Applications should include:• An updated resume and brief cover letter outlining your experience and interest in the position• A copy of your unofficial transcriptCompany:Delta-Q Technologies Corp.",
	"division" : "Main"
}