{
	"id" : "54146",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Developer",
	"job_location" : "Surrey, BC",
	"number_of_positions" : "1",
	"salary" : "Varies",
	"frequency" : "Yearly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "About Safe SoftwareSpatial data is everywhere: web mapping servers, navigation systems, personal GPS, and even the next generation of cellular phones. Safe Software produces the technology that unlocks data from the world-leading spatial data producers like government, military, and utility companies for use in new killer apps including Google™ Maps, Google™ Earth, Microsoft® Bing Maps and Microsoft® MapPoint®.We have been shipping our FME® (Feature Manipulation Engine) product to customers worldwide for over a decade, and have become the world’s leading supplier of translation and transformation software. Our technology provides connectivity between products from companies such as Microsoft®, Oracle®, Autodesk®, ESRI®, Intergraph®, Bentley®, and MapInfo®.&nbsp; FME® is now used by many thousands of customers in a variety of industry domains, including GIS, CAD, GPS, telecom, utilities, oil and gas, and all levels of government. Overall, our technology is embedded and used by over 100,000 users worldwide.Co-op developers play an important role in the teams that design, implement, and test key software components that extend our core technology and enable us to enter new markets. Safe Software has a long standing relationship with the Co-operative education programs from Simon Fraser University, University of British Columbia, University of Waterloo, University of Victoria and University of Sherbrooke. If you are eager to learn, motivated to succeed, and are looking for a co-op work term that will put you on the right career path, Safe Software is a great place to start.Safe Software has been very pleased with the candidates that have already been matched to our positions -- in fact, many students have returned for follow-on work terms. Safe is actively looking for new students in order to keep pace with our continued growth. At Safe, successful co-op work terms often lead to an offer of permanent employment. In fact, close to half of our full-time development staff members are Co-operative education program graduates.Developer Positions at Safe SoftwareWe are looking for co-op students and post-secondary graduates to join our Software Development department.&nbsp; Development teams are typically small -- comprised of 3-5 members -- and are responsible for the design, implementation and testing of new FME components and the maintenance of existing components.Additional InformationWe are a very close-knit team at Safe Software, and even though we like to work hard, we also like to play hard and have fun. Employees get together, usually twice a week, to play sports during the lunch hour. The two most popular sports at Safe are street hockey and soccer. No prior experience is required for either sport – everyone is welcome and encouraged to participate. Or, if you prefer to stay indoors during your breaks, you can play foosball or air hockey. Safe’s recently expanded facilities now include even more activities: employees can relax in front of our projection HDTV, challenge friends to a game of Nintendo® Wii™, or sit back on a couch with a magazine in our coffee house-style lounge area. Staff can also exercise before, during or after work in Safe’s brand-new state of the art gym, which features a variety of cardio machines, weight training equipment and luxurious private shower facilities.Hungry afterwards? Visit our company-subsidized canteen, the 11th Goal, which includes everything from lunch items and healthy snacks to gum and candy. Beverages, including juice, pop, coffee, cappuccino and tea, are provided free of charge.Safe Software believes that a good work environment is important. You won't find any cube-farms here -- in most cases, employees have individual offices, populated with the latest software and hardware, including dual LCD displays. A good work-life balance is important too: Safe Software operates within flexible core hours.Communication is one of the keys to a successful company. Although Safe Software is a privately owned company, we still hold quarterly review meetings (which usually include lunch). We also schedule regular lunch-and-learn information sessions, and we have an informal, open-door policy for most other meetings. And every time Safe Software has a major product release, the entire staff celebrates with a catered lunch and seasonal goodies.Safe Software is located in Surrey, BC. By car, you can reach Safe in about 30 minutes traveling from the Vancouver International Airport and 45 minutes traveling from downtown Vancouver. By bus, it takes 25 minutes to reach Safe Software from the Surrey Central SkyTrain Station. Two buses, the 323 and 324, travel from Surrey Central to Safe; together they provide service at fifteen–minute intervals during normal working hours.",
	"job_requirements" : "We are currently seeking developers who possess the following skills. Applicants are asked to indicate their preference, if any, in their cover letter.Essential:• Good knowledge of Object Oriented Programming concepts• Strong C++ development skillsDesirable:• Practical experience developing applications on the Windows® operating system• Microsoft®&nbsp; Visual Studio®• UNIX® operating system• Scripting languages, e.g. Perl, Bash, Python, and TCL• Qt®• Java™Applicants should have excellent organization, communication and interpersonal skills.&nbsp; Knowledge of spatial data domain is an asset.For additional information, please visit http://www.safe.com/company/careers.Cover Letter RequiredTranscript RequiredOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:01/05/2015",
	"end_date" : "04/24/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Safe Software Inc.",
	"division" : "Main",
	"website" : "www.safe.com"
}