{
	"id" : "54147",
	"application_deadline" : "Jan 15, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Electrical Hardware Engineering Co-op/Intern - R002903",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Electrical Hardware Engineering, Co-op/Intern, Ciena, Product Integrity(4-, 8- or 12-month Co-op/Intern position with contiguous or split over two consecutive terms)&nbsp;Job # R002903Ottawa, ON&nbsp;Ciena Corporation is a global networking leader holding #1 market position in our field.&nbsp; At our R&D headquarters in Ottawa we develop telecommunications and datacenter hardware solutions for customers such as AT&T, Verizon, Google and Apple and other telecommunications giants.&nbsp; Located in the west end of Ottawa with over 1000 hi-tech employees on campus, we are surrounded by acres of on-site green space, bike paths and recreational sporting fields (baseball, volleyball, soccer, ultimate) with access to showers and locker rooms inside our building.&nbsp; There is an OC Transpo bus stop conveniently located on campus.&nbsp;Our team works closely with the hardware teams in the development of leading-edge optical networking products like the 6500and 5430and enjoys working in a dynamic team environment with employees from around the world.&nbsp;&nbsp; At Ciena you’ll enjoy flexible working hours, individual mentors to help you throughout your work term, personal Windows laptop, access to our on-campus cafeteria, free coffee & tea and fully equipped self-serve kitchens all in a modern, collaborative office setting.&nbsp;Responsibilities:Co-op job responsibilities will consider candidate’s experience and abilities.Under the guidance of a senior EMC/Compliance specialist, work with a dynamic team of electrical and mechanical designers to assist in the development of new products which meet stringent technical requirements.&nbsp; These requirements satisfy commercial and regulatory specifications and standards.Become familiar with the key Electromagnetic Compatibility (EMC) and product safety standards for our industry.Draw on circuit theory and RF undergraduate studies to develop the ability to identify and assess design solutions to meet EMC and safety standards.Under the guidance of the senior EMC Engineer, assemble and operate test configurations for off-site testing at 3rdparty labs.&nbsp; Troubleshoot operational issues with the product under test and collaborate with both the hardware and software teams to identify solutions or work-aroundsAs needed, assist in the development of engineering test setups to investigate test failures and, using specialized test instrumentation, collect data to provide insight on the issue and assess potential hardware solutions.",
	"job_requirements" : "Required Skills / Qualifications:Basic understanding of test measurement instrumentation.Self-starter, highly motivated with good interpersonal skillsIntroductory familiarity with basic electromagnetic field conceptsIntroductory familiarity with basic electronic circuits concepts&nbsp;Nice to have Skills:Familiarity with and working knowledge of basic test instruments such as oscilloscopes, voltmeters and spectrum analyzers.Test exposure to EMC standards such as CISPR 22/24 in a laboratory environment.Test exposure to telecommunications network requirements described in Telcordia NEBS and European ETSI specifications.RF test experience.&nbsp;Key Skills You can develop:First-hand experience configuring equipment for compliance to EMC, safety and telecommunications equipment (e.g. NEBS) standards.Visibility of the full hardware development life-cycle from requirements through to test and verification.Exposure to and opportunity to learn specialized engineering skills in the area of EMC, enabling design for compliance.Strong sense of responsibility for quality and timely completion of assigned tasksOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://ciena-openhire.silkroad.com/epostings/index.cfm?fuseaction=app.jobinfo&jobid=2839&source=ONLINE&JobOwner=994171&company_id=16622&version=2&byBusinessUnit=NULL&bycountry=0&bystate=0&byRegion=NULL&bylocation=NULL&keywords=&byCat=36305&proximityCount",
	"company" : "Ciena Corporation",
	"division" : "Ciena Corporation",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):R002903"
}