{
	"id" : "54145",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-Op Developer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "What does it mean to you to be a Developer?It means that you’re a creator. That you’re able to make something that is beautiful and perfect, that works exactly the way it’s supposed to. You live and breathe code. You obsess over the details, because you know it’s all in the details. Nothing short of excellence will ever do, because as a creator, you put a bit of yourself in everything you make. You know that it’s more than just code – the things you create will be used by people who need them to work, and work well. And that’s what drives you: doing the right thing, every time.Imagine what it would be like to work in a place where everyone saw things like that. Where smart, talented people strive for excellence every day, and where there is always a new challenge just around the corner that will stretch your knowledge and abilities. The kind of place where people work hard together, but where they don’t forget to play hard and have fun along the way, too. The kind of company that believes strongly enough in innovation to create an annual competition and event for our people to showcase their own ideas. A company where you can take your career where you want to take it, not just where some rigid organizational chart says it can go.Just a few of the technologies we work with every day include the various flavours of CMS tools, ASP.NET, Java, JavaScript , Python, PHP, C#, HTML5, CSS, iOS, Android, Raspberry Pi, and Arduino. We’ve been known to geek out on data too – so if you are serious about Hadoop, Pig, Hive, ZooKeeper, Oozie, and Sqoop (and haven’t chuckled already) – we should definitely talk!T4G has been recognized as among the very best places to work in Canada by the Great Place to Work® Institute 7 years running, as Canada's Top 100 Employers for Young People, and as a Top 6 Co-op Employer on the Planet!",
	"job_requirements" : "We are actively recruiting right now for a Co-Op Developer to join our team in the summer of 2015. If T4G sounds like the kind of place you think you’d fit in, tell us why. And please send us more than just a resume. Tell us what you’re passionate about, and how you are driven by creating things that are truly excellent. Tell us what you value most.Tell us what it means to you to be a Developer.We look forward to hearing from you.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "T4G",
	"division" : "Halifax Office",
	"website" : "http://t4g.com/"
}