{
	"id" : "54149",
	"application_deadline" : "Jan 21, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8, 12 or 16 months",
	"job_title" : "Design Verification Intern 2030174",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "GE (NYSE: GE) works on things that matter. The best people and the best technologies taking on the toughest challenges. Finding solutions in energy, health and home, transportation and finance. Building, powering, moving and curing the world. Not just imagining. Doing. GE works. For more information, visit the company's website at www.ge.com GE Energy – Lentronics is looking for a highly motivated and innovative co-op student to join our software and hardware design team working on the latest technologies for industrial grade communication equipment. &nbsp;he Position: As the Design Verification Co-op you will be joining a fast-paced, energetic, creative environment as part of the GE Lentronics design team. In this role, you will have an opportunity to work alongside experienced professionals within the field of Hardware, Firmware design and System Validation. You will gain exposure supporting new and innovative fiber optics telecommunication product and assist the greater organization in achieving its annual goals and objectives as an active participant. Nature of work:In this role, your responsibilities will include (but are not limited to);• Setup our new fiber optics multiplexer system in the lab, using various data type testers and GE legacy devices.• Test firmware for bugs and limitations using various test scripts. • Generate reports on the bugs found and the maybe a suggestion on how to fix or improve firmware. • Assembling and debugging our new fiber optics multiplexer system• Conducting temperature and electrical tests for individual boards and system• Evaluating board performance (using oscilloscope, optical tester etc.)• Writing scripts to automate test procedures and debug hardware issues• Generating test reports for all the above.",
	"job_requirements" : "Do you qualify? We are seeking… • Good understanding of electronic components, test equipment and CAD tools• Hands on experience in electronics or electro-mechanics would be a benefit• Ability to work independently• Quick learner• Strong programming skills in C and C++.• Superior analytical and problem solving skills.• Familiar with embedded microprocessor design process, compilers and IDE.• Good understanding of the basics of network communications, like Ring topology, Ethernet protocol, Low data rate transmission facilities, rates, Iine encoding etcEducation: • Bachelor Degree in course of completion in Electrical Engineering or equivalent related discipline &nbsp;Desired Characteristics:• Position may be from 8, 12, or 16 months in length.• Longer availability would be a benefit &nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://xjobs.brassring.com/tgwebhost/jobdetails.aspx?partnerid=54&siteid=5346&jobid=1216102",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Candidates are to submit a cover letter, resume, and transcript. It is a mandatory requirement that you identify your school, cumulative GPA, and anticipated graduation date as part of the application process.This opportunity is intended for current students who will be returning to their in-class studies upon the completion of the work term. It is not open to candidates who will have graduated prior to the start of this position.Please note that this position does not provide a subsidy for relocation expenses.Only those selected for an interview will be contacted. Thank you for your interest in joining GE Company:GE (General Electric) Canada",
	"division" : "Default Division",
	"website" : "gecareers.comADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):2030174"
}