{
	"id" : "54153",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Content Development",
	"job_location" : "Kanata, ON",
	"number_of_positions" : "2",
	"salary" : "N/A",
	"frequency" : "Hourly",
	"job_description" : "Wind River is the global leader in device software optimization (DSO). We enable client companies to develop and run device software more effectively. Wind River technology is currently deployed in more than 300 million devices worldwide by industry leaders in all sectors. Wind River was established in 1981 and currently has 1300 employees worldwide with 170 employees in Canada. Wind River is headquartered in Alameda, California. Wind River became a wholly owned subsidiary of Intel(R) Corporation on July 17, 2009. Intel stock is traded on NASDAQ (INTC).&nbsp; Wind River sales exceeded 360 million in 2009.During a Coop placement with Technical Publications,you will work closely with one or more Wind River development teams to research and write technical manuals for software developers.Job responsibilities could include: Researching and planning technical manuals. Building multi-chapter books, creating PDFs and HTML, and preparing files for print production. Editing and indexing work from other writers. Participating in development meetings. Learning and applying Wind River Technical Publications standards.&nbsp;&nbsp;&nbsp;&nbsp; Communicating progress, issues, and results to the Ottawa Manager & other associatedWriters.",
	"job_requirements" : "Must have;- BSEE/BSCS student- Fluent in C-&nbsp;&nbsp;&nbsp; Completed courseware which includes real-time systems and/or operating systemsHighly desirable;- Knowledge of the VxWorks + Linux OS is an asset- Must possess good writing and verbal skills in the English languageOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Resume, Cover Letter, Transcript",
	"company" : "Wind River Systems Inc.",
	"division" : "Canada"
}