{
	"id" : "54159",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Biomedical Engineer Research Assistant",
	"job_location" : "Centre for Hip Health and Mobility",
	"number_of_positions" : "1",
	"salary" : "$1500",
	"frequency" : "Monthly",
	"industry" : "Biomedical/Biotechnology",
	"company_type" : "Non-Profit Organization",
	"job_description" : "The Surgical Solution Lab (Dr. Shahram Amiri, Principal Investigator) within the Centre for Hip Health and Mobility is focused in research and development for image-guided medical devices in close collaboration with the Department of Orthopaedics at UBC and Vancouver General Hospital.The co-op student will work in a project that involves many aspects of biomedical engineering skills including developing image analysis software, design and development of medical devices, and conducting lab experiments on specimens for validation and refinement of the mechanical and electromechanical medical devices related to orthopaedic surgery.&nbsp;Specific tasks may include:- Learning project background from literature- Developing software in MATLAB programming environment- Design and development of mechanical/electromechanical parts/assemblies- Building mechanical prototypes- Conducting validation tests on artificial and cadaveric specimens- Performing data analysis and assisting in manuscript preparationThe student would be situated at the Centre for Hip Health and Mobility (VGH campus).&nbsp; The student will be expected to contribute to a scholarly publication following data analysis (this will likely require some input following the end of the co-op term).&nbsp;&nbsp;",
	"job_requirements" : "- Strong analytical skills- Proficiency in MATLAB programming language- Proficiency in SolidWorks for mechanical design- Strong electromechanical skills- Willingness to learn- Excellent communication skills, including technical writingOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaster of Software SystemsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:05/01/2015",
	"end_date" : "08/31/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "UBC Centre for Hip Health and Mobility, Biomechanics Lab",
	"division" : "Surgical Solutions"
}