{
	"id" : "54157",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Coop Student-Internet of Things (IoT) Group",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Wind River Systems is seeking an engineering/computer science student to fill a position developing and verifying software for the IoT Edge Management Solution. Based out of our Ottawa facility, the successful candidate will join a highly skilled development team responsible for delivering a world class product that covers latest cloud technologies and device middleware. The successful candidate must be a team player who can quickly ramp up on new technologies and accomplish goals in a fast-paced agile environment. A combination of strong software development and communication skills is a must.Responsibilities:• Assist the team in all aspects of the software development lifecycle a including: development, testing, test automation, defect fixing, productizing, and demonstrations• Participate in scrum as part of the Agile workflow",
	"job_requirements" : "Requirements• Active Computer Science or Electrical Engineering student• Experience with Object-Oriented design and development• Experience with C/C++ programming• Strong networking skills• Experience with scripting languages is an asset• Good debugging skills• Strong communication and collaborative skills• Must work well in a team and be proactive• Must have the desire and ability to quickly learn and work with new concepts• Development experience on embedded platforms is an asset• Development experience with web stack technologies is an asset (Java, Node.js, Web frameworks, Javascript, JQuery, etc)Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Wind River Systems Inc.",
	"division" : "Canada"
}