{
	"id" : "54154",
	"application_deadline" : "Jan 16, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Coop Student-Cloud-Based Platform Development",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Wind River Systems is seeking an engineering/computer science student for a position developing and verifying cloud-based Linux software. Based out of the Kanata R&D facility, the successful candidate will join a highly skilled development team delivering the world’s first telecom grade cloud platform pioneering many new industry leading capabilities.&nbsp;&nbsp; The Carrier Grade Communications Server was unveiled at the 2014 Mobile World Congress to wide acclaim in the media.The successful candidate must be a team player who can quickly ramp up on new technologies and accomplish goals in a fast-paced agile environment. A combination of strong software development and communication skills is a must.Responsibilities:• Assist the team in all software development activities• Develop automated test software and tools• Augment and execute system and regression test suites• Triage software issues and work with the appropriate primes to get them resolved• Investigate creative ways of improving team productivity, ex: automation of lab setup procedures",
	"job_requirements" : "Requirements• Active Computer Science or Electrical Engineering student• Previous co-op experience is an asset• Experience with Object-Oriented design and development• Experience with C/C++ and Python programming• Experience with scripting languages is an asset• Development experience in a Linux environment is an asset• Good debugging skills• Strong networking skills• Strong communication and collaborative skills• Must work well in a team and be proactive• Must have the desire and ability to quickly learn and work with new concepts• Some exposure to cloud and virtualization technologies is an assetOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Wind River Systems Inc.",
	"division" : "Canada"
}