{
	"id" : "54161",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8, 12 or 16 months",
	"job_title" : "Embedded Software Development Internship",
	"job_location" : "Zurich, Switzerland",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Embedded Software Development Internshipin a StartupAre you interested in helping to develop a new breed of interactive and intelligent dynamic machines?Verity Studios, a spin-off of ETH Zurich's Institute for Dynamic Systems and Control, is seeking technicalinterns to complement its growing team. Under the mentorship of Prof. Raffaello D'Andrea (whosestartups and projects include Kiva Systems, The Flying Machine Arena, and the Robotic Chair) you willassist our R&D team as we develop systems that leverage technological innovation, scientific principles,advanced mathematics, algorithms, and the art of design in unprecedented ways, with an emphasis onadvanced motion control. See www.raffaello.name for sample projects. Your tasks will include:• The design and development of embedded software and firmware• Involvement in all stages of prototype development, from design and validation to implementationand testingLocation: Verity Studios' offices are located in downtown Zurich at ETH Zurich, which has a studentpopulation of 17'000 and is consistently ranked among the top universities in the world by all major WorldUniversity rankings. We are a ten-minute walk from the city center and a 15-minute walk from (a swim in)the lake. Zurich is a leading global city in spite of its small population of 390,000. It ranked first inMonocle's 2012 Quality of Life Survey, combining the advantages of its small size, excellent publictransportation, central location in Europe (France, Germany, Italy, and Austria are all within 2.5h by trainfrom Zurich train station), and easy access to outdoor activities on lake Zurich and in the Swiss Alps.Duration: Minimum-6 months-12-16 month interns and trainees (e.g., PEY) are welcomeBenefits:• Competitive salary• Work in an early stage start-up where you’ll help shape the culture and can have a huge impact• Organizational support (incl. looking for accommodation) and organized summer activities throughIAESTE's Zurich office• Offices in downtown Zurich with a view across townFurther information:www.veritystudios.comwww.raffaello.namewww.idsc.ethz.ch",
	"job_requirements" : "Prerequisites:• Successful candidates have a background in embedded software engineering/computer sciencewith a strong academic record and a demonstrated ability to convert theory into practice, inhardware and/or software• Good English skills, written and spoken• Excellent team and communication skillsHow to apply: Please submit the following items:• Your resume/CV• Your transcript• Two letters of referenceOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Verity Studios",
	"division" : "Main"
}