{
	"id" : "54168",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Software Developer, Co-op (EL)",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Job Title:&nbsp; Software Developer - Wireless Linux Systems – Co-op PositionTerm/Duration: 8-Month Term (Fall 2014 Placement)Full-time (40 hours per week)Company OverviewSierra Wireless is a global leader in wireless solutions for mobile broadband and machine-to-machine applications. Our customers include top mobile network operators and leading OEMs around the world.ResponsibilitiesYou will be responsible for the on-time delivery of stable, production ready application software meeting the product requirements and constraints. These include requirements analysis, design, implementation, testing, integration, configuration and documentation for the assigned sub-systems or features.&nbsp;",
	"job_requirements" : "Qualifications- 3rd or 4th year in Electrical or Computer Engineering, or Computer Science with a systems focus (hardware and software);Experience in the following areas:- Linux based software development- Developing complex software applications using Java.&nbsp;- IP Networking- WiFi and networking administration- Web based software developmentPERSONAL ATTRIBUTES:- A proactive nature, willing to take initiative and seek challenges, balancing known risks against time to meet objectives in a systematic approach;- Resourceful self-starter with strong interpersonal and communication skills;- Works well both individually and within a team and takes pride in the overall achievements of the team as well as personal accomplishments.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Sierra Wireless Inc.",
	"division" : "Head Office"
}