{
	"id" : "54170",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Kiewit - Engineering Co-op Opportunities Summer 2015",
	"job_location" : "Various Locations in Canada",
	"number_of_positions" : "5",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Company Description:Kiewit Corporation is one of North America's largest and most respected construction and engineering organizations. Headquartered in Omaha, Nebraska, the employee-owned company operates through a network of subsidiaries in the U.S, Canada and abroad. Kiewit offers construction and engineering services in a variety of markets including transportation, buildings, water resources, power, underground, oil and gas, electrical, mining and marine. Kiewit's workforce includes approximately 10,300 staff along with more than 14,400 craft workers. Kiewit hires people who take on new challenges, explore new ideas, and excel at their work.Do you have a passion for construction? If the answer is yes then how would you like to work for a Fortune 500 construction engineering powerhouse?Positions: Field and Office Engineering StudentsDisciplines: Civil, Mining, Integrated, Mechanical and Electrical Engineering StudentsLocation: Various locations throughout CanadaWorkterm: May 2015 (4/8/12 or 16 month work terms available)&nbsp;How to Apply: - You MUST apply online via Kiewit AND via EngCORE to be considered for these positions.#1&nbsp;Apply Online at www.kiewitjobs.comto only 1 of the 5 postingslisted here, select the one that most aligns with your interests and skill set (further information on the districts found below)#2 Apply with your application via EngCORE.1. Ganotec West –https://kiewitcareers.kiewit.com/job/Acheson-Ganotec-West-District-Engineering-Intern-AB/239126200/2. Kiewit Energy Canada-https://kiewitcareers.kiewit.com/job/Calgary-Kiewit-Energy-Canada-District-Engineering-Intern-AB/239123900/3. Western Canada –https://kiewitcareers.kiewit.com/job/Vancouver-Western-Canada-District-Engineering-Intern-BC/239117700/4. Eastern Canada –https://kiewitcareers.kiewit.com/job/Oakville-Eastern-Canada-District-Engineering-Intern-ON/239147900/5. Ganotec East –https://kiewitcareers.kiewit.com/job/Trois-Rivi%C3%A8res-Ganotec-East-District-Engineering-Intern-QC/240636900/District Information:We have 5 districts that construct work throughout Canada.1) Ganotec West – a heavy industrial contractor who has a history of working on projects such as Power Plants, Tank Reassembly Jobs, Fabrication work, SAGD projects, involved in areas of Power, Oil & Gas and Pulp and Paper. Emphasis is on Electrical and Mechanical work. District office is based out of the Edmonton area in Acheson, AB. More information on our subsidiary district Ganotec West can be found at (www.ganotecwest.com)2) Western Canada – a large infrastructure district, head office located in Vancouver. Projects range from highways, bridges, mass transit systems, mine site development, hydroelectric powerhouses, dams and industrial facilities. They also specialize in grading, paving, excavation and structures.3) Kiewit Energy Canada – is a major industrial contractor based in Calgary, Alberta. Projects involve construction of oil sands processing facilities, including steam–assisted gravity drainage facilities, refinery expansions, gas plant expansions, co–generation facilities, major mine developments and pipe spool fabrication. Kiewit Energy Canada also has a Modular Yard facility in Edmonton, Alberta.4) Eastern Canada – projects include highways, bridges, mass transit, mine site development and open pit operations, hydroelectric powerhouses, wind-power plants, dams and industrial. Operations are conducted as part of the Infrastructure group and head office is located in the Greater Toronto area.5) Ganotec – Kiewit acquired Ganotec in 2007. Specializing in construction and industrial maintenance, our headquarters located in Quebec and our work extending from Alberta to Newfoundland. Our activities sectors concentrate in chemical, oil, energy, metallurgy, mining, natural gas, and pulp and paper industries.For further information please visit their website (http://ganotec.com/)",
	"position_description" : "Students will be working under the guidance of senior engineers, in entry-level positions that will provide a wide range of experience and responsibilities. This is an entry level position that performs assignment-specific engineering and construction management duties that may include any combination of the following: Safety – participation in daily safety tours and tool box meetings Estimating, pricing and bidding work Contract Administration – subcontract and material contract management Document control Trend tracking – tracking of quantities, costs and progress curves Purchasing, expediting and coordination of materials Equipment and Material Management Material takeoffs and material receipt inspections Surveying and quantity tracking Quality Control & Quality Assurance Scheduling & Work plan development - Coordination between engineering and construction activities",
	"job_requirements" : "Requirements / Qualifications:Students must be working towards an engineering degree and/or diploma Candidates must possess a strong work ethic Must be able to meet deadlines and put in the time needed to get the job done Strong organizational, time management Effective oral and written communication skills Be able to effectively carry out assigned duties in varying work environments and in different terrain (including various weather conditions) Flexible with work locations – must be able to travel/relocate for the work termOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsCivilComputerElectricalGeologicalIntegratedMaster of Applied Science in CivilMaster of Applied Science in GeologicalMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering CivilMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Kiewit Corporation",
	"division" : "Calgary Office"
}