{
	"id" : "54173",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Co-op Student",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Co-op StudentSummer Co-op TermAccepting candidates for 8-month termRare Disease NetworkA position is open for a student to work as a bioinformatics research assistant as part of a multidisciplinary team, with a focus on neuroscience and the development of tools relating to large-scale and meta-analytical genomics.The principal responsibilities of this position include assisting lab personnel with their projects and maintaining and curating our gene expression database, Gemma (gemma.chibi.ubc.ca). Curation tasks involve data analysis and annotation. No advanced computer skills are necessary for&nbsp; curation tasks as training will be provided. However, a solid biological background is strongly recommended. Successful candidates should have demonstrated strong organizational and time management skills.Students will gain knowledge of the field of research in genomics and bioinformatics, including hands-one experience with tools and development of related skills. Students will also have the chance to develop their own independent research project.",
	"job_requirements" : "For students with strong Java and/or Javascript programming skills there are additional opportunities to work on bioinformatics software development.For more information about our lab, visit http://pavlab.chibi.ubc.ca/Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalGeologicalMaster of Applied Science in BiomedicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in BiomedicalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "UBC Centre for High-throughput Biology",
	"division" : "CHiBi Bioinformatics Lab"
}