{
	"id" : "54175",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Geoscience Technologist Student-9245",
	"job_location" : "AB-Calgary",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "About Cenovus:Cenovus Energy is a Canadian oil company. We are committed to applying fresh, progressive thinking to safely and responsibly unlock energy resources the world needs. Our operations include oil sands projects in northern Alberta, which use specialized methods to drill and pump the oil to the surface. As well, we have established natural gas and oil production in Alberta and Saskatchewan. We also have 50 percent ownership in two U.S. refineries. The future looks pretty exciting, and as a student or new grad we hope you think so too. We're always on the lookout for enthusiastic high-achievers who want jobs with accountability, who can bring fresh ideas to the table, and who are willing to learn from some of the industry's most innovative and talented people.Work Environment:This is a student position based in the Calgary office. The Calgary office is closed the 1st and 3rd Friday of every month.About this opportunity:Cenovus is looking for students enrolled in their first year of an Geoscience Technology or Petroleum Technology Program. This is a four month position, with possibility for extension, and will be based in Calgary, Alberta.",
	"job_requirements" : "Responsibilities:Basic understanding of the Western Canadian Sedimentary basinMap generation and cross section constructionWork closely with Mentors, learning needed skills and daily workflowsGather industry data. Quality control data before adding to in-house databasesDemonstrate knowledge and show ability to learn UNIX systems, GIS and other Technologies • Database managementComplete a summer project assigned by supervisor/mentorFinal presentation on summer experience and project resultsQualifications:Legally entitled to work in Canada for the duration of their work termEnrolled in an Geoscience Technology or Petroleum Technology programMust have strong computer skillsDemonstrated experience with geologic computer software a plusAvailable in May 2015 for a 4 month termCandidate Notification:Immediately following successful submission of your online application, you will receive an online message confirming Cenovus's receipt of your resume. Due to the anticipated volume of applications we are unable to respond to telephone inquiries about the status of your application.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalGeologicalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in GeologicalMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://ucc-cenovus.icims.com/jobs",
	"company" : "Cenovus Energy",
	"division" : "Head Office"
}