{
	"id" : "54189",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Co-op: Applications Engineer ? IPD 7x50 TEC (068)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Co-op Student Position: 4 or 8 months starting in May 2015Co-op Applications Engineer – IPD 7x50 TEC&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No. of openings: 2This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or UniversityAn IPD 7x50 applications engineer is a technical expert on the Alcatel-Lucent 7x50 series of routers. The key responsibilities of a TEC engineer include interfacing with internal Alcatel-lucent R&D teams across the globe and customers to solve complex problems, debug installations and apply both established procedures and creative alternatives to solve problems. Other responsibilities include participating in new product intorduction (NPI) and network design activities by offering technical insights; leveraging the knowledge and expertise cultivated in the TEC team.A TEC engineer can confidently represent and speak on behalf of the product and an ideal candidate for this position is one who has stong problem solving and interpersonal skills.Job description:As a co-op student in the TEC team, you will be a part of a dynamic team environment; presented with new and exciting challenges every day! A key responsibility is to provide support to assist one the TEC team members in problem solving activities with customers and internal Alcatel-Lucent teams. This will require:• Basic knowledge of IP / Networking knowledge• The ability to work under pressure to meet customer deadlines• Thinking outside the box and developing creative solutions to complex problemsYou will also have exposure to hardware failure analysis, enterprise customers and the dynamics of large-scale IP/MPLS, IPTV, 4G LTE network deployments.",
	"job_requirements" : "Qualifications:• Education: Bachelor's degree in Computer Engineering, Electrical Engineering, Computer Science or equivalent experience.• Knowledge of IP/MPLS and general network routing protocols is an assetApply now if you are ready to maximize your technical and creative potential!Alcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability or members of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}