{
	"id" : "54184",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Co-op: SRC Lab Technologist/Tools Developer (03Q)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Co-op Student Position: Summer Term (4 or 8 months)Job title: SRC Lab Technologist/Tools Developer&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No. of position - 1This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or UniversityAs a student, you have lots of ideas to put to the test. At Alcatel-Lucent we will provide you with the opportunity to combine your ongoing academic pursuits with valuable, practical, hands-on experience.At Alcatel-Lucent you will join a team of people that are revolutionizing communications, and you will help to create and support some of the most ambitious and innovative products in the telecommunications industry. If you have the talent, skill and passion, the Alcatel-Lucent Service Routing Certification Program team wants to hear from you!The SRC program is an international IP certification program based on Alcatel-Lucent’s industry leading 7750 Service Routers. As a SRC team member, you will be part of a team that is at the forefront of bringing leading IP technology training to a large and diverse student body located in different parts of the world.We are looking for a software developer. In this role , you will be helping to design, implement and deploy tools that will be used by hundreds and possibly thousands of students and employees associated with the Alcatel-Lucent Service Routing Certification (SRC) Program.Key Responsibilities:1. Equipment Installation• Install new simulators, routers, switches, servers and other network elements.• Installation, configuration and maintenance of Linux and Windows servers.• Maintain and manage lab equipment inventory and tape backup system.2. Lab Support• Provide first line of support to address problems with lab equipment or remote access connectivity.• Maintain high level of customer satisfaction by resolving issues in a timely manner.• Enhance lab automation scripts and custom built web applications.3. Testing & Documentation• Execute feature tests and regression tests of custom built applications.• Evaluate and test third party applications.• Document the lab software and hardware environment.",
	"job_requirements" : "Qualifications:2nd year+ co-op student registered in a recognized Co-Op or Intern Program at a Canadian College or University; Computer Science or Computer Engineering ProgramEssential• Experience with network troubleshooting.• Experience setting up Linux and Windows servers and test equipment.• Experience with Linux operating system and Linux scripting.• Excellent interpersonal, organizational, and communication skills.Desirable• Experience with Nagios Network Analyzer network monitoring system.• Experience with virtualization software.• Experience with PERL scripting.Alcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability and persons of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}