{
	"id" : "54181",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Java Developer Co-op",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "2",
	"salary" : "$2800-3200 based on experience",
	"frequency" : "Monthly",
	"job_description" : "Java Developer in VancouverWe are looking for a co-op student to join our development team and help support our growing enterprise go-to-market requirements. This is a great opportunity to get involved with an up and coming company and get real experience developing SaaS and cloud based solutions. If you want to join a fun team and work with the latest and greatest application development technologies then we want to hear from you!About the company:Allocadia provides cloud software for marketing budget and ROI management giving marketers complete visibility into all investments and all results, whatever the source. Enterprises see immediate financial benefits by re-allocating marketing budgets to the highest-performing marketing programs. We are growing quickly and are one most exciting companies in the marketing software space. Our headquarters are located in the heart of Downtown Vancouver, BC in a world-class office environment with lounge area, media room, games room, kitchen stocked with snacks, and collaborative workspaces throughout the office. The neighborhood has gym facilities, coffee shops, and restaurants. Check us out at www.allocadia.com!Responsibilities:As a core part of our application development team, you will have responsibilities that include the following: Design and implement components and features for the Allocadia cloud-based service using Java and web technologies Ensure high quality of software through good development practices, including design and code reviews, unit testing, etc. Collaborate with team through issue tracking system (JIRA), Wiki, design meetings, etc.",
	"job_requirements" : "Qualifications: Pursuing a degree in Engineering or Computer Science or equivalent Strong Object-Oriented analysis, design and development skills Excellent Java programming skills Solid understanding of software development lifecycle Strong written and verbal communication skills Ability to prioritize & work in a deadline-driven environment Preference for students that qualify for NSERC Undergraduate Student Research AwardBeneficial Experience: Experience developing web interfaces using HTML5, CSS/Sass/Less, JavaScript/jQuery/AngularJS, AJAX, etc. Understanding of JDO, Spring Framework, Spring Security Comfortable with Eclipse IDEOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Allocadia",
	"division" : "Allocadia",
	"website" : "www.allocadia.com"
}