{
	"id" : "54188",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op: Service Portal System Developer (06B)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "3",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Co-op Student Position: Summer term (May to August 2015)Co-op: Service Portal System Developer&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No. of openings - 3This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or University.Join the team that's transforming the way the world communicates!!With operations in 130 countries, Alcatel-Lucent is the first truly global communications solutions provider, offering the most complete end-to-end portfolio of solutions and services in the industry. Our passionate and experienced team converts challenges into opportunities in the areas of third-generation mobile networking, metro optical and packet, circuit-to-packet, broadband access, advanced network and professional services, and next-generation operations support systems.Hires work on projects delivering custom network management software solutions to customers, as well as applications used by Alcatel-Lucent's engineering community.Our co-op students work alongside our senior programmers and testers, working on new features, fixing bugs, participating in team meetings, etc. Since our development cycles are generally in the 2-3 month range, our co-op students additionally benefit from seeing a software project through its entire lifecycle.This position is classified as web development, but the work is almost exclusively Java coding. In other words, we are looking for skilled Java programmers, not HTML/CSS/Javascript experts (although this is a nice-to-have secondary skill). Though our co-ops work primarily in the web tier, many show the desire and ability to work in the business logic tier using technologies such as JPA/Hibernate or coding directly with L2/L3 IP network entities.We have had dozens of co-ops placed with our team over the last few years, and their feedback is typically that they have gained an incredible amount of technical knowledge from their stay with&nbsp; us. We hire co-op students both to supplement our development team and to develop the skills of future programmers. In fact, a significant percentage of our former co-op students are now employees of Alcatel-Lucent.As well as the opportunity to work side-by-side with senior developers, testers and network specialists, co-op students have free access to a large, fully-equipped gym on campus. In addition to our gym, we have an on-site Tim Hortons and Quiznos with other restaurants and recreational facilities within walking distance",
	"job_requirements" : "QUALIFICATIONS:2nd year+ co-op student registered in a recognized Co-Op or Intern Program at a Canadian College or University; Engineering or Computer ScienceESSENTIAL:The ideal candidate has all of the following skills:• Excellent knowledge of software design principles (best practices, design patterns, etc.)• Excellent knowledge of Java• Familiarity with SQLOPTIONAL:The following skills are not mandatory, but experience in these will increase the attractiveness of your application;• Knowledge of the Spring framework.• Knowledge of Unix/Linux.• Shell scripting.• Excellent knowledge of HTML, CSS, XML, XSLT• Excellent knowledge of JavaScript and AJAX, particularly of the DOJO and JQuery frameworks• Experience designing and delivering rich web client interfaces• Understanding of principles of graphic and interaction design, experience with image manipulation• Experience developing Web 2.0 software features• Use of Selenium toolkit for automated testing of web interfaces• Implementation of web-based user interfaces using an MVC approach• Integration with enterprise systems (Lucene/Solr, Oracle/MySQL, LDAP, Single sign-on, etc)• Experience using the Eclipse IDE and Web Tools Platform• Familiarity with test-driven and agile development approachesAlcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability or members of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}