{
	"id" : "54191",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op: Software Designer (5620 SAM) (08G)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Coop Student Position:&nbsp; Summer Term (May - August 2015)Job Title: Co-op: Software Designer (5620 SAM)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Number of Positions: 2This position is limited to students that are registered in a recognized Co-op or Intern Program at a Canadian College or UniversityThe Network Management Business Unit in Alcatel-Lucent's IP Routing and Transport Division is recruiting highly motivated Software Developers. Our Team develops software solutions to allow our Customers to manage their networks:• The 5620 Service Aware Manager (SAM), proven with more than 400 deployments globally, delivers powerful capabilities that simplify operations of IP core, Wireless, and integrated IP/optical networks.• The 5650 Control Plane Assurance Manager (CPAM) is a multi-vendor route and path analytics solution. It is tightly integrated with the 5620 SAM to deliver unprecedented real-time visualization, surveillance and troubleshooting for dynamic IP/MPLS networks.Our products are built using various technologies, including:• Java, JBoss Application Server• Oracle 10g / 11g• Web application frameworks• Web technologies (HTML, Adobe - Flex, SOAP/XML)• Linux (Ubuntu, Red Hat), Solaris UNIXAs a Software Developer on our team, you will be challenged! The successful candidate’s responsibilities will include:• Designing and implementing features and enhancements for our Network Management applications.• Developing solutions to achieve Customer high-availability network requirements, while reaching defined scaled and performance targets.• Collaborating with Alcatel-Lucent Developers of the network devices to jointly define network management interfaces.• Working in a team-based Agile Environment; collaborate with Developers, Testers, and Product Management to refine requirements, develop, and test our Carrier grade solutions.• Interacting with Support Teams to provide software solutions to field-reported issues.",
	"job_requirements" : "ESSENTIAL SKILLS AND QUALIFICATIONS:• Degree in Computer Engineering or Computer Science• Solid understanding of Object Oriented Analysis and Design• Programming experience in Java• Knowledge/experience in Relational databases• Knowledge of network management concepts and basic protocols (e.g. SNMP).• Strong interpersonal and communication skills are required, both written and verbal• Demonstrated ability to learn quickly and to work in a fast paced, innovative environmentADDITIONAL ASSETS:• Experience with J2EE Application Server environment• Knowledge in IP networking, familiar with networking concepts such as Routing Protocols (ie OSPF, BGP), MPLS, IP VPN, VLAN, VLL/VPLS• Network Security Protocols• Scripting languages (ie. PERL)• Prior and demonstrated experience in a Software Development role• Knowledge/experience with Wireless or Optical Networking• Familiar with UNIX or LinuxAlcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability or members of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}