{
	"id" : "54193",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op: Customer Applications Engineer (IR9)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "5",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Co-op Student Position: May- August 2015 (Summer Term)Co-op: Customer Applications Engineer&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No. of positions - 5This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or University.Role Description:The Network and Services Management Technical Expertise Center (TEC) team is seeking highly motivated individuals to join our dynamic team in supporting Alcatel-Lucent’s industry leading network management platform 5620 SAM. Our team is also spearheading support of Nuage Networks’ Virtualized Services Platform, a leader in software-defined networking (SDN).Responsibilities:Applications Engineer – As a Tier 3 Applications Engineer, you will receive requests from teams all over the world. We receive and troubleshoot complex product issues that teams at Tier 2 (Technical Assistance Centers) and at Tier 1 (Call Centers) cannot solve. The team undertakes a broad range of challenges on a daily basis which leads to great learning opportunities and valuable career experience. You will need to make full use of your analytical and troubleshooting skills to identify the root cause of issues dealing with IP networking, Java programming, databases, and Linux/Unix platforms, just to name a few.Professional Services Delivery - We provide our customers with worry-free network turn-ups, network integration and consulting projects. We leverage our experience and expertise to deliver on-site installation and upgrades of all our software. As a coop, you’ll have the opportunity to perform remote service delivery.New Product Introduction - We work with the latest beta release of the products to stay current with new features and technology as they are added to our products. Since our network management platforms deal with end to end management of cutting edge technologies such as 4G/LTE, Optical Transport, IP/MPLS networking, and software-defined networking, this position is an excellent way to learn about new network technologies. If it is new and awesome, we get to do it first!",
	"job_requirements" : "Minimum Qualifications:Enrolled in bachelor's degree in Computer/Software/Electrical Engineering, Information Technology, Computer Science, or equivalent experience.Preferred Qualifications:We don’t require all of these, but the more you know the better!• Proficient with Solaris and/or Linux operating systems• Knowledge of IP/MPLS, routing and network protocols• Knowledge of Java programming concepts• Knowledge of database technologies and familiarity with SQL and Oracle• Knowledge of wireless protocols and architecture (3G/4G/LTE)• Ability to write scripts at a Unix/Linux level (bash, Perl, python, you pick!)• Strong hands-on experience in troubleshooting software or network problems.Alcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability or members of a visible minority group to applyOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}