{
	"id" : "54190",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op: Service Portal System Tester (06C)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "3",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Co-op Student Position: Summer term (May - August 2015)Co-op: Service Portal System Tester&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No. of openings: 3This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or University.As service providers strive to deliver a compelling array of innovative business, residential and mobile services to their customers, the optimization of their transport infrastructure plays a key role in ensuring profitability and a superior user experience. With market leadership in IP/MPLS networking, Alcatel-Lucent delivers leading-edge solutions to continually drive the user experience to new levels. As a co-op student, you will join a team that is revolutionizing communications, and you will help to create and support some of the most ambitious and innovative products in the telecommunications industry.As well as the opportunity to work side-by-side with senior developers, testers and network specialists, co-op students have free access to a large, fully-equipped gym on campus. In addition to our gym, we have an on-site Tim Hortons and Quiznos with other restaurants and recreational facilities within walking distance.This placement is for four months, with the possibility of an extension. If you have the talent, skill and passion, we want to hear from you!The Service Portal is a custom web-based application which leverages Alcatel-Lucent’s 5620 Service Aware Manager (SAM) to enable customers to easily provision, monitor and trouble shoot their 7x50 Service Router based IP networks. This is a hands-on technical role in a dynamic environment, working with end customers, developers, architects and product management to provide superior pre-deployment product verification and customer support.Specific responsibilities include:• Understanding and evaluating the overall SP solution (hardware, software, systems, networks) from multiple QA perspectives: performance, functional, usability, robustness, traffic throughput, quality of service and interoperability• Designing and constructing network test harnesses; provisioning and configuring networks to simulate live customer environments, including the addition of new or upgraded elements into the solution environment.• Designing and implementing manual and/or automated tests to validate the monitoring, provisioning and reporting protocols used in customer networks, from interacting with individual nodes within complex networks to providing feedback to the network operator via a customized GUI;• Acting as a customer advocate to identify, characterize, trouble shoot and evaluate fixes for defects that may impact the customer experience.• Planning, executing, tracking of all test and quality assurance activities for projects in an iterative delivery process, using judgment to strategically balance quality, schedule and cost.",
	"job_requirements" : "Qualifications:2nd year+ co-op student registered in a recognized Co-Op or Intern Program at a Canadian College or University; Engineering or Computer Science.The ideal candidate has some or all of the following qualities:• Some knowledge of networks and layer 2 & Layer 3 communication protocols• Basic familiarity with network management and OSS concepts and basic protocols.• Some knowledge of IP Networking familiar with networking concepts such as Routing Protocols (ie OSPF, BGP), DHCP, RADIUS AAA, MPLS, IP VPN, VLAN, VLL/VPLS, etc.• Ability to hit the ground running with skills in LAN/WAN network connectivity for lab setup and configuration• Proficient with UNIX• Exposure to automated test tools and building automated test scripts• The Able to successfully work in a team oriented environment• Demonstrated ability to learn quickly and to work in a fast paced, innovative environment• Excellent problem solving abilities, using critical thinking• Initiative, resourcefulness & conscientiousness• Strong verbal and written communication skillsAlcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability or members of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}