{
	"id" : "54192",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Co-op: Software Designer (SDN Controller) (08H)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "&nbsp;JOB TITLE: Co - Op Software Designer (SDN Controller) - 8 months&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No. of Positions: 1Alcatel-Lucent's IP Routing and Transport Division is recruiting highly motivated Software Developers to develop cutting edge products in Software-Defined Networking, a new technology space that is revolutionizing the way networks are managed and controlled. If you want to be a part of this next generation of networking then this is the place for you!As a Software Developer on our team, you will be challenged! The successful candidate’s responsibilities will include:• Designing, building, testing and deploying a new network element, started from the ground up.• Participating in the development and standardization of next-generation networking protocols.• Working in a team-based Agile Environment; collaborate with Developers, Testers, and Product Management to refine requirements, develop, and test our Carrier grade solutions.",
	"job_requirements" : "ESSENTIAL SKILLS AND QUALIFICATIONS• Solid understanding of Object Oriented Analysis and Design• Knowledge/experience in Relational and Graph databases• Knowledge in IP networking, familiar with networking concepts such as Routing Protocols (ie OSPF, BGP), MPLS, IP VPN, VLAN, VLL/VPLS• Knowledge of network management concepts and basic protocols (e.g. SNMP).• Strong interpersonal and communication skills are required, both written and verbal• The candidate must be able to successfully work in a team oriented environment• Demonstrated ability to learn quickly and to work in a fast paced, innovative environmentADDITIONAL ASSETS• Experience working in Agile development, Scrum Master experience• Experience with J2EE Application Server environment• Experience developing ReSTful interfaces• Knowledge of Continuous Integration and Continuous delivery methodologies and tools – e.g. Jenkins, Cucumber, Chef, Puppet, etc• Knowledge of web development/JS/CSS/HTML5• Knowledge of Network Security Protocols• Scripting languages (ie. PERL)• Familiar or proficient with UNIX/Linux OS and available shellsAlcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability and persons of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}