{
	"id" : "54202",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Co-op Student",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "19/hr to 26/hr",
	"frequency" : "Hourly",
	"company_type" : "Private Business",
	"job_description" : "Cover letter: Mr.&nbsp; Kelly GiesLocation: Vancouver, BCDuration: 4 monthsRelic Entertainment, a wholly owned studio of SEGA, is the award winning RTS developer of Homeworld, Dawn of War and Company of Heroes, among other games.&nbsp; Relic was founded on the premise that it is entirely possible to ship first class, genre altering, AAA titles, and have a life. Relic is based out of beautiful Vancouver, Canada, a city that has breath-taking mountain and ocean views, along with snowboarding and skiing, golfing year-round and amazing hiking trails. If you love games, enjoy working collaboratively with smart, creative people, and have diverse personal interests outside of work – you’ll enjoy our culture.Relic is looking for an Associate Programmer (Co-op) that sets the bar high for creativity and quality performance. The work term will be 4-months in duration with the possibility of being extended to 8 months.As an Associate Programmer, you will work on exciting challenges that complement your area of study while making the best RTS games around. We have exciting problems to solve in gameplay, AI, UI and graphics and are looking for engineers who are up for the challenge.",
	"job_requirements" : "You:&nbsp;1)&nbsp;&nbsp;&nbsp; Have finished at least two years of computer science and are at the top of your game.&nbsp;2)&nbsp;&nbsp;&nbsp; Have always wanted to work on cutting edge game development.&nbsp;3)&nbsp;&nbsp;&nbsp; Want to be a part of the next generation of RTS game development.4)&nbsp;&nbsp;&nbsp; Want to use this opportunity to demonstrate remarkable progress in your coop term to help you secure an awesome job in the game industry when you graduate.5)&nbsp;&nbsp;&nbsp; Have experience in one or more of C++, C#, Java, Graphics6)&nbsp;&nbsp;&nbsp; Have a cool project that you are already working on that you can show us.Relic:1)&nbsp;&nbsp;&nbsp; Will pair you up with a senior programmer at Relic.2)&nbsp;&nbsp;&nbsp; Will give you challenging real tasks that will impact our games3)&nbsp;&nbsp;&nbsp; Will provide you with the opportunity to see how the best game studio in the world makes games.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Relic Entertainment Inc.",
	"division" : "Vancouver"
}