{
	"id" : "54206",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op: Software Test Engineer (J3L)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "4",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Coop Student Position: Summer Term (May - August 2015)Job Title: Co-op: Software Test Engineer&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No. of Positions: 4This position is limited to students that are registered in a recognized Co-op or Intern Program at a Canadian College or UniversityThe Network Management Business Unit in Alcatel-Lucent's IP Routing and Transport Division is recruiting highly motivated Software Testers.Our Team develops software solutions to allow our Customers to manage their networks:•The 5620 Service Aware Manager (SAM), proven with more than 400 deployments globally, delivers powerful capabilities that simplify operations of IP core, Wireless, and integrated IP/optical networks.Our products are built using various technologies, including:• JAVA, JBoss Application Server• Oracle 10g / 11g• Web Application Frameworks• Web Technologies (HTML, Adobe - Flex, SOAP/XML)• Linux (RHEL), Solaris UNIX, Windows, Virtual MachinesAs a Software Tester, you will work on our core network management products as well as products and services which are critical to our engineering operations. You will become a member of our dynamic Test Engineering teams.Your responsibilities may include:• Development of scripts or applications (XML, Java, Perl, Python) to simulate various management activities and network scenarios• Development and execution of test plans to validate functional aspects of the product• Investigation of product defects encountered during test scenarios• Execution of tests and maintenance of regression and performance test beds, including publishing results and developing additional functionality",
	"job_requirements" : "Essential Skills and Qualifications• 2nd year+ Engineering or Computer Science co-op student registered in a recognized Co-Op or Intern Program at a Canadian College or University;• Strong programming skills (Java, Perl, XML, Python)• Ability to learn quickly and to work in a fast paced, innovative environment• Strong problem resolution skills• Knowledge of software and/or testing methodologies• Networking and telecommunications knowledge• UNIX operating environment (RHEL or Solaris), Windows, Virtual Machines• Knowledge of Routing Protocols (ie. OSPF, IS-IS, BGP, RIP), and MPLSAlcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability or members of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}