{
	"id" : "54207",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op: IP/MPLS Router Embedded Software Developer (J3P)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "4",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Co-op Student Position: Summer term (May - August 2015)Co-op: IP/MPLS Router Embedded Software Developer&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No. of position: 4This position is limited to students that are registered in a recognized Coop or Intern Program at a Canadian College or UniversityAs a student, you have lots of ideas to put to the test. At Alcatel-Lucent we will provide you with the opportunity to combine your ongoing academic pursuits with valuable, practical, hands-on experience.Join the team responsible for the most ambitious and innovative product family in the telecommunications industry including the Alcatel-Lucent 7950 XRS. If you have the talent, skill, and passion, we want to hear from you!Description:Several challenging real-time embedded C/C++ projects are available for students to contribute to the success of the 7750 service router product family.You will work with and learn from a team of experienced engineers responsible for development of the world's best IP/MPLS router.Focus on project work which can be completed in a term, building valuable skills and pride. Opportunities exist in every layer of software including:• Low level device programming• Operating systems• IP router control plane and data plane software• Software development toolsIf you surf the web, your packets are most likely forwarded over our carrier class router.",
	"job_requirements" : "Qualifications:Preferred program:• Computer Engineering, Computer Science, Systems Design, Electrical Engineering, or similar.Skills of interest:• C/C++, Perl, Web languagesAttitude and aptitude are more important than meeting specific experience criteria.Alcatel-Lucent is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability and persons of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}