{
	"id" : "54200",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Co-op: Malware Research Assistant (IRI)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Co-op Student Position for 8 months (May 2015 - December 2015)Co-op: Malware Research Assistant Number of openings - 2This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or UniversityTitle: Malware Research AssistantWe are looking for a co-op research assistant to join our Ottawa, Ontario malware research team. This is an opportunity for unique work experience in the burgeoning sectors of on-line security and networking. Working alongside highly motivated domain experts in a fast paced environment, you will be exposed to the latest tools and technologies used in malware research including: virtual environments for malware analysis; open source software; distributed systems and web applications. This is an opportunity to learn and to apply knowledge while making a real contribution with the rest of the team.Job Responsibilities:Students will be provided an opportunity to participate in the development process for our malware detection signatures. This will involve reviewing the detection signatures for accuracy and quality, running malware samples in a sandboxed environment, analyzing the network traffic generated by the malware and developing new detection signatures. The process covers malware targeting the Windows, Android and iPhone environments. In the first month, we will provide intensive training on the tools and systems used in this process.",
	"job_requirements" : "Skills:Candidates will have now or will develop skills in several of the following areas.• Experience in a Linux based software development environment• Experience in an Android software development environment• Experience with Object Oriented Design and Programming• Experience developing in one or more of C, C++, Java, PHP• Experience with database development using MySQL• Experience with and knowledge of TCP/IP protocols• Experience or knowledge of intrusion detection and prevention, malware analysis, anti-virus, firewalls and security information management systems• Ability to use knowledge to quickly master new technical areas• Ability to work in a small, dynamic team taking on different roles and responsibilitiesAlcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability and persons of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}