{
	"id" : "54201",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op: IP Routing Global Technical Support (IRK)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Co-op Student Position: Summer Term (May - August 2015)Co-op: IP Routing Global Technical Support&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No. of openings: 2This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or UniversityIP TAC Technical SupportRole Description:The IP Routing Global Technical Support Team is looking for Co-Op Students to work on Alcatel-Lucent’s industry leading IP Routers and Carrier Ethernet Switches in the role of Remote Technical Support.Responsibilities:• Remotely troubleshoot customer network issues on various IP Routing Products (includes 7750 SR, 7710SR, 7450 ESS, 7950 XRS, 7705 SAR and 7210 SAS)• Analyze router/switch event logs and alarms, packet captures, connectivity traces, etc. to isolate issues to a product• Interface with Global Technical Expertise Centers, Customer Account Teams, other Business Units, for technical consultation and customer support concerns• Debug complex product installations, resolves complicated product problems by applying both established procedures and creative alternatives• Enhance the capabilities to learn end to end solution/products of various customers• Maintain problem status and problem resolution records via ticketing system(s)• Prepare reports on problems encountered and methods of resolution applied ensuring overall system integrity and reliability• Maintain awareness of new features via training and cross train co-workers",
	"job_requirements" : "Minimum Qualifications:• Enrolled in Bachelor's degree in Computer/Software/Electrical Engineering, Information Technology, Computer Science Co-Op program.• Knowledge of communication protocols (SNMP, TCP/IP)Desired Qualifications:• Knowledge of mobility related solutions (LTE, Mobile Backhaul, SDN) is an asset.• Familiarity with various test equipment (IXIA, SmartBits, Landslide, etc). is desirable.• Working knowledge of IP Addressing/Sub-netting, Routing Protocols concepts, IP/MPLS is an assetPERSONALITY:• Has a “can do” attitude to persist in face of complex work to produce positive results• Excellent English verbal and written communication skills.• Must have outstanding time management skills, be able to handle multiple issues at the same time, and be able to prioritize those issues, so that we meet customer expectations.• Strong Interpersonal and organizational skills• Require to articulate technical issues / solutions to internal / external customers.• Self-motivated. Does not require constant 'oversight/assistance' to get jobs done.• Very Adaptable. Adapt to change quickly; Ability to learn new technology, products, processes, quickly, without formal training.Alcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability or members of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}