{
	"id" : "54205",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op: Software Tools Development (J2A)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Summer Co-op Term: May - August 2015Title: Co-op: Software Tools Development Position: 1This position is limited to students that are registered in a recognized Co-op or Intern Program at a Canadian College or University.Join the team that's transforming the way the world communicates.As a global leader in fixed, mobile and converged broadband access, carrier and enterprise IP technologies, applications, and services, Alcatel-Lucent offers the end-to-end solutions that enable compelling communications services for people at home, at work and on the move.The selected candidate will be responsible for software tools development, test automation in the 4G-LTE system.Preferably, develop software tools on smart phones.",
	"job_requirements" : "Qualifications:The ideal candidate should have experience in wireless domains (4G-LTE) with at least 1 plus years of good development experience using C++/Java in Linux/Windows operating systems. Smartphone development experience preferred. They should be a team player with good communication skills.• Third year university students in preferably Computer Science/Telecommunications program.• Must have: Linux, Apache/Web/html, MySQL, PHP (LAMP) skills.• Nice to have: iPhone and or Android Apps development skills; python scripting scripts.Alcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability or members of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}