{
	"id" : "54217",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Quality Assurance Analyst- Co-op",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Atimi Software Inc. is looking to add a QA Analyst to the team that wants a future career in Quality Assurance. Our ideal candidate is bright, eager to learn, and has a passion for breaking things! (not literally!). Your role is to poke holes in our code, find defects, and solve problems. If this sounds like your dream job and you want a foot in the door, then continue reading below!This position is suitable for a 2nd /3rd/4thyear UBC student who is seeking an 8-month coop term starting May 2015. Upon completing a successful 8-month coop with Atimi and graduating from your UBC Science or Engineering program, you may have a shot at a permanent and full time position in Atimi’s QA department working amongst the brightest QA Engineers, Developers, Designers, and Project Managers.PRIMARY RESPONSIBILITIESWrite and maintain test requirements and test cases.Code, test, and execute automated test scripts using prescribed scripting standards.Peer review test documentation and automated test scripts.Execute test cases and log results.Identify, diagnose, and report defects in all project deliverables (Software, documentation, etc.)Other duties as assigned.",
	"job_requirements" : "KNOWLEDGE AND SKILL REQUIREMENTSBasic reading, writing, and arithmetic skills required.Effective communication skills.Currently enrolled in at least the 2ndyear of a University Computer Science, Software Engineering, or other technical degree.Knowledge of company programming languages is desirable.Knowledge of QA techniques and methodologies is desirable.Ability to investigate and analyze information and to draw conclusions.Ability to work as part of a team, and also able to work autonomously.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"end_date" : "12/31/2015",
	"hours_per_week" : "0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):HOW TO APPLYIf you are serious about a career in QA and would love to work in the mobile application space, then please submit a resume and an awesome cover letter explaining why you are passionate about QA, and have what it takes to succeed at Atimi.WHY WORK FOR ATIMI?Simply put, because were awesome….but seriously though, we have a lot of fun. We have a relaxed and casual environment, flexible schedule, cheap vending machines, fresh fruit, 25 cent pop, ping pong table, team building activities, company events, and let’s not forget the cool projects for Fortune 1000 clients and the opportunity to work with some of the most talented team around! We are located right in front of the Burrard Skytrain station so your commute is very convenient so check us out at www.atimi.comto learn more about us!Company:Atimi Software Inc",
	"division" : "Vancouver office"
}