{
	"id" : "54214",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Junior Electrical Engineer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Midgard Consulting:Located in downtown Vancouver, Midgard Consulting provides consulting services to the energysector, electrical utilities, aboriginal peoples, and governments across Canada, United States,Africa and Asia.Role:As a junior engineer you will be integrated directly into a team of industry experts and challengedto contribute to Midgard’s widely ranging work. As part of a small company, you will have theopportunity to learn from, and interact daily with, Midgard principals and senior personnel. Day today activities include:•&nbsp;&nbsp; High voltage transmission design & interconnection, and transmission system modeling•&nbsp;&nbsp; Developing new electrical generation (Hydroelectric, Wind, Solar, Natural Gas)•&nbsp;&nbsp; Financial analysis and business case development of generation and transmission assets•&nbsp;&nbsp; Authoring long-term capital plans for utilities in Canada and abroadGiven Midgard’s smaller size, you would be an important part of many of Midgard’s ongoing projects,including technical work, background research, financial modeling, business development, projectreporting, and project management. Midgard provides exposure to a wide variety of disciplines in achallenging work environment to foster a rapid translation of your knowledge into practicalexperience as you work towardsyour P. Eng.&nbsp;",
	"job_requirements" : "Qualifications:•&nbsp;&nbsp; Must be working towards an electrical engineering degree, and be eligible to register as an EIT with APEGBC.•&nbsp;&nbsp; Preference will be given to candidates with a background in electrical power systems, controltheory, electromechanical systems and business / economics.•&nbsp;&nbsp; Must hold a valid Class 5 Driver’s License, be able to travel internationally, and pass acriminal background check and a credit check.Skills & Abilities:•&nbsp;&nbsp; Technical Expertise – Knowledge of electrical power system fundamentals.•&nbsp;&nbsp; Excellent Communication – The successful candidate will be a key contributor and, as such, arepresentative of Midgard. Excellent communication skills (written, verbal, public speaking) areessential. Must be social and have an aptitude for developing peer and client relationships.•&nbsp;&nbsp; Results Orientation – Able to confidently prioritize assignments and meet deadlines (dependableand reliable) drawing on colleagues for support and advice as needed.•&nbsp;&nbsp; Business & Commerce – Understanding of the fundamentals of business and economics.&nbsp; Workingwith the Midgard team is challenging and you must be eager to assume increasing responsibilitywhile learning the technical and economic fundamentals of the electric utility and energy business.•&nbsp;&nbsp; Project Management – Must be organized and be able to creatively find solutions to problems ina team environment. Must demonstrate the ability to take ownership of problems and see them throughto a successful resolution.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Midgard Consulting Inc.",
	"division" : "Head Office",
	"website" : "http://www.midgard-consulting.com/"
}