{
	"id" : "54210",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Co-op: Technical Support Engineer (Tier 4) (J27)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "IP Routing and Transport – Network ManagementCo-op: Technical Support Engineer (Tier 4)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Number of openings - 2The Network Management Business Unit in Alcatel-Lucent's IP Routing and Transport Division is recruiting for a highly motivated Technical Support Engineer to fill a role on the Tier 4 Support Team. This suite of products allows customers to effectively manage their IP, Wireless and Optical networks all over the world:• The 5620 Service Aware Manager (SAM), proven with more than 400 deployments globally, delivers powerful capabilities that simplify operations of IP core, Wireless, and integrated IP/optical networks.• The 5650 Control Plane Assurance Manager (CPAM)is a multi-vendor route and path analytics solution. It is tightly integrated with the 5620 SAM to deliver unprecedented real-time visualization, surveillance and troubleshooting for dynamic IP/MPLS networks.RESPONSIBILITES & ESSENTIAL JOB FUNCTIONS:As a Technical Support Engineer on our team, you will be challenged! The major responsibilities of the Tier 4 team include:• Investigating potential problems and issues raised by customers• Providing timely fixes for those problems via targeted incremental patches• Becoming a technical expert and technical focal point for the 5620 SAM & CPAM products• Improving the supportability of the 5620 SAM & CPAM products by implementing specific support focused featuresCANDIDATE REQUIREMENTS:Our development environment is primarily based on Java with Oracle and Cassandra databases. We are looking for someone with strong OO programming skills as well as a solid foundation in Unix/Linux environments. The successful candidate should have a mix of the following skills:• Experience doing technical level support or software design• Ability to work on multiple priorities and/or projects simultaneously• Strong problem solving abilities and the ability to meet deadlines",
	"job_requirements" : "REQUIRED SKILLS & QUALIFICATIONS:• Degree in Computer Engineering or Computer Science• Exceptional troubleshooting skills• Solid understanding of Object Oriented Analysis and Design• Programming experience in Java, C++• Knowledge/experience in Relational databases• A team player with the ability to build positive and collaborative relationships within the Support and Design communities at Alcatel-Lucent• Ability to work with minimal supervision• Demonstrated ability to learn quickly and to work in a fast paced, innovative environment• Knowledge of network management concepts and basic protocols (e.g. SNMP).ADDITIONAL ASSETS:• Strong scripting skills• Experience with the IntelliJ and/or Eclipse IDE• Prior experience in a Software Development role• Knowledge of / experience with IP, Wireless or Optical Networking• Familiar with UNIX or Linux• Knowledge in IP networking, familiar with networking concepts such as Routing Protocols (ie OSPF, BGP), MPLS, IP VPN, VLAN, VLL/VPLSWORK REQUIREMENTS:• Relaxed office environment• Core work hours are M-F, 9-5• After hours and/or weekends are sometimes requiredAlcatel-Lucent is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability and persons of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}