{
	"id" : "54215",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Electrical Engineering Students",
	"job_location" : "Mackenzie, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Mackenzie Pulp Mill Corporation has 4 month (May – August 2015) Co-op/Workterm opportunities for Electrical Engineering Students.&nbsp; You will work with medium & low voltage systems, process control equipment, PLC & DCS systems, project management - including planning, quality, scheduling and budget control, and maintenance troubleshooting.&nbsp;Mackenzie Pulp Mill Corporation is located in Mackenzie BC. &nbsp;The mill produces approx. 235,000 ADMT of bleached pulp per year and employs close to 275 employees on a continuous operating schedule.&nbsp; Mackenzie Pulp Mill Corporation is part of the Paper Excellence Group which owns and operates several mills in Canada, United States and Europe.&nbsp;Mackenzie is a community of nearly 4,000 and lies at the southern end of Williston Lake, in the Rocky Mountain Trench, 190 km north of Prince George, BC.&nbsp; Mackenzie is a friendly, family-oriented town offering excellent recreational opportunities, affordable housing and all amenities.&nbsp; At its doorstep is a network of trails and facilities for hiking, mountain biking, skiing, and all activities the mountains, rivers and wilderness can provide.&nbsp; We invite you to visit the District of Mackenzie web site at: www.district.mackenzie.bc.ca&nbsp;The mill offers a dynamic work environment and an attractive wage.&nbsp;If you are interested in experiencing a Co-op/work term with Mackenzie Pulp, and wish to expand you knowledge please submit your resume.",
	"job_requirements" : ".Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Paper Excellence",
	"division" : "Mackenzie Pulp Mill Corp",
	"website" : "paperexcellence.com"
}