{
	"id" : "54213",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Co-op: Software Designer (J35)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Summer Co-op Term: May 2015 - August 2015Title: Co-op: Software Designer (4 months or 8 months)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; No. of Position: 1This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or UniversityJoin the team that's transforming the way the world communicatesAs a global leader in fixed, mobile and converged broadband access, carrier and enterprise IP technologies, applications, and services, Alcatel-Lucent offers the end-to-end solutions that enable compelling communications services for people at home, at work and on the move.The DSC (Dynamic Service Controller) Engineering Services and Integration group in Alcatel's IP Platforms Division is seeking highly motivated Software Developers to join our team to develop custom subscriber management solutions for our customers.The solutions developed allow our customers to run policy solutions in their networks, used to manage everything from IPTV to IMS services.Our Software Developers duties include:• Interact closely with the other developers and solution architects to jointly define solutions to address the customer use cases.• Work with the Solution Architects to understand and refine custom software requirements.• Design and code software to meet the functional requirements.• Work with the Quality Assurance team to fix defects and ensure a high quality product.Our products are built using various technologies, such as:• Java• Web Services (Soap, XML)• Web application frameworks• Web technologies (HTML, Javascript)• Scripting (Perl, Bash & Python)• Our products are highly-scalable carrier grade products with a multi-threaded and distributed design.",
	"job_requirements" : "Qualifications:3rd year+ co-op student registered in a recognized Co-Op or Intern Program at a Canadian College or UniversityComputer Science, Electrical, Computer or Software Engineering.EssentialThe ideal candidate has some or all of the following qualities:• Excellent communication skills and the ability to work well in a close-knit team• Strong knowledge of Java• Relational databases• Understanding of IP networking• Understanding of networking concepts and basic protocols (e.g. SNMP, Diameter, RADIUS).Desired• J2EE Application Server environment, preferably JBoss• Unix/Solaris knowledge• Scripting languages• Routing Protocols (OSPF, IS-IS, BGP, RIP)• MPLS (RSVP, LDP)• IP VPN, VLAN, VLL/VPLS, BRAS, etc.• Oracle• Web Technologies• RADIUS AAA. 802.1x• Experience with DSL and DSLAM technology• Network security protocolsAlcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability or members of a visible minority group to applyOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}