{
	"id" : "54218",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Junior QA Engineer (Co-op)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "SAMSUNG IS THE FUTURE… JOIN US!Do you believe in the power of technology to help shape a brighter future and a stronger global community? Are you inspired by the possibilities? Are innovation, camaraderie, and the pursuit of excellence part of your innate drive? Then you've got what it takes to succeed at Samsung.Samsung is making big steps into enterprise mobility with a wide range of device and SW solutions. With the recent launch of Samsung KNOX™, we are now looking for experienced and talented individuals for our Vancouver lab to design, develop, operate and support these new solutions in the global market.&nbsp;Location:Burnaby, British ColumbiaJunior QA Engineer (Co-op)Samsung is looking for an enthusiastic engineering/computer science co-op student to join the Samsung Technical Operations team. The newly formed team is very agile and you will be given the opportunity to create systems from the ground up. This candidate will work on the latest mobile technologies and devices.&nbsp;Project DetailsUsing tools such as Selenium and SoapUI, you will be responsible for developing, documenting and performing testing of our enterprise infrastructure.You will also be responsible for creating and maintaining automated test scripts of both internal and external services to determine system statuses.The goal of this project is to ensure systems are built and functional at optimal capacity through development of functional and automated testing.Experience with Rest API and SOAP UI would be an asset to this project.&nbsp;Samsung is an equal employment opportunity employer.We thank you for your interest in working for Samsung, only candidates selected for an interview will be contacted.",
	"job_requirements" : "QualificationsPursuing a Bachelor’s or Master’s degree in Computer Science or EngineeringProficient in Python and/or Java will be consideredAbility to work in a team environmentExcellent proficiency in oral and written EnglishAttention to detail and a commitment to qualityMust demonstrate a strong trait of technology focused curiosityDemonstrated multi-tasking and organizational skills in a rapidly changing environmentStrong interest in mobile technologyDemonstrated IT admin experience in a previous position&nbsp;Preferred Skills:Software testing methodologies;&nbsp; Experience in developing formal test casesLinux kernel / Android platform development experienceSelenium and/or Soap UI automation development experienceNetwork programming and/or network administration are assetsKnowledge of best practices for secure product development and testing&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Samsung Electronics Co. Ltd.",
	"division" : "Burnaby"
}