{
	"id" : "54220",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Customer Support, Technical Writer (Co-op)",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "SAMSUNG IS THE FUTURE… JOIN US!Do you believe in the power of technology to help shape a brighter future and a stronger global community? Are you inspired by the possibilities? Are innovation, camaraderie, and the pursuit of excellence part of your innate drive? Then you've got what it takes to succeed at Samsung.Samsung is making big steps into enterprise mobility with a wide range of device and SW solutions. With the recent launch of Samsung KNOX™, we are now looking for experienced and talented individuals for our Vancouver lab to design, develop, operate and support these new solutions in the global market.Location:Burnaby, British ColumbiaCustomer Support, Technical Writer (Co-op)Our Samsung KNOX Customer Support team is looking for a Technical Writer to help design, develop, and maintain customer-facing product documentation for our latest solutions in mobility, security, and cloud services.Essential Duties and Responsibilities:Design, develop, and maintain Samsung KNOX product documentation, which might include user guides, online help, FAQs, and knowledge base articles related to Android, security, mobile app development, and cloud services.",
	"job_requirements" : "QualificationsPursuing a Bachelor’s or Master’s degree in Communications, English, Writing, Computer Science or EngineeringExcellent proficiency in oral and written EnglishStrong interest in mobile devices and technologiesAbility to understand new and complex technologies quicklyAbility to explain highly complex concepts in plain EnglishAbility to understand the customer experience, their issues and point of viewProblem solving skills, ability to find the root cause of customer issuesDemonstrated ability to multi-task in a rapidly changing environmentOrganized, with a strong attention to detail, and a commitment to qualityAbility to work on a global team&nbsp;Preferred Skills:Experience in Technical Writing in a professional environmentExperience with MS Office, HTML authoringKnowledge of Java or C/C++ programming, or Android mobile app development is a big plusKnowledge of mobile device deployment using MDM tools is also a big plus&nbsp;Samsung is an equal employment opportunity employer.&nbsp; We thank you for your interest in working for Samsung, only candidates selected for an interview will be contacted.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Samsung Electronics Co. Ltd.",
	"division" : "Burnaby"
}