{
	"id" : "54222",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 or 12 months",
	"job_title" : "Cyber Security Systems Engineer Co op",
	"job_location" : "Calgary, AB",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "COMPANY DESCRIPTION&nbsp;At General Dynamics Canada, innovation happens on a daily basis.&nbsp; We develop and deliver leading edge technology, products and systems that make important contributions to our customer’s success.&nbsp; The challenges and opportunities are endless.&nbsp; The results – incredible!&nbsp;Our employees are exceptional!&nbsp; GD Canada is proud to employ over 1700 talented individuals across Canada.&nbsp; Working in a collaborative team environment, our employees are encouraged daily to contribute their technical knowledge and expertise. Our people are passionate, dedicated, and conscientious about the work they do, which results in our ability to deliver the highest value, customized solutions in order to meet the most demanding requirements.We provide technology-based electronic systems, systems integration and in–service support to defence organizations and public security markets in Canada and abroad.As Canada’s largest and most established defence systems integrator we have the capacity to take on multi-year projects of strategic national significance, scope and scale, and deliver cost-effective, mission-critical systems. Additionally GD Canada is a leading worldwide supplier of innovative solutions for land, airborne, maritime and cyber applications. Our global success stems from our strong system engineering experience, ongoing investment in research and development, collaboration with commercial and military systems industry leaders, and a singular focus on customer service.GD Canada has maintained a business leadership position in complex technology areas such as rugged displays, fire control systems, maritime sensor data analysis, secure communications networks, command and control, platform installation / integration and through life support. Just to name a few.The General Dynamics Canada Co-op Program is designed to develop the awareness, skills and desire of the best and brightest young professionals who may ultimately become a part of our team and our sustainable future. Job DescriptionAre you interested in beginning your career path as an information systems security professional?&nbsp; The cyber security field is rapidly evolving with an ever-growing need for talented individuals.&nbsp; There are numerous paths to gaining entry into this field as a career such as networking security, physical security, application and database security, security testing and auditing and disaster recovery and business continuity.&nbsp; At GD Canada, using the key tenets of Confidentiality, Integrity, and Availability you have the chance to get involved in all these paths on your way to becoming a Cyber Security professional.&nbsp;As an entry level Cyber Security practitioner, you will work alongside a number of security professionals to assist in providing state of the art security solutions for the Canadian government as we strive to make their communications networks the best they can be.&nbsp; Your work will allow you to be engaged with some of the most demanding and exciting commercial and military technologies in the security environment.&nbsp;Typical DutiesThe responsibilities of the awarded candidate will include:Become familiar and assist with security vulnerability analyses and security patch management in a complex network;Perform vulnerability testing and analysis of various operational environments;Perform security test and evaluation in support of system accreditation;Learn and establish an understanding of the interconnected components of the networked lab environment;Assist in producing technical and analytical documents required to support security related activities;Learn and establish an understanding of security controls and profiles, and how to apply them to requirements and design development; andContinue to grow as an aspiring passionate information security professional.",
	"job_requirements" : "EXPERIENCEAbility to work effectively both independently and in a team environment, with minimum supervisionStrong written and verbal communication skillsStrong analytical and problem solving skillsFamiliarity with aspects of TCP/IP networkingFamiliarity with ISC2 and the 10 domains of the Certified Information Systems Security Professional would be an asset&nbsp;EDUCATIONCurrently pursuing a Bachelor’s degree in Computer Security, Engineering, Computer Science, or equivalent&nbsp;SECURITYApplicants will be required to obtain/hold a valid and current Canadian security clearance to gain access to the classified spaces, information and equipment in order to perform the work associated with this position which requires a minimum 10 year consecutive residence in Canada.&nbsp;&nbsp;WHAT’S IN IT FOR YOU?Highly-complex programs, projects, and products that make a difference around the worldFlexible work environment with a dynamic and diverse team environmentHighly competitive compensationRelocation assistance for out of province students&nbsp;The only limits are those you set for yourself…Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "General Dynamics",
	"division" : "Alberta",
	"website" : "www.gdcanada.com/"
}