{
	"id" : "54236",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op Student 2015-05-MDA-RCM-GS",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "The Project:MDA is developing Canada’s next generation Synthetic Aperture Radar (SAR) earth observationsatellite constellation, known as the RADARSAT Constellation Mission (RCM). The RCM Ground Segmentcomprises the ground based systems which&nbsp; support the launch, commissioning and operation of thesatellite constellation. The Ground Segment will be developed by an integrated team from MDAoffices at Halifax NS, Richmond BC and St. Hubert QC.The Position:This position will be focused on software development (25%) and system configuration andintegration (75%). Travel toHalifax for 1-2 weeks closer to the end of the term may be required.&nbsp;",
	"job_requirements" : "Experience and Skills Required:Must have the following:•&nbsp;&nbsp;&nbsp;&nbsp; Appreciation&nbsp; for&nbsp; the&nbsp; value&nbsp; of&nbsp; well-written&nbsp; build&nbsp; books&nbsp; and&nbsp; run&nbsp; books&nbsp; in&nbsp; the &nbsp;context&nbsp; of&nbsp; system administration•&nbsp;&nbsp;&nbsp;&nbsp; Ability to write build books and run books•&nbsp;&nbsp;&nbsp; Appreciation for the value of “reading the manual” when installing and configuring software•&nbsp;&nbsp;&nbsp; Basic understanding of computer system access control mechanisms•&nbsp;&nbsp;&nbsp; Some experience developing software and thus with some insight into the value of modularorganization of source code•&nbsp;&nbsp;&nbsp; Basic appreciation of the value of configuration management when developing a system•&nbsp;&nbsp;&nbsp;&nbsp; Ability and willingness to travel for modest duration (up to 2 weeks) near the end of theco-op term (notionally August 2015) to Halifax, NS•&nbsp;&nbsp;&nbsp;&nbsp; Self-reliance, resourcefulness, can-do attitude, willingness to learn (can’t depend on havingeverythingspelled out for them in advance)&nbsp;Valuable to have:•&nbsp;&nbsp;&nbsp; Basic understanding of concepts of policy-based network routing•&nbsp;&nbsp;&nbsp;&nbsp; Actual&nbsp; experience&nbsp; installing,&nbsp; building&nbsp; and&nbsp; configuring&nbsp; open&nbsp; source&nbsp; and&nbsp; COTS &nbsp;software&nbsp; in&nbsp; a&nbsp; Linux environment•&nbsp;&nbsp;&nbsp; Basic knowledge of asynchronous messaging technologies used on an enterprise environment (JMSand similar technologies)•&nbsp;&nbsp;&nbsp; Basic knowledge of secure file transfer protocols used in an enterprise environment (SFTP,FTPS)•&nbsp;&nbsp;&nbsp; Basic knowledge of various enterprise authentication methods (passwords, certificates, etc.)•&nbsp;&nbsp;&nbsp; Basic knowledge of PKI (public key crypto, X.509 certificates, private key storage)•&nbsp;&nbsp;&nbsp;&nbsp; Hands-on&nbsp; experience&nbsp; integrating&nbsp; applications&nbsp; with&nbsp; various&nbsp; enterprise&nbsp; infrastructure &nbsp;services&nbsp; including syslog, active directory•&nbsp;&nbsp;&nbsp;&nbsp; Knowledge of regular expressionsComments/Special Considerations:Successful candidate(s) must be able to obtain and hold security clearance at the Reliabilitylevel, and pass securitysessment for the Controlled Goods Program.&nbsp;&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "MDA Corporation",
	"division" : "Corporate Headquarters"
}