{
	"id" : "54237",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Web Developer",
	"job_location" : "Victoria, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Job Title: Web DeveloperDepartment: Business SystemsReports To: Director of TechnologySUMMARYThe primary duty and responsibilities of this position will be to develop data-driven external and internal business systems, including web sites, web services, reporting tools and certainly some cool projects. This position requires experience with web and database development environments. It also requires excellent communication and analytical skills to work with internal customers and other members of the team to design, develop and deploy solutions. Our co-op students have a track record for high performance, teamwork, and the ability to succeed. Joining our team will allow you to develop professional skills and have fun, while getting a head start on your career.",
	"job_requirements" : "1. KNOWLEDGE, SKILLS, AND ABILITIES● Experience with Linux, Apache, MySQL and PHP.● Experience with web services – REST/XML/JSON/SOAP● Experience with HTML5, CSS, JavaScript, Python● Experience with Puppet/Chef/Phing/Composer a plus● Ability to multi-task, work independently and as part of a team● Strong understanding of software development methodologies and principles, including design patterns and re-usability● Strong oral and communication skills2. DESIRED SKILL/EXPERIENCE● BSc in Computer Science, or diploma and equivalent work experience● 1+ years software development in a corporate environment● 2+ years of Web site and/or database administration an asset● 1+ year using Web Frameworks (Symfony/Symfony2 a plus)● Comfortable in Unix environments● Experience in eCommerce systems a plus● Personal coding projects/open source contributions a plusKEY COMPETENCIES● Analytical Thinking: Tackle problems by using a logical and systematic approach.● Technical Expertise: Demonstrate depth of knowledge and skill in a technical area.● Results Orientation: Focus on the desired result, setting challenging goals, and always looking to meet or exceed them.● Delivery: Strive to deliver projects on time with minimal supervision and maximum attention to detail.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "ACD Systems International Ltd.",
	"division" : "Business Systems",
	"website" : "www.acdsee.com"
}