{
	"id" : "54235",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Systems Development - Programmer",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"industry" : "Government - Provincial",
	"company_type" : "Federal Government",
	"job_description" : "The Statistics Canada Work EnvironmentThe breadth of opportunity at Statistics Canada is remarkably varied.&nbsp; As a student intern with the Informatics Branch, you will work closely with a dynamic team of IT professionals and subject matter specialists to design, develop, and test systems.&nbsp;Statistics Canada is located in the park like setting of Tunney’s Pasture in Ottawa right on the Ottawa River, five minutes from downtown.&nbsp; It is conveniently located on the main transitway and is therefore easily accessible by public transit.&nbsp; Team building events take place throughout the year and include such activities as a summer charity soccer tournament, lunch outings to nearby restaurants, summer BBQs, and Christmas events.&nbsp;What you will be doingStatistics Canada offers a range of opportunities in system development.&nbsp;&nbsp; The Statistics Canada technology stack includes a variety of programming languages, frameworks, and database management systems.&nbsp; As a student intern you will be responsible for the analysis, design, implementation, and testing of systems all while being supported by a Project Leader or Senior Analyst/Programmer. Whether it’s developing software or database solutions, delivering technical support services to our users, or supporting our census or survey operations, you'll be making a difference and gaining an invaluable experience!",
	"job_requirements" : "Who are we looking for?High caliber university students enrolled in Computer Science, Computer Engineering, Software Engineering, or Information Systems with a minimum 2 years completed, who have a solid background in programming, testing, and database management systems.&nbsp; Preference will be given to students who are able to work an 4-16 month internship.&nbsp;Desired Skills and Knowledge:Sound programming expertise in object-oriented programming languagesKnowledge of systems analysis and design conceptsKnowledge of database conceptsKnowledge of problem-solving techniquesCompletion of at least one object-oriented programming course by the time the position startsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:37.5",
	"application_receipt_procedure" : "Online via system",
	"company" : "Statistics Canada",
	"division" : "Management Services and Informatics"
}