{
	"id" : "54233",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "January 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Kelowna Director",
	"job_location" : "UBC Okanagan, Kelowna, BC",
	"number_of_positions" : "1",
	"salary" : "11,200",
	"frequency" : "Yearly",
	"company_type" : "Non-Profit Organization",
	"job_description" : "For the past four years Geering Up has offered camps and workshops in Kelowna. We wish to significantly grow our impact and reach in the Kelowna community, offering a wider range of workshops and camps.&nbsp; In collaboration with the Vancouver based Co-Directors and the Geering Up Board of Advisor the Kelowna Director will help us bring more STEM programming the youth in Kelowna and surrounding communities.The position of Kelowna Director is new as of this year. In the past programming in Kelowna was looked after by a the Vancouver based Outreach Coordinator.Geering Up Directors are responsible for the success of the program. Directors perform a variety of&nbsp;tasks as listed below. There is a steep learning curve for those entering the position. Support and&nbsp;mentoring are provided by the Faculty of Applied Science, Vancouver based Directors, and the Geering Up Board of Advisors.Under the guidance of the Vancouver based Co-Directors, the Kelowna Director is required to coordinate the operation, and manage of the program. They will be providing vision, leadership, and direction while managing a budget of approximately $50,000. There are more detailed descriptions on the website.The role of a Co-Director is a highly rewarding experience, with a great deal of responsibility. Being a Co-Director is time-consuming, and can be stressful at times. It is a large commitment, but it is worth the investment. Not only are you making a difference in your community, but also you are running a small business. The skills you learn are invaluable, you become connected to a national network of like-minded people, and the memories you make you will treasure forever. It is very rare that&nbsp; an undergraduate student can obtain a position with this level or responsibility, and the position will leave you well prepared to take on managerial roles elsewhere.Note: This job is part-time (15-25 hours) until April and full-time (45+ hours) starting May.All information is on the website.",
	"job_requirements" : "&nbsp;- Must be a UBC undergraduate student interested in designing creative science and engineering based projects, passion for promoting and teaching science and engineering to children;&nbsp;- Strong communication skills including fluency in English;&nbsp;- Excellent teamwork skills;&nbsp;- Ability to handle responsibility and work under pressure;&nbsp;- Strong computer skills, including ability to quickly learn how to use new software;&nbsp;- Strong organizational skills, especially in scheduling, time-management, record-keeping, and logistics;&nbsp;- Self-motivated work attitude, ability to consistently meet deadlines;&nbsp;- Willing to obtain a Criminal Record Check and fulfill other training requirements, including but not limited to First Aid and Food Safe.Other assets listed on the website.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:02/05/2015",
	"end_date" : "08/28/2015",
	"hours_per_week" : "45",
	"application_receipt_procedure" : "Employer Website",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Resume, Cover Letter",
	"if_by_website,_go_to" : "www.geeringup.apsc.ubc.ca/staff",
	"company" : "GEERing Up! UBC Engineering & Science for Kids",
	"division" : "GEERing Up! UBC Engineering & Science for Kids",
	"website" : "www.geeringup.apsc.ubc.ca"
}