{
	"id" : "54238",
	"application_deadline" : "Apr 30, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Associate Benchmarking Engineer",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "About Us:Teradici PCoIP® technology is the fabric of the virtual workspace. We power the spectrum of local, remote, mobile and collaborative work-styles, fundamentally simplifying how computing is provisioned, managed and used.Our technology is deployed throughout virtual and cloud environments, in zero clients, hardware accelerators, standalone workstations and mobile devices. Simple, green, and cost-effective, the Teradici PCoIP virtual workspace architecture delivers a secure, high-definition, highly responsive computing experience.&nbsp;Teradici customers benefit from a broad PCoIP ecosystem of innovative products and services. Our customers include Fortune 500 enterprises and institutions around the world, local and federal government agencies, and cloud and service providers.Overview:We are looking for&nbsp;energetic coop student(s)&nbsp;(Engineering or Computer Science) to join our Benchmarking team. This is an exciting opportunity to participate in the development and testing of our PCoIP family of products, as we shape the way desktops are delivered in the enterprise.&nbsp; Tasks may include a mixture of benchmark planning, benchmarking automation and benchmarking test execution on upcoming releases of PCoIP products as well as comparisons with competitive solutions like Citrix ICA/HDX and Microsoft RDP/RemoteFX in complex virtual desktop environments under a variety of networking conditions.Responsibilities:One or more of the following projects may be available:Creation of benchmarking scripts to enable repeatable benchmarking workloads.Automation of benchmark setup and execution as well as benchmark data collection and presentation.Ongoing improvement of an automated benchmarking environment, including developing Python-based configuration, capture, analysis and presentation tools.Development of new benchmarking tools using Python and/or C languages.Execution of benchmarking tests to assist engineering in evaluating PCoIP product improvements and perform competitive comparisonsHelping to manage and upgrade our benchmarking lab and overall benchmark environment.",
	"job_requirements" : "Requirements:Students who have completed at least 2 academic years.The ideal candidate has some experience with scripting languages such as Python, Ruby or TCL; familiarity/experience with Linux; as well as some experience in testing software including writing bug reports, test cases, test plans and test reports.Experience with Networking, Desktop Virtualization and Windows System Administration concepts are also assets.Other Information:Please note:&nbsp;Include the latest copy of your unofficial transcript in the same document as your resume&nbsp;4 or 8 month (preferred) work termStart date: May 2015Full-time with possibility of extension and/or permanent career positionsPerks:Luxury shuttle service to the nearest SkyTrain station.Underground and secured bike cage.Fully equipped onsite gym, and Basketball and Beach Volleyball courts. Or you can join our corporate soccer team.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.jobscore.com/jobs2/teradici/associate-benchmarking-engineer-summer-co-op-term/dmdxtWMgar5ivwiGalkWKP?ref=rss&sid=68",
	"company" : "Teradici",
	"division" : "Main",
	"website" : "http://www.teradici.com"
}