{
	"id" : "54246",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Research/Engineering Assistant",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "2500",
	"frequency" : "Monthly",
	"industry" : "Manufacturing/R&D - Medical Devices",
	"company_type" : "Private Business",
	"job_description" : "LightIntegra is a growing small company developing ThromboLUX, a medical device that analyzes platelet products prior to use. Platelets are a key component of blood, and are necessary for clotting; however a significant portion of platelet transfusions are ineffective due to low-quality platelets. ThromboLUX will be the first point-of-care device that makes a rapid determination of platelet quality. The results can lead to reductions in ineffective transfusions, improvements to patient outcomes while lowering health care costs. Please feel free to read more about our technology at www.lightintegra.com.LightIntegra regularly employs an Engineering or Science Co-op student to assist with the development of our technology. Because we are a small company, you will wear many hats, and be closely involved in our research and development activities. The specific nature of the work varies from term to term, but students are guaranteed opportunities to get involved in many aspects of the project.You may receive hands-on experience in• &nbsp; Design, implementation, and analysis of non-trivial tests plans and investigations• &nbsp; Development or refinement of existing manufacturing and quality processes• &nbsp; Documentation in a medical devices environment• &nbsp; Alignment and rework of key systems• &nbsp; Engineering design and prototyping (mechanical, electrical, etc)",
	"job_requirements" : "We are looking for a student with• &nbsp; At least one co-op work term under their belt• &nbsp; Good English verbal and written communication skills• &nbsp; Great organization skills and attention to details• &nbsp; An ability to work effectively both independently and as part of a multi-disciplinary team.• &nbsp; Unrestrained curiosity and willingness to tackle complex challengesStudents with demonstrated experience or interest in medical technology development will receive higher consideration.The student must be available for an 8 month work term; however we are willing to hire students who are available for a longer period.Open To All Majors:Yes",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "LightIntegra",
	"division" : "LightIntegra"
}