{
	"id" : "54240",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Junior Engineering Co-op",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "We are looking for a talented, enthusiastic Junior Engineering Co-opto join us for the Spring co-op term for either 4, or 8 months.&nbsp;As a Junior&nbsp;Engineer on the Product team&nbsp;at Mobify, you’ll help build the software that powers our platform: our Web Performance Optimization Services, Cloud Network and Customer Dashboard.&nbsp;Our agile teams focus on continuously delivering value to our customers. A combination of feature flags, code review, continuous integration coupled with a preference for iterative changes allow us to immediately push new code to production. We ship everyday.You should have built, launched and supported web products. Our systems have high requirements for uptime, scalabilityand most importantly, speed!ResponsibilitiesDelight customers by shipping awesome productCreate and maintain scalable, fault tolerant codeDiscuss, debate and dream with the team about how to improve what we do",
	"job_requirements" : "YouHave shipped something you are proud of!Are a great developer, or are willing to put in the hard work to become oneHave a deep understanding of a modern web programming language. We use Python and JavaScript for our day to day, but specific experience in these isn’t a requirementBelieve in the web, open source, and making stuff really, really fastBonus PointsContribute to open sourceprojects - show us in your application!Maintain a personal or community website, portfolio or side projectYou’ve worked in a SaaS company beforeAbout UsMobify (www.mobify.com) is the mobile commerce platform of choice for leading Fortune 500 companies and drives hundreds of millions of dollars of revenue across web, apps and in-store every year.Our technology empowers marketers and developers at companies like Crocs, Starbucks, ideeli, Leading Hotels of the World, British Telecom and Beyond the Rack to deliver phenomenal mobile experiences that surprise and delight their customers.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.jobscore.com/jobs2/mobify/junior-engineer-co-op/d65XPKMBOr5imGiGaltGfR?ref=rss&sid=68",
	"company" : "Mobify Media",
	"division" : "Mobify Media",
	"website" : "www.mobifymedia.com"
}