{
	"id" : "54244",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Engineering Co-op Student",
	"job_location" : "Downtown Vancouver",
	"number_of_positions" : "1",
	"salary" : "3040",
	"frequency" : "Monthly",
	"industry" : "Manufacturing/R&D - Power/Energy/Fuel Cells",
	"company_type" : "Private Business",
	"job_description" : "Instream Energy Systems develops and deploys scalable vertical axis hydrokinetic turbines (VAHTs) to efficiently convert the kinetic energy in moving water into cost-competitive, renewable electricity with minimal environmental impact.Instream Energy Systems is a growing company in an exciting industry. Beyond the life less ordinary factor of working with a true renewable energy pioneer, it’s the day to day of working at Instream that really makes it a great opportunity.First and foremost, our people are motivated, talented, passionate and friendly. From there, it’s about the variety of work and exposure to several different functions. Our goal is that no one working at Instream will be bored or complain about having to do the same thing over and over again. In addition, employees have the opportunity to do unique work and meet interesting people.&nbsp;Last but not least, we provide a relaxed, high performance office environment that supports collaboration and creativity.&nbsp;We are currently seeking a self-motivated Engineering Co-op Student who has a passion for renewable energy. In this role, you will assist the Engineering & Technology department with research, analysis, project and product development, testing and documentation. In addition to the required qualifications outlined below, our successful candidate will have a firm grasp of general electrical design and power systems. Preference will be given to Electrical, Mechatronics or Power Systems Engineering students.Responsibilities and Expectations&nbsp;• Document and support systems and product development activities• Work with modern automated control systems and power electronics• Support upgrades to legacy power system field installations (hardware and software)• Configure and perform power electronics system tests• Manage and analyze test data• Communicate and work with suppliers and internal staff• Ability to travel to our test facility in Yakima, WA",
	"job_requirements" : "Requirements & Experience• Must have completed 3rd year engineering• Firm grasp of general circuitry and power production• Comprehensive working knowledge of MS Office with strong Excel skills&nbsp;&nbsp;• Strong organizational skills; project development (i.e. managing the logistics behind a project) is an asset&nbsp;• Motivated with a “self-starter” approach• Excellent interpersonal skills; approachable and friendly with the ability to respectfully collaborate with co-workers at all levels• Strong written and verbal communication skills• Ability to maintain a high level of accuracy and attention to detail with high standards for quality• Flexible, ‘can-do’ attitude and customer service orientation• Ability to travel to Yakima, WA; estimated trip frequency once every 2 – 3 months with typical trip duration of 5 days (could be more or less to meet needs of the business)• Eligible and willing to apply for an NSERC IUSR AwardEducational Assets• The following education and experience are assets:o Controls & automation coursework / experienceo Electrical systems including motors, generators, and other power conversion technologies.o Renewable energy technologyo Product development experienceo Testing experienceo Programming of microcontrollers and PLC systemso Installation and use of analog sensors and data acquisition equipmento Foundation in fluid dynamicsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaster of Software SystemsMaterialsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:37.5",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):If you are motivated, talented, have a passion for learning and are inspired by a life less ordinary, we would like to hear from you.To learn more about Instream Energy Systems, please visit our website at: http://instreamenergy.com/Company:Instream Energy Systems",
	"division" : "Engineering & Technology",
	"website" : "http://instreamenergy.com/"
}