{
	"id" : "54241",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Junior QA Engineer (Co-op)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Mobify is seeking Junior QA Engineer Co-opto join us for the spring Co-op term for either 4, or 8 months. The Junior QA Engineer Co-op will be part of&nbsp;our growing Customer Success Team, a group of young and ambitious individuals responsible for the development and roll-out of the Mobify platform for our premium customers. This is bleeding edge work for some of the biggest and most recognized brands in the world. &nbsp;As a key member of the team, you'll test the mobile and tablet websites we build for our amazing customers. You will have final say on whether projects meet Mobify's high standards for quality and excellence and be involved in each step of the process from planning to launch.ResponsibilitiesTest multiple projects while applying standard QA proceduresReport clear and detailed issues to the teamCollaborate with cross discipline teams to ensure amazing experiences across a wide range of devices (using our exhaustive device library)Provide feedback to improve development and testing practicesHelp to maintain the quality of our existing customers' websitesPlanning, writing, and maintaining large suites of automated tests",
	"job_requirements" : "YouHave some previous&nbsp;experience in a Quality Assurance role and are familiar with end-user testing (web or mobile web experience preferred)Previous experience in a UNIX environmentExperience with browser automation frameworks, such as Selenium WebDriverExperience working with a version control system ex. GitHub or SVNExperience testing on a variety of mobile devicesPossess an eye for detail, take pride in your work and are eager to learn new skillsAre great at working with different teams and can juggle multiple projectsHave a passion for&nbsp;mobile&nbsp;Are a great communicatorBonus PointsExperience working in the DOMExperience with JavaScript and Node.jsActive on Github, blogs, Twitter or Hacker NewsExperience working in with a start-up or general excitement for start-upsExperience working in a professional services environmentAbout UsMobify (www.mobify.com) is the mobile commerce platform of choice for leading Fortune 500 companies and drives hundreds of millions of dollars of revenue across web, apps and in-store every year.Our technology empowers marketers and developers at companies like Crocs, Starbucks, ideeli, Leading Hotels of the World, British Telecom and Beyond the Rack to deliver phenomenal mobile experiences that surprise and delight their customers.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Mobify Media",
	"division" : "Mobify Media",
	"website" : "www.mobifymedia.com"
}