{
	"id" : "54248",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "ENGINEERING CO-OP",
	"job_location" : "QUESNEL, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "West Fraser is a leading diversified North American forest products company that is listed on the TSX and rated one of Canada’s 10 Best Companies to Work For and as one of Canada’s Top 100 Employers two years in a row. Are you interested in working for a company that offers both a challenging work environment and a rewarding career path? We have excellent 4 or 8 month co-op employment opportunities at our Quesnel River Pulp (QRP) division for a Mechanical and/or Electrical Engineering Student starting in May 2015.The successful candidate will be reporting to the Engineering Superintendent and will participate in safety, production, maintenance and engineering programs as required. This may include assisting with other projects, troubleshooting, optimization and upgrades.The current focus at QRP is around energy efficiency / conservation. Recent projects include: a $16M low-consistency refiner installation; high-efficiency effluent heat exchangers; variable frequency pump upgrades; a new steam separator. A significant number of safety, production, and maintenance / reliability related projects are in progress as well.DUTIES & RESPONSIBILITIES:• Assist with engineering investigations of the mill’s equipment• Assist with engineering project development and implementation as required• Assist with electrical equipment maintenance and testing program development• Oversee and coordinate equipment installation• AutoCad for electrical drawings• Other duties may include:o Automation systems work – (Programmable Logic Controllers – PLC’s)o Instrumentation specificationo Documentation",
	"job_requirements" : "QUALIFICATIONS:• Safety first attitude/core value: previous health and safety training an asset;• Currently enrolled in a recognized post-secondary Engineering/Technologist Program, majoring in Mechanical or Electrical engineering;• Excellent verbal communication and technical writing skills;• Proven interpersonal and leadership skills; ability to work within a multi-discipline environment;• Positive and self-motivated;• Proficient in the use of computer systems and software;• Previous experience in an industrial environment is an asset;• Previous co-op and/or work experience is an asset;• A mechanical aptitude and passion for fixing, maintaining, and building things;• Available for&nbsp; 4 or 8 months, starting in May 2015;• Possess a valid driver’s license.&nbsp;YOU WILL LEARN:• Health & Safety awareness;• Pulp Mill Operations;• Identification of energy conservation measures• Project Management and implementation• Communication skills;• Usage of business systems such as maintenance and purchasing systems;• Working in a team.Quesnel River Pulp, using a high yield mechanical pulping process, produces 1100 tonnes per day of thermo-mechanical and bleached chemi-thermo-mechanical pulp. We take pride in our safety record, our state of the art effluent treatment system, the quality of our final product, and the cleanliness of our mill. We constantly strive to be an industry leader.Quesnel is located in the central interior of BC and has a relatively dry climate with warm summers. Quesnel services a population of nearly 25,000 people and is ideally suited for outdoor adventurers with many lakes and rivers to swim in as well as world renowned fishing lakes and rivers plus many other activities such as golfing, hiking, camping, and biking.For more information on West Fraser and our current opportunities, visit our website at: www.westfraser.com/jobsWe thank all applicants for their interest; however, only those short-listed will be contacted.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "West Fraser Timber Co. Ltd.",
	"division" : "Vancouver Corporate",
	"website" : "http://www.westfraser.com/careers/current-opportunities/job-board"
}