{
	"id" : "54242",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Junior Front-End Engineer (Co-op)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Mobify is seeking amazing Junior Front-End Engineers&nbsp;to join us for the spring Co-op term for either 4, or 8 months.&nbsp;As a Junior Front-End Engineer Co-op, you'll win the hearts and minds of our amazing clients with your technical kung-fu. You'll epitomize the front-end mobile magic Mobify is renowned for with your exhaustive knowledge of HTML, CSS and JavaScript. You will work on our Customer Success Team, the team who is responsible for the development and roll-out of the Mobify platform for our premium customers. This is leading edge work for some of the biggest and most recognized brands such as Starbucks, ideeli, Threadless, BT, Expedia, Beyond the Rack, and NBC.Check out some of our open source projects: http://github.com/mobifyResponsibilitiesMaintain mobile websites powered by Mobify and open source frameworksQuickly investigate and understand customer websites and codebasesSolve complex front-end web development problems experienced by our customersConsult Front-End Engineers and Designers to tackle the really tough customer issuesSupport our vast customer base in a friendly, constructive and clear mannerBuild out documentation for common issues and helpful hints/tutorialsContribute to adaptive.js and our custom web development plugins",
	"job_requirements" : "YouExperience with front-end web technology, primarily JavaScript but also an understanding of HTML/CSSExcellent writing ability and customer service skillsEnjoy the process of understanding and solving unique, new problemsPrioritize tasks as they are received and respond to tickets in a timely mannerHave a degree in Computer ScienceBonus PointsYou contribute to the open source community and are active on blogs, twitter and HackerNewsExperience working in a start-up environmentAbout UsMobify (www.mobify.com) is the mobile commerce platform of choice for leading Fortune 500 companies and drives hundreds of millions of dollars in mobile revenue. Over 75,000 developers use Mobify products to adapt their website for mobile and tablets devices. We empower customers and developers at companies like Starbucks, ideeli, Threadless, BT, Expedia, Beyond the Rack, and NBC to deliver over $100-million in mobile commerce this year, and that's just the beginning.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Mobify Media",
	"division" : "Mobify Media",
	"website" : "www.mobifymedia.com"
}