{
	"id" : "54257",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Software Engineer (Full Stack)",
	"job_location" : "San Francisco",
	"number_of_positions" : "2",
	"salary" : "$80-100K annual",
	"frequency" : "Yearly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "Hello from 42 (https://42technologies.com)!We are a San Francisco based, Y Combinator backed company that works on big data for retailers. We're looking for full stack engineers to join our team, but will consider candidates who are particularly strong in either front or back end development.&nbsp;Retail is a $4 trillion dollar global industry, and also one of the most underserved industries with the greatest room for improvement. We developed a web dashboard that takes raw transaction data, and turns it into insights about what's driving sales growth. We're looking for someone who wants to work on non-trivial analytics and data problems. You should be able to look at datasets and be able to identify key & hidden patterns.Our customers span from SF to New York to London to Beijing. We’re looking for the right person to help us bring retail analytics into the modern century. You’ll get to work with interesting data sets that are not available anywhere else.What we can offer:&nbsp; - Whatever gear you need&nbsp; - Flights to San Francisco&nbsp; - Insight on how how to process large data sets&nbsp; - Competitive salary&nbsp; - Flexible work hours & unlimited snacks&nbsp; - A chance to work in San Francisco, the heart of all things tech!",
	"job_requirements" : "Examples of things we’re building:&nbsp; - Predictive forecasting&nbsp; - Customer segmentation and ranking&nbsp; - Personalized recommendations&nbsp; - A/B testing for retail locations (window displays, localized pricing, etc.)Our stack is composed of:&nbsp; - AngularJS, Grunt, Sass&nbsp; - Mostly Node + CoffeeScript, Python&nbsp; - Spark, Postgres, LevelDB&nbsp; - Microservice architecture, Nginx, Redis&nbsp; - Ubuntu / Gentoo / CoreOS / DockerKnowledge of the above is not a requirement, we're looking for quick learners. We're an early stage startup, so things willchange quickly and your role will evolve. We want self-starter who's up for a challenge.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalStart Date:01/12/2015",
	"end_date" : "04/30/2015",
	"hours_per_week" : "0",
	"application_receipt_procedure" : "Online via system",
	"application_material_required_(i.e._project_examples)" : "Application Material Required (i.e. Project examples):Github, projects, previous things you've built",
	"company" : "42",
	"division" : "Software Engineering",
	"website" : "www.42technologies.com"
}