{
	"id" : "54250",
	"application_deadline" : "Jan 21, 2015 0700AM",
	"position_type" : "Co-op Graduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8, 12 or 16 months",
	"job_title" : "Software Engineer",
	"job_location" : "Seattle, WA",
	"number_of_positions" : "15",
	"salary" : "Competitive",
	"frequency" : "Monthly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "Whitepages is making a huge impact in the world of contact management, and we want your help!&nbsp; Whether your passion is back-end or front-end development, we have opportunities that will have you contributing to our products on day one.&nbsp; Read on to learn more about our opportunities.Whitepages is the leading provider of contact information for people and businesses in the U.S., and our data is our differentiator.&nbsp; We ingest billions of records every month from a variety of public sources and organize that data by linking individual records to create an intricate contact graph of names, phone numbers and addresses.&nbsp; This graph gives our users access to the most accurate and robust dataset of contact information in North America.&nbsp; Our suite of products include a top-40 consumer website, mobile apps (over 25M unique downloads) and our B2B SaaS suite of products.&nbsp;DataThe Data team designs and builds infrastructure to process billions of records.&nbsp; You will:• Provide data to power customer-facing apps• Find innovative ways to improve data accuracy and quality• Transform the way we process data• Work with small, agile teams to put impactful code into productionMobile Front-EndOur Mobile front-end team owns the UI for our suite of mobile apps such as Caller ID (Android), our flagship Whitepages app (iOS, Android) and upcoming new offerings.&nbsp; You will:• Work with the latest mobile tools, technologies and devices• Collaborate closely with our back-end team to create robust customer-facing features• Craft the highest-quality mobile apps while partnering with senior software developers• Use cutting-edge technology and frameworks to improve our mobile infrastructureCore SiteOur bread and butter, Whitepages.com works on an agile development cycle (6-10 releases a week) to put your high-performance, maintainable code in front of customers within hours.&nbsp; You will:• Liaise with design and other development teams to develop new features for our ever-expanding offerings• Write code in Ruby on Rails or HTML, CSS and Javascript to create the best possible product for our users• Build an interactive online identity structure that will allow users to use data more personallyBack-End (Search, Mobile and Pro)Build services that collect and aggregate data across a large set of internal and external real-time sources using information retrieval and fuzzy matching techniques. You will:• Use Scala, including Akka as well as NoSQL solutions for persistence and data retrieval• Create web services that will handle large (and growing) traffic demands• Work with senior developers and leaders to craft high-quality systems• Use data flow processes with transactional guarantees, and failure resilience in a service oriented architecture",
	"job_requirements" : "What we would like from you:• Know functional programming fundamentals and Java, Scala, Ruby, or a similar language• Possess a willingness to learn new languages and techniques to solve challenging problems• Have a degree in Computer Science or equivalent, graduating before July 2015• Cultivate a collaborative software development ethic where you value the importance of both offering and acting on feedbackOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://hire.jobvite.com/j?cj=o6vlZfwF&s=UBC",
	"company" : "Whitepages",
	"division" : "Main"
}