{
	"id" : "54256",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Software Developer - Summer 2015 Co-op/Internship",
	"job_location" : "Kitchener, ON",
	"number_of_positions" : "5",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "What would I be doing in this role at D2L?D2L creates industry-leading web-based enterprise Learning systems as well as direct-to-consumer web and mobile apps. Our applications engage millions of users worldwide every day. Located in Kitchener, Ontario, we are one of the fastest growing companies in Canada with a track record of strength and success. Recently, D2L is frequently listed as one of Waterloo Region's Top 15 Employers and as a Top 100 Employer for Young People in Canada.Whether you are an experienced Co-op or a first year Co-op, we are looking for all around superstars to help create and improve our suite of advanced communication and collaboration tools. You will be constantly learning and looking for ways to innovate. You thrive in a culture where teams speak freely and collaborate to solve interesting problems.Our previous students rave about our open concept office and overall work environment, as well as the challenge and responsibility they’re given by their leaders while on Co-op. They also cite learning new things & working on a meaningful product that reaches over 15 million learners daily as things that set D2L apart as a student employer.D2L can offer you the opportunity to work with the latest software technologies, while at the same time designing and coding products that are going to have an impact on improving teaching and learning. You can gain experience with a variety of technologies including enterprise .NET, mobile, cloud computing, developer toolkits, analytics, webcasting, or whatever new technology we are working on during your co-op term.To learn more about D2L please visit our website at www.D2L.com, and check out our office tour video at http://www.d2l.com/careers/tour/“This company consists of brilliant and hard-working individuals who have a passion for making learning as accessible to everyone as it can be. One of the few companies that has a mission so easily relatable to students.” – Software Developer Co-op Summer 2013&nbsp;",
	"job_requirements" : "What is D2L looking for from me?You have a strong entrepreneurial drive, an enthusiastic and dedicated mindset and a thirst for a challenge. The ability to think on your feet and work successfully both in independent and team-settings is essential. At D2L, our co-ops have a voice and are able to quickly contribute to their team's objectives.For our positions, we are looking for knowledge or previous co-op experience in one or more of the following:• Keen debugging and problem solving skills• .NET technologies and tools• Java technologies and tools• Mobile technologies and tools• Object-oriented design• Database development & design• Web DevelopmentWhat teams are hiring at D2L this term?We have openings within several departments for the upcoming term, including:• Education (K-12, Higher Education)• Enterprise (Corporate)• Personal Learning• In Market• Foundation• Product OperationsEducation RecommendationsCurrently a candidate for Bachelor's degree or diploma in Computer Science or a related field with the Co-op optionWhat about future opportunities?Many of our co-op students return for additional co-op terms or move into full-time permanent positions following their graduation. If you're looking for challenging work in a casual environment (with foosball, ping-pong and more), submit your application today! This is your opportunity to make a big impact in the area of next-generation Teaching and Learning applications!Background Check NoticePlease be aware that all incoming employees at D2L must agree to, and successfully pass, a criminal background check upon job match/acceptance.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Desire2Learn Inc",
	"division" : "Desire2Learn Inc"
}