{
	"id" : "54269",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Software Developer - Coop",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "3100",
	"frequency" : "Monthly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "Company OverviewPHEMI (TM) Health Systems is a process automation and Big Data platform company that unlocks patient data to improve clinic productivity, patient outcomes, and medical research.We offer exciting opportunities for you to grow your career and change the future with Big Data — experience creating solutions to problems that have yet-to-be solved and do what hasn’t been done before.Our leadership team has taken numerous early stage companies to commercial success and our technology team is second to none. With decades of experience delivering amazing products across a wide variety of industries, we are applying our business experience and technical depth to some of the critical challenges facing healthcare.We value smart people bringing fresh ideas, work experience and technical expertise to deliver extraordinary solutions. Our flat organization allows us agility working alongside our executive team — there’s nothing quite like a whiteboard discussion with our executive team to generate innovative ideas!Job DescriptionAs part of the R&D team, you play an integral role in creating extraordinary solutions, embracing new challenges. Working within an agile team, you work collaboratively to deliver user-stories in a timely manner with high quality.",
	"job_requirements" : "Responsibilities• Design and implement Web UI and software components to meet defined requirements• Collaborate with cross-functional team members to continuously improve our products, tools and development processes• Implement automated unit tests• Fix identified defects￼Preferred Skills and Abilities• Thorough understanding of Java and at least 1 dynamic language (Python preferred)• Experience with HTML5, CSS and Javascript, ideally including jQuery, bootstrap andd3.js• Practical knowledge of Linux operating system and desktop environment.• Excellent interpersonal communication (verbal and written)• Ability to balance multiple priorities• Ability to work cohesively in a team environmentProfessional Qualifications and Experience• 2 or more years academic experience toward a Computer Science, Electrical Engineering, Mathematics or equivalent degree or diploma• 1 or more Coop terms demonstrating team work in delivering software applicationsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:01/05/2015",
	"end_date" : "08/28/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Resume and University transcripts.Year of academic study (e.g., 2nd year, 3rd year, 4th year, etc.).Number of previous coop terms.Company:PHEMI Health Systems Inc.",
	"division" : "Head Office",
	"website" : "www.phemi.com"
}