{
	"id" : "54262",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Media Production & Print Assistant",
	"job_location" : "UBC, Vancouver",
	"number_of_positions" : "1",
	"salary" : "15.00",
	"frequency" : "Hourly",
	"job_description" : "Duration:4 months, with possibility of 8 months or 12 months extension. Preference will be given to students who are available for longer terms.Hours: 35/weekOffice Hours: 9 am – 5 pm (Mon – Fri)Salary Range: $15/hourStart date: May 1st, 2015 (or earlier)Overview:UBC Studios has an exciting opportunity for a student with interest and passion for media production. You will be able to hone your skills and develop new ones in filming, editing, camera and lighting. You will also have opportunities to use tools such as the Adobe Creative Suite.&nbsp; This position provides experience in creating both educational media content and communications based content. In addition, the position includes opportunities to be involved in Print and Graphic production.Company Description:UBC Studios is an on-campus facility dedicated to creating engaging content for educational, research, communication and recruitment needs of faculties, administrative units and its partners.&nbsp; UBC Studios is comprised of professional media producers, with experience in all areas of film production. Our new state-of-the-art-facility includes a full studio and in-house equipment.&nbsp;IT Creative Media also offers clients a prompt turnaround for print services and high-quality graphic design.Job Summary:This will be a shared position. You will be working with UBC Studios, the video production team, and the Print and Graphic Design team, which are located in separate offices.Your role with the UBC Studios will involve assisting producers, editors and camera operators in video production and post-production.&nbsp; You will have the opportunity to participate in all areas of video production from conceptualization to delivery. Production work involves both studio and on-location shoot assistance. You will learn to handle and operate professional camera equipment. You will also be required to assist in documentation and administrative support, and therefore experience of Office Word is required.With the graphic design and print team, you will focus on desktop publishing and large-format print services, while offering excellent customer service.Primary Responsibilities:• Ingest, transcode and organize media for editorial team• Set up and tear down equipment including lights, tripods, and back-drops during production, both in studio and on location, and participate in filming• Assist in post-production such as editing video and searching for music• Document business workflow• Set up new office management software• Assist in day-to-day business operation to enhance workplace efficiency• Maintain accurate work records for data entry, invoicing and archiving• Organize work schedule to ensure deadlines are metPrint and Graphics• Assist with printing research posters, desktop publishing and graphic design• Assist with marketing initiativesResponsiblities could include:• Assist in preparing media workshops and presentations• Assist with script writing and creative briefs• Project and prospecting research• Perform other duties within scope of the position&nbsp;",
	"job_requirements" : "Qualification:This position is open to co-op students in any major.Aptitude• Creative and self-motivated• Ability to multi-task and be flexible while working under tight deadlines• Ability to take direction as well as apply initiative• Enthusiasm to acquire new skills and earn new technologies• Excellent communication skills, ability to interact professionally with all levels of clients (staff, faculty, students and external), and experience offering strong customer serviceTechnicalKnowledge or willingness to learn:• Basic camera operating and audio recording skills• Creative software such as Final-Cut Pro X and the Adobe Creative Suite: Photoshop, Illustrator, InDesign, After Effects, Premier Pro• Typography, page layout, design, and digital illustrationStudent TestimonialCo-op student Sept 2014 – May 2015B.A. Geography“UBC Studios offers a fantastic way to be involved in every step of creating a professional production. Co-op students have the opportunity to show leadership and take on increasingly complex tasks. Students also have the unique chance to learn technical hands-on camera and studio skills as well as develop proficiency in creative media software. The small team environment of UBC Studios is welcoming and warm, and the co-op students are given a great deal of responsibility and trust.”Note: Please see related job posting, Media Production Assistant [S15].If you are interested in both positions, please apply to one, and specify that you are open to being considered for both.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "UBC, Information Technology",
	"division" : "UBC - Information Technology"
}