{
	"id" : "54265",
	"application_deadline" : "Feb 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Solutions Prototype Developer, Co-op (Multiple Opportunities) - Summer 2015-1407809",
	"job_location" : "Kitchener, ON",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "&nbsp;Description&nbsp;Imagine a place where building jetpacks is the norm. Where grown men and women are not afraid to play with Lego. Where practically all surfaces are made as canvases for your ideas (that means you can write on them, yo). Where you—yes, YOU—get to have a say on what cool new shiny toy you want to play with next in order to solve real problems in how banking and insurance is done today. And you get paid to do it.Welcome to Manulife’s Research, Exploration and Development Lab! But you can call it the RED Lab. We’re a small team with big ideas and we want more idea hackers like you. We aim high, run fast, and jump often. Our playground is the Communitech Hub - the origin of Pebble Watch, Thalmic Labs, BufferBox and more. This is where all cool things related to startups and innovation in Kitchener/Waterloo happen. And that’s where we want to play, too.Back to the Future…Lets do a little thought exercise. Imagine you sat in a Delorean (yes, we love our 80's references) and traveled into the future to the end of your co-op term with the RED Lab. Looking back at your 4 months with the Lab you would be able to claim the following:I played with the coolest and latest technologies on the market (e.g. the Thalmic Myo band or Apple’s Swift programming language)I worked on fun projects that solved meaningful problems to help make banking better (e.g. created a BitCoin mobile payment app or built facial and voice recognition apps)I built 5 to 10 prototypes that I pitched and demoed to my peers, some of which were from my own ideasI worked with a rad team that challenges each other to keep questioning the status quo and push the boundaries in a lean and collaborative environmentI had a lot of free food (not kidding. Communitech has a bunch of networking events where free food and drinks are provided. It’s pretty awesome)About Manulife: &nbsp;Manulife Financial is a leading Canada-based financial services group with principal operations in Asia, Canada and the United States. Clients look to Manulife for strong, reliable, trustworthy and forward-thinking solutions for their most significant financial decisions. Our international network of employees, agents and distribution partners offers financial protection and wealth management products and services to millions of clients. We also provide asset management services to institutional customers. Funds under management by Manulife Financial and its subsidiaries were C$567 billion (US$539 billion) as at June 30, 2013. The Company operates as Manulife Financial in Canada and Asia and primarily as John Hancock in the United States.&nbsp;Manulife Financial Corporation trades as ‘MFC’ on the TSX, NYSE and PSE, and under ‘945’ on the SEHK. Manulife Financial can be found on the Internet at manulife.com.",
	"job_requirements" : "&nbsp;Qualifications&nbsp;What are you likeIf you’ve read this far, you’re a pretty cool cat. But to help you a little more, here are some things we’d like to see in you, considering we’re going to be sharing a space with you for almost a quarter of a year:you’re a strong coder who uses the skill as a tool to solve real world problems. While the RED Lab is technology agnostic, we have mainly been using HTML5/Javascript/node.js/Angular and iOS development. Let us know if there are specific tech you want to dive deeper into.you thrive in an entrepreneurial environment where you don’t always have the answers to the challenges you’re tackling, but are eager to discover them. You accept the fact that you might fail a few times, but you persist.you GET rapid prototyping. We’re all people with ideas and we love ideating together, but we’re partial to action. We operate in 2 week sprints in which we see our ideas go to demo-able state. You have to be comfortable with learning-while-doing as there will be plenty of that.you care about customer experiences. You don’t have to be a UX guru, but you should appreciate well designed customer experiences and strive to work towards them in your projectsyou tinker. Whether it’s in hackathons, side-projects or your own startups, tinkerers usually bring the level of curiosity and technical aptitude to succeed here. The more you can tell us about your personal initiatives, the more brownie points you get.If any of the above struck a cord with you, then let's talk! Help us in making banking and insurance better for everyone.&nbsp;&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://manulife.taleo.net/careersection/10460/jobdetail.ftl?lang=en&job=1407809&src=UNV-11760",
	"company" : "Manulife Financial Corporation",
	"division" : "Regional Office"
}