{
	"id" : "54279",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Intern - Software Developer,",
	"media_and_entertainment" : "Media and Entertainment",
	"job_location" : "San Francisco,USA",
	"number_of_positions" : "3",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "As a global leader in 3D design, engineering, and entertainment software, Autodesk helps people imagine, design, and create a better world. Autodesk accelerates better design through an unparalleled depth of experience and a broad portfolio of software to give customers the power to solve their design, business, and environmental challenges. In addition to designers, architects, engineers, and media and entertainment professionals, Autodesk helps students, educators, and casual creators unlock their creative ideas through user-friendly applications.This is an incredible opportunity to work with the professionals who build some of the most advanced 3D animation solutions for visualization specialists, game and film artists.As a Software Developer Intern you will work as part of a team within Autodesk’s Media and Entertainment division. Using Agile development methodologies, you’ll implement features helping provide the best mobile computer vision, mediated reality, and real-time experiences and workflows for our customers using the latest in technology.This is a great opportunity to get front-line development experience in a stimulating environment!Project Role• Work with the development team to design a solution that meets customer requirements• Participate in iterative design, testing and development sprints to refine the overall product solution• Present your solutions in team design reviewsRequirement• Strong experience with C++• Experience with Windows development• Experience implementing Computer Vision, Sensor Fusion, Mediated Reality, or Feature Description Algorithms• Experience with SLAM, PTAM, DTAM or other vision tracking algorithms and SDKs• Currently a full-time student• Excellent communication, presentation and interpersonal skills",
	"job_requirements" : "eferred Qualifications• Experience with Mobile Game development• JavaScript experience a plus• GLSL experience a plus• Experience with evaluating and integrating new SDKs into existing software• Knowledge of the Autodesk family of software products, more specifically 3ds Max, Maya, Revit, AutoCAD, Inventor and FBX• Familiarity with the Agile development process• Mobile Human Computer Interface development**Autodesk offers assistance is to find housing. Relocation stipend also offered to successful candidate to facilitate move to San Francisco Bay Area. We recommend that you research housing/cost of living of San Francisco, CA area before applying.Autodesk would like to thank all applicants for their interest. Only selected applicants will be contacted for an interview. For more information, please visit us at:www.autodesk.com/careerstwitter.com/@autodeskersDid you know? You can also download our software for free by visiting: http://www.autodesk.com/education/free-software/allOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Sophos",
	"division" : "Main"
}