{
	"id" : "54277",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "QA and Automation Development, Coop Student",
	"job_location" : "Burnaby",
	"number_of_positions" : "1",
	"salary" : "3000",
	"frequency" : "Monthly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "T2 Systems Canada (previously Digital Payment Technologies) is an innovative leader in the design, manufacture, and distribution of multi-space parking meters, management software, and online services for the parking industry.T2 Systems recently released Digital Iris, a data intelligence platform for our multi-space payment meters. Digital Iris combines operational insight with interactive metrics and data visualization, intuitive mapping, and automated reporting. With personalized dashboards, 90 available metrics and over 3,000 widget combinations, Digital Iris puts the most valued information at our customer’s fingertips.We are looking for a student to join the team responsible for Digital Iris. The student’s projects will involve ensuring the quality of real world features for an upcoming release. Previous coop students have worked with new credit card processors, updated encryption systems, real-time web based internal dashboards, protocols to interface with mobile applications, and new interfaces to diagnose field issues.The ideal student will be extremely professional in work ethic and personal presentation, possess strong communication and organizational skills, and thrive in a fast-paced High Tech environment. They will juggle the demands of working within a team developing a suite of new high-performance high-availability secure web applications that are a cornerstone of the company. They will be active in all aspects of QA from Functional Testing, Regression Testing, Performance Testing to setting up Automation Testing in an Agile environment.This position will allow the student to work with web application frameworks like Spring, Hibernate, and Velocity while apartnered with full time QA analyists and developers. They will be exposed to different protocols like XMLRPC, SOAP, REST, and JSON. The student learn what it means to be responsible for ensuring that the shipped product is of the highest quality through learning extensive QA skills as well as learning development and scripting to support automation towards the same goals..This position Reports to Digital’s Senior QA Manager.Job Duties• Design, document and implement various Engineering related projects and in-house application software applications as appropriate;• Integrate 3rd party solutions into existing automation solutions;• Learn and perform all levels of QA function, primarily targeted at web facing applications.• Assist other departments on technical issues as appropriate;• Write, modify, integrate and test software code;• Maintain existing computer programs by making modifications as required;• Identify and communicate technical problems, processes and solutions;",
	"job_requirements" : "Required Skills:• Experienced with developing and structuring xml scripts to power applications;• Experience using XSLT or other XML transformation technologies.• Experience testing or developing web technologies – java based a bonus.• Excellent organization, writing and interpersonal skills;• Possesses analytical and problem solving skills;• A team player who also has the ability to work with minimal supervision;• Ability to set priorities and demonstrate initiative;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"end_date" : "12/18/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "T2 Systems Canada",
	"division" : "Main"
}