{
	"id" : "54287",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Engineering Work Experience Student (Customer Experience & Innovation) 20677",
	"job_location" : "Edmonton, AB",
	"number_of_positions" : "1",
	"salary" : "$24.498 - $28.579",
	"frequency" : "Hourly",
	"job_description" : "The City of Edmonton, recognized as one of Alberta's Top Employers and one of Canada's Best Diversity Employers in 2014, continues to attract and retain employees who are passionate about their community, proud of the work they do and committed to making Edmonton a great place to live, work and play.&nbsp;This is for 1&nbsp;Temporary Full-Time position that may continue for 4 or 8 months in duration, intended specifically for students currently enrolled in an Electrical or Computer Engineering&nbsp;coop or related post-secondary work experience program, commencing in May, 2015.&nbsp;ETS plays a critical role in connecting people, businesses and citizens within the City of Edmonton and the Capital Region.&nbsp; Smart Bus is an information and communication technology solution introduced by Edmonton Transit in order to provide better information for customers, enable better management of on-road bus service, and collect data that assists transit planners when designing service.&nbsp; As a part of the Edmonton Transit Bus Technology Application team, you will be responsible for coordinating the deployment Smart Bus hardware in 450 buses.&nbsp;Duties include:Assist in preparing and updating the appropriate project management plansSupport in performing quality control and developing project schedulesManaging the execution of activities identified in Smart Bus installation planProvide support in monitoring and controlling project progress and managing changesEnsure Smart Bus Installation projects are properly closed with proper authorizations, post project evaluations and updated lessons learnedEnsuring activities performed during the project are compliant with City of Edmonton requirementsWork with the contractors and perform pre and post installation workFor more student resources, join our City of Edmonton Campus Recruitment Group on LinkedIn! ",
	"job_requirements" : "&nbsp;",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:33.75",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://edmonton.taleo.net/careersection/8/jobdetail.ftl?job=20677",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):General:Applicants may be tested The City of Edmonton thanks applicants for their interest in this opportunity. Candidates considered for the position will be contacted. We are an equal opportunity employer. We welcome diversity and encourage applications from all qualified individuals.The Province of Alberta is a party to the federal Agreement on Internal Trade, the Trade, Investment and Labour Mobility Agreement with British Columbia, and the New West Partnership with British Columbia and Saskatchewan.&nbsp; All of these agreements promote labour mobility between the provinces.&nbsp; Applicants may obtain information regarding recognition of extra provincial credentials at&nbsp;www.newwestpartnershiptrade.ca/.Company:City of Edmonton",
	"division" : "Human Resources",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):20677"
}