{
	"id" : "54299",
	"application_deadline" : "Jan 21, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op: Junior GUI Software Designer (0D9)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "ALU IP Routing and Transport - Network and Service Management – 5620 SAM &nbsp;This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or University&nbsp;As a student, you have lots of ideas to put to the test. At Alcatel-Lucent we will provide you with the opportunity to combine your ongoing academic pursuits with valuable, practical, hands-on experience.At Alcatel-Lucent you will join a team of people that is transforming communications, and you will help to create and support some of the most ambitious and innovative products in the telecommunications industry. If you have the talent, skill and passion, we want to hear from you!&nbsp;Our main products include:The 5620 Service Aware Manager (SAM) has more than 400 deployments globally, and delivers powerful capabilities that simplify operations across all domains of the converged networks.The 5650 Control Plane Assurance Manager (CPAM) is a multi-vendor route and path analytics solution. Integrated with the 5620 SAM delivers real-time visualization, surveillance and troubleshooting for dynamic IP/MPLS networks.&nbsp;Our products are built using various technologies, includingJava, JavaScript, JBoss, J2EE, JMSWeb Application FrameworksWeb Technologies (HTML5, CSS3, REST/JSON, SOAP/XML)Toolkits – Isomorphic Smart Client, EaselJS, Isotope, D3js, jQueryLinux/RHEL/ Solaris x86/Windows/VMOracle 11, neo4J&nbsp;As a Software Developer on our team, you will be challenged! The successful candidate’s responsibilities will include:Assisting in designing and implementing the web GUI framework features.Developing solutions to achieve high-availability network requirements, while reaching defined scale and performance targets.Working in a team-based Agile Environment; collaborate with Developers, Testers, and Product Management to refine requirements, develop, and test our products.Interacting with Support Teams to provide software solutions to field-reported issues.",
	"job_requirements" : "ESSENTIAL SKILLS AND QUALIFICATIONS:Working towards a Degree in Computer Engineering or Computer ScienceSolid understanding of Object Oriented Analysis and DesignProficiency in Java, JavaScript, CSS, HTML5Strong interpersonal and communication skills, both written and verbalDemonstrated ability to learn quickly and to work in a fast paced, innovative environment&nbsp;ADDITIONAL ASSETSExperience with Web GUI Frameworks and/or Applications&nbsp;Alcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability or members of a visible minority group to apply.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}