{
	"id" : "54300",
	"application_deadline" : "Jan 21, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Co-op: SRC Business Systems Analyst (0DI)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or University&nbsp;As a student, you have lots of ideas to put to the test. At Alcatel-Lucent we will provide you with the opportunity to combine your ongoing academic pursuits with valuable, practical, hands-on experience.At Alcatel-Lucent you will join a team of people that is revolutionizing communications, and you will help to create and support some of the most ambitious and innovative products in the telecommunications industry. If you have the talent, skill and passion, we want to hear from you!&nbsp;Description:The Service Routing Certification Program is the industry first service routing based IP certification program. A global initiative with hundreds of customers and employee groups participating worldwide, the SRC Team is looking for a business systems analyst resource to support the development of various online applications. The ideal candidate will be a resourceful, independent and flexible individual who can work in a dynamic environment.&nbsp;Tasks:Develop and document business requirementsWork with development teams through application development process, responding to questions and refining requirementsCreate test documentationComplete user acceptance testing and report on findingsCreate end user documentationComplete end user training on new applications as requiredSupport existing web applications; respond to customer inquiriesPublish web content using existing toolset&nbsp;",
	"job_requirements" : "Qualifications:2nd year+ co-op student registered in a recognized Co-Op or Intern Program at a Canadian College or University&nbsp;EDUCATION AND SKILL REQUIREMENTS:Student with a background in Administration, Management, Marketing or Computer ScienceExcellent written and verbal communication skills are essentialFluency in English is requiredVery detailed orientedSuperb multi-tasking skills neededExperience with HTML and application testing an asset&nbsp;Alcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability and persons of a visible minority group to apply.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}