{
	"id" : "54304",
	"application_deadline" : "Jan 19, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Firmware and Electronics Co-op 39527",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "About UsZaber Technologies is an established and steadily growing employee-owned companythat designs, manufactures, and sells precision motion control equipment for high-tech markets around the world.We strive to create an open, friendly, and high-achieving work environment. Ourstaff are progressive, enthusiastic individuals whose hobbies and interests arere flected in the work we do. Some aspects of Zaber that our employees especiallyenjoy include the people, the sense of community, flexible hours, level of employeeengagement, employee-organized activities and opportunities to learn. Most of uscycle, bus, or carpool to work and put in extra effort to make sustainable choices.Last, but not least, our office has several friendly dogs.Zaber Technologies (www.zaber.com) is looking for engineering co-op students who arepassionate about electronics and embedded programming projects to start in May2015.&nbsp;",
	"job_requirements" : "Requirements*For electronics projects:**Experience with circuit design and printed circuit board layout**Understanding of sensor and actuator concepts and properties*For firmware projects:**Experience with C programming language in an embedded environment**Understanding of electronics and circuit design*Strong analytic skills and good intuition for microcontroller and electronicssystems*Experience in VHDL, assembly, and other programming/scripting languages an asset*Enthusiasm for problem solving, challenges, and the process of learning*Enjoy working in a small team environment*Attention to detail along with good testing and documentation practices*Ability to manage and prioritize tasks and responsibilities with little supervision*Legally entitled to work in CanadaResponsibilitiesThese are interdisciplinary positions with opportunities to gain hands-on experiencein RD processes as well as product management. Projects and responsib ilities willbe tailored to the abilities and interests of the candidates. Some possibleresponsibilities include:*Brainstorm, design, and implement advanced capabilities in firmware and electronics*Take an electronics concept through design, layout, and manufacture to a finishedproduct*Research and implement best practices for development and testing frameworks*Document research and design processes, and provide internal support*Manage, coordinate, and improve product release and distribution processesOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):How to Apply1. In your cover letter, please describe an interesting project that you designedand implemented recently. We'd prefer a personal project or specific work done aspart of an extracurricular team.2. Include source code, design documents, schematics/layouts, and/or photos tosupport your descriptions.Company:Zaber Technologies Inc.",
	"division" : "Zaber Technologies Inc."
}