{
	"id" : "54305",
	"application_deadline" : "Jan 21, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Hardware Test Engineer (0DL)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "This position is limited to students that are registered in a recognized Canadian College or University&nbsp;As a Test Engineer working in our Hardware Supply Chain group you will:Support key functions including test data analysis, failure analysis, finding trends and finding appropriate solutions to test and manufacturing issues;Analyze Quality issues, performing IFAs and RCAs, assisting with difficult debug issues, setup new test stations and deliver test solutions, provide training to manufacturing teams;Introduce test solutions for new product introduction, ensuring that quality, cost and delivery targets are met through test optimizations, cost reductions and yields and quality metric improvements;Make changes to Test Applications and develop Test Automation for new test applications for both board and system test level using NI TS and CVI tools;Transfer test setups and solutions between Mfg sites and different Contract Manufactures;Implement changes to test applications and setups due to ECOs or Test Optimization.",
	"job_requirements" : "Qualifications:2nd or 3rd year co-op student registered in a recognized co-op or intern Program at a Canadian College or University&nbsp;Competencies:We are looking for a student to work with test engineers, who works well in a team, or independently in a multi-disciplined and culturally diverse organization. You must be an innovative, self-motivated, innovative quick learner who is able to multi-task, make effective decisions and have excellent written and verbal communication skills.&nbsp;Desired:Registered in Electrical Engineering, Telecommunication Engineering, Computer Engineering, or a similar programExperience with both board and system level manufacturing test development and support would be an assetExperience with NI TS and CVI and C/C++ programming would be an assetExperience in a Manufacturing Test Environment would be an assetExperienced in analyzing hardware failures and data collection to troubleshoot failuresExperienced in the use of tools such as scopes, meters and traffic generatorsExperienced in the use of Data Collection tools and PDM tools like AgileFamiliar with IP, ATM and TDM technologies&nbsp;Alcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, and persons with a disability or members of a visible minority group to apply.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}