{
	"id" : "54306",
	"application_deadline" : "Jan 21, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op: 7705 SAR Applications Engineer (0DN)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "This position is limited to students that are registered in a recognized Co-op or Intern Program at a Canadian College or University&nbsp;Role Description:The 7705 Service Aggregation Router Technical Expertise Centre (TEC) is seeking a highly motivated and technically astute individual to join our team to provide global technical support to teams around the world.&nbsp;Technical SupportInterfaces to regional TACs (Technical Assistance Centers), Customer Account Teams, other Business &nbsp;&nbsp;Units, R&D, and Product Management for technical consultation and customer support concerns.Debugs complex customer issues by applying both established troubleshooting procedures and creative alternatives.Develop internal / external web tools and scripts required to troubleshoot specific customer issues.Prepares and maintains problem reports encountered and methods of resolution ensuring overall system integrity and reliability.&nbsp;New Product IntroductionDevelopment of New Product/Feature Introduction Training Material, Configuration Notes, and Knowledge base Articles.Interfacing with the Development team to gain an understanding of new features/products&nbsp;Global Network Engineering SupportAssisting the GNE team to stage/test customer networksProvide specific customer training on recently designed or redesigned networks",
	"job_requirements" : "Qualifications:3rd year+ co-op student registered in a recognized Co-Op or Intern Program at a Canadian College or UniversityComputer Science, Electrical, Computer or Software Engineering.&nbsp;&nbsp;&nbsp;Essential:The ideal candidate has some or all of the following qualities:Excellent communication skills and the ability to work well in a close-knit teamExcellent troubleshooting skillsUnderstanding of IP and MPLS networkingUnderstanding of network management concepts and basic protocols (e.g. SNMP, DHCP).&nbsp;&nbsp;Alcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability and persons of a visible minority group to apply.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}