{
	"id" : "54309",
	"application_deadline" : "Jan 21, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op: Cloud Computing Engineer (0FN)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or University&nbsp;The team is seeking a Cloud Computing coop to work with Alcatel-Lucent’s professional services team. The candidates in this role will be required to support other Alcatel-Lucent employees in providing professional services to customers. The support will include working on design details and proof of concepts in labs. Working with OpenStack, CloudStack, vCAC and other orchestration products and potentially updating the workflows to accommodate customer requests.&nbsp;Some of the work could involve: Deploy customer network as per design guidelines defined by the architectural team, and potentially being involved in the architectural decisions if possible.Front customer network issues and coordinate with the support organization on resolving any issues.Help with Proof of Concept engagement with customers, demoing Alcatel-Lucent Nuage solution.Deliver customized workshops and technical training to customers.",
	"job_requirements" : "ESSENTIAL SKILLS AND QUALIFICATIONS:2nd or 3rd year co-op student registered in a recognized Co-Op or Intern Program at a Canadian College or UniversityComputer Engineering or Electrical Engineering degree program&nbsp;Alcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability or members of a visible minority group to apply.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}