{
	"id" : "54303",
	"application_deadline" : "Jan 21, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Co-op: SRC Technical Editor (0DK)",
	"job_location" : "Ottawa, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "&nbsp;This position is limited to students that are registered in a recognized Co-Op or Intern Program at a Canadian College or University&nbsp;As a student, you have lots of ideas to put to the test. At Alcatel-Lucent we will provide you with the opportunity to combine your ongoing academic pursuits with valuable, practical, hands-on experience.At Alcatel-Lucent you will join a team of people that is revolutionizing communications, and you will help to create and support some of the most ambitious and innovative products in the telecommunications industry. If you have the talent, skill and passion, we want to hear from you!&nbsp;Description:With operations in 130 countries, Alcatel-Lucent is the first truly global communications solutions provider, offering the most complete end-to-end portfolio of solutions and services in the industry. Our passionate and experienced team converts challenges into opportunities in the areas of third-generation mobile networking, metro optical and packet, circuit-to-packet, broadband access, advanced network and professional services, and next-generation operations support systems.Perform a complete editorial review of all current course and exam content following editorial guidelines currently used by Alcatel-Lucent&nbsp;Key Responsibilities:Identify and correct errors in our Alcatel-Lucent Service Routing Certification program that is delivered to customers in global training centersWork with various subject matter experts on the SRC Courseware Development team to clarify awkward or confusing sections of courseware, taking into account the diverse background of studentsUpdate Powerpoint presentations according to standardized template providedHelp design and implement standardized format for Powerpoint and lab diagramsReview and correct exam questions for grammar and clarityDevelop processes to improve the revision and publication of new courseware",
	"job_requirements" : "Qualifications:2nd year+ co-op student registered in a recognized Co-Op or Intern Program at a Canadian College or University; Arts; Communications, English or Rhetorical Writing&nbsp;&nbsp;&nbsp;ESSENTIAL: The ideal candidate has some or all of the following qualities:Experience in Technical editingSound English language and editing skillsExperience with network technologies is an assetExperience with MS Word and PowerpointExcellent interpersonal, organizational, and communication skills&nbsp;&nbsp;Alcatel-Lucent Canada is committed to building a skilled, diverse workforce reflective of Canadian society. As a result, we promote employment equity and encourage women, Aboriginal persons, persons with a disability and persons of a visible minority group to apply.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Alcatel-Lucent",
	"division" : "Canadian Office"
}