{
	"id" : "54318",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "iOS Engineer",
	"job_location" : "LA, USA",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "You're talented and passionate about mobile gaming. And you want to work in a fun, rewarding environment with other incredibly talented people just like yourselfResponsibilities:• Ship production-grade mobile apps and games used by millions of people• Create gaming frameworks and UI elements in objective-C• Work cross functionally with design teams, product management teams, and gaming development teams to create seamless and beautiful experiences for users• Join a team that creates chart-topping applications that garner tens of millions of downloads and are regularly rated in the 4.5+ star category. Our native teams are small and the products they create are huge, worldwide successes. You can own the success of a product and benefit from it as an equity holder, and reach an incredibly robust audience who is waiting for the next Scopely release.• Develop Scopely's partner API/SDK to enable quick and easy integration for upcoming partner titles• Architect and design future solutions to be used across multiple apps and releases",
	"job_requirements" : "What makes you a rock star?• Familiarity with Swift• Have launched an iOS game title• Familiar with CoCo, Unity or SpriteKit/SceneKitOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Scopely",
	"division" : "Scopely"
}