{
	"id" : "54322",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Reporting/Analytics Engineer",
	"job_location" : "Los Angeles, CA",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Reporting/Analytics Engineer at ScopelyYou are the rare breed of business-savvy and analytical.&nbsp; A powerhouse of action-oriented insights - you would love to get your hands on terabytes of player, revenue and game data to find nuggets of insights that help drive improvement in customer/player game experience. You're excited by the prospect of driving game teams, including product managers, marketing, and game designers, with your data-focused approaches to all game decisions. If this describes you, this is the role for you!What will you do?-Analyze large, complex data sets representing the behavior of millions of online and mobile game players to address strategic and operational business questions-Own the insights for a specific game and drive needle moving improvements by working with all organization from engineering to marketing-Develop frameworks, models, tools, and processes to ensure data influences decisions at all levels",
	"job_requirements" : "What do you need?-Intellectual curiosity, analytical rigor, hard-working and a good business intuition are musts!-Ability to communicate complex results throughout an organization-Excel in your holster-You're a SQL pro-A love games - especially mid-core or casual ones!Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Scopely",
	"division" : "Scopely"
}