{
	"id" : "54320",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Android Engineer",
	"job_location" : "Los Angeles, CA",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Android Engineer at ScopelyScopely is a rapidly growing social mobile gaming startup founded by proven entrepreneurs and backed by distinguished investors.&nbsp; Our sunny Los Angeles office is fueled by an abundant supply of coconut water, coffee, and camaraderie -- with an irrepressible dash of mischief. In case you don't live in LA or you're not a US citizen, we consider relocation and/or visa costs to be a small price to pay for world-class talent.We are looking for the most badass Android engineers on the planet to help us develop features and tools for games that are used by millions of users. Our mobile developers are award-winning hackers who expect to be working with world-class talent.We set the bar extremely high at Scopely, but that's the type of environment you crave. Your ambition to build something significant and lasting is exceeded only by your desire to be surrounded by coworkers who are equally relentless. If you are itching to be involved in a startup that's going places and where you can have a considerable impact, then you just might have found your calling at Scopely.Responsibilities:-Build native SDKs that interface to our backend services and test automation tools-Ship production-grade Android (Google Play, Amazon) features used by millions of people",
	"job_requirements" : "Qualifications:-Understanding of mobile networking best practices: request limiting, request caching, batching, content aggregation, minification, integrating with rest and tcp/udp services, etc.-Comfortable using asynchronous, multi-threaded, parallel programming paradigms and other techniques to maximize UI responsiveness-You know how to make the unthinkable happen: long data lists and thousands of images don't scare you, animations are cake-You are familiar with all of the Android APIs-Thorough knowledge of Java and AndroidOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Scopely",
	"division" : "Scopely"
}