{
	"id" : "54328",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Application Software Co-op",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "$2500 - $3000",
	"frequency" : "Monthly",
	"industry" : "Manufacturing/R&D - Computers/Electronics",
	"company_type" : "Private Business",
	"job_description" : "Company Profile: Optigo Networks makes smart buildings smarter. As a leader in connectivity for smart buildings, Optigo Networks provides a complete solution to protect, connect and manage today’s most advanced buildings. Layered on top of this platform, Optigo’s integrated analytics and security engine ensures the building network is protected and operates trouble-free.Buildings around the world are quickly realizing that buildings require a specialized network for building devices, as intelligence is added to their operations. Optigo Networks is the only company positioned as a leader in building connectivity in this Internet of Things, providing a secure and simple-to-manage networking platform for physical security and building automation.Learn more at www.optigo.net.The Role: We seek a computer science student to join our team for a 4- or 8-month term starting May 2015 in a fast-paced environment.Key Duties and Responsibilities: Projects may be concurrent and ongoing as schedules and changes in workflow unfold, as typical for a start-up. Potential projects include:- Web app/API design and implementation using the latest web technologies: AngularJS, PHP, Javascript, JSON, REST- Developing analytics to take device information (power consumption, payload info, etc.) and network information (traffic profile, rates, etc.) to identify failures and network intrusions and providing alerts to our users- Software testing and debug on network devices including building debug APIs for automated testing",
	"job_requirements" : "Requirements:- Capable of ramping up quickly and a willingness to learn new technologies- Good analytical, problem solving and communication skills- Familiarity with Linux as a development environment- Ability to work collaboratively in a team environment- Good analytical, problem solving and communication skills- NSERC Eligible with solid academic performance and organizational skillsAdditional Desired Skills:- Ability to adapt to changing workflows and priorities, independently or as part of a team- Desire to work in a start-up environment with other like-minded individuals- Knowledge of JavaScript frameworks including bootstrap.js, angular.js, etc.- Other useful languages (SQL, Python)- Familiarity with Ethernet networking at a systems levelOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalStart Date:05/04/2015",
	"end_date" : "08/28/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Optigo Networks Inc.",
	"division" : "R&D"
}