{
	"id" : "54332",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Engineering Services Co-op Student-CP15-002",
	"job_location" : "Airdrie",
	"number_of_positions" : "6",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "WHO WE ARE: As owner and operator of more than 60 per cent of Alberta's total electricity distribution network, FortisAlberta's focus is delivering safe and reliable electricity to more than half a million residential, farm and business customers. The Company serves more than 200 communities with 118,000 kilometres of distribution power lines across Alberta.‘Our promise is your power’ is FortisAlberta’s commitment. We are looking for people who can help deliver on our promise to customers. Working at FortisAlberta offers many challenging opportunities in both field and office environments. The power of YOU. At FortisAlberta we invest in our greatest resource – our people. FortisAlberta encourages and supports the health and well-being of employees because a healthy lifestyle touches all aspects of our employees’ lives. At FortisAlberta, safety is our top priority. We strive for ZERO preventable injuries through improving our safety culture and safety management systems. Employees will never be put in a position where safety is compromised.",
	"job_requirements" : "Our ideal candidate: Must be enrolled in an Electrical or Civil Engineering Degree program; Must be a motivated, self-starter who can work well independently or within a team environment Demonstrates a high degree of organizational and analytical skills and pay close attention to detail; Strong written and verbal communication skills and; Is proficient with Microsoft Excel, Access, Word, and Outlook.WHO WE ARE: As owner and operator of more than 60 per cent of Alberta's total electricity distribution network, FortisAlberta's focus is delivering safe and reliable electricity to more than half a million residential, farm and business customers. The Company serves more than 200 communities with 118,000 kilometres of distribution power lines across Alberta.‘Our promise is your power’ is FortisAlberta’s commitment. We are looking for people who can help deliver on our promise to customers. Working at FortisAlberta offers many challenging opportunities in both field and office environments. The power of YOU. At FortisAlberta we invest in our greatest resource – our people. FortisAlberta encourages and supports the health and well-being of employees because a healthy lifestyle touches all aspects of our employees’ lives. At FortisAlberta, safety is our top priority. We strive for ZERO preventable injuries through improving our safety culture and safety management systems. Employees will never be put in a position where safety is compromised.You will gain a variety of valuable work experience, including: Supporting the Power Quality, Standards & Projects Engineering, Protection & Control, and SCADA groups in Operations Engineering Services. With support of the engineers, the student will be responsible for updating design guidelines and standards used by the operations teams based on feedback from the field and design or code changes from industry. Special projects and other duties, as required.&nbsp;TO APPLY TO THIS POSITION: Submit your resume by clicking on the link below, click on “View All Jobs”, select the position, then click on Submit Your Resume/CV to This Job.https://fortisalberta.mua.hrdepartment.com/hr/ats/JobSearch/indexPlease note that we thank all applicants for their interest, however only those candidates to be considered for an interview will be contacted.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsCivilComputerElectricalIntegratedMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Engineering CivilMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://fortisalberta.mua.hrdepartment.com/hr/ats/JobSearch/index",
	"company" : "Fortis BC",
	"division" : "FortisBC Alternative Energy Services Inc."
}