{
	"id" : "54331",
	"application_deadline" : "Jan 21, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Intern Engineer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "2",
	"salary" : "$2,500 - $4,000/month",
	"frequency" : "Monthly",
	"job_description" : "Company Name:&nbsp;&nbsp;&nbsp; eBRISK VIDEO INC.Website URL:&nbsp;&nbsp;&nbsp; www.ebriskvideo.comContact Person:&nbsp;&nbsp;&nbsp; Robert DanversPosting Job Title: Intern EngineerPosting Job Location: Vancouver BCNumber of Positions Available:&nbsp; 2&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Workterm Dates: Starting May 2015 (4 months or possible 8 months)Work Duration:X 4 Month Co-opPossible Extension to 8 months X Yes _ No_&nbsp; 8 Month Co-opPossible Extension to 12 months _Yes _ NoOther Length (specify)____Monthly Salary (required):$2,500 - $4,000/month, commensurate with skills/experienceCompany Profile:eBrisk Video Inc. is a leading developer of intellectual property in the area of video compression algorithms as well as a leading provider of H.265/HEVC video compression software solutions for video conferencing and broadcast applications. The company’s leading-edge software solutions are designed to improve substantially the visual experience of video conferencing and broadcast applications on current platforms over the existing network infrastructure. eBrisk’s software solutions feature superb picture quality and the most complete set of functionalities.Responsibilities & Duties:We are looking for students who are seeking a challenge for their coop experience and the opportunity to work with experts in the video compression field as a member of eBrisk's research and development or customer support teams.Working under the guidance of our Research Manager, candidates will be responsible for performing detailed analyses of specified components of the H.265/HEVC encoder or decoder.&nbsp; For each component, a written report documenting and an oral summary of the analysis is expected.&nbsp; In addition, you will be responsible for the design, development (in software) and testing of complexity reduction modifications to the encoder/decoder algorithms.",
	"job_requirements" : "Required Qualifications:Knowledge of C/C++Ability to organize your work and work as a member of a project teamSelf learning abilityStrong problem solving skillsOther Desirable Qualifications:Good report writing, documentation and communication skillsC/C++ programming experienceOperating systems knowledgeSignal processing knowledgeKnowledge of scripts: bash, batch, pythonOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "eBrisk Video Inc.",
	"division" : "eBrisk Video Inc."
}