{
	"id" : "54333",
	"application_deadline" : "Jan 21, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software QA Test Co-Op",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Software QA Test Co-Op&nbsp;&nbsp; - will be responsible for the end to end testing of our software by&nbsp;&nbsp; using proven methodologies.&nbsp;&nbsp; - you have created test plans and cases for product performance in&nbsp;&nbsp; response to customer reported issues and defect tracking, triage and&nbsp;&nbsp; reproduction&nbsp;&nbsp; - write up detailed bugs with steps to reproduce&nbsp;&nbsp; - have experience with API testing,&nbsp;&nbsp; - UI testing from Web apps, iOS and AndroidThe big picture is end to end testing of a home sensor that communicates tothe cloud over wifi with presentation layers on a web app, iOS and Android.Quite the complex framework and definitely will require a candidate thatcan multitask.",
	"job_requirements" : "Skill sets we're looking for&nbsp;&nbsp; - Bug writing&nbsp;&nbsp; - Agile methodologies&nbsp;&nbsp; - experience with JIRA project management tool&nbsp;&nbsp; - exposure to REST APIs, MySQL databaseNice to haves&nbsp;&nbsp; - Embedded firmware testing&nbsp;&nbsp; - UI or Web automationOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Energy Aware Technology Inc.",
	"division" : "Energy Aware Technology Inc.",
	"website" : "www.energy-aware.com/index.html"
}