{
	"id" : "54330",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Technical Support Engineer 393762",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "ActiveState Software Inc. is looking for a Technical Support Engineer to&gt; be a part of our growing, vibrant company. This is a full time, permanent&gt; position in our Vancouver office working on Stackato, our next generation&gt; cloud application management platform.&gt;&gt; Candidates should bring at least 1 year of experience in a support&gt; position, a hunger for problem-solving, great communication skills, and&gt; impressive skills in troubleshooting open source technology. You have a&gt; desire to understand and play with newer, cutting-edge technologies and&gt; software methodologies, and thrive in a fun and fast paced workplace.&gt;&gt;&gt; If you think you've got what it takes, and you can put check marks next to&gt; most of the requirements below, then send us that HR-friendly stuff today.&gt;&gt; Responsibilities:&gt;&gt; • Technical support and problem verification&gt; • Quality assurance testing for ActiveState's multi-language platform as a&gt; service environment and tools&gt; • Online support and community involvement&gt; • Administration of dev and test systems&gt; • Willingness to facilitate open and effective communication with internal&gt; and external teams&gt;",
	"job_requirements" : "Requirements:&gt;&gt; • Bachelor's degree in Computer Science or equivalent industry experience&gt; • Minimum one year of experience working in software support, System&gt; Administration, or related environments&gt; • Excellent written and verbal communication skills&gt; • Excellent problem solving skills&gt; • Technical knowledge and system administration experience in Linux&gt; environments&gt; • Flexibility and adaptability for working in an ever-changing, dynamic&gt; environment with rapidly changing priorities and goals&gt;&gt; Highly Desirable Qualifications:&gt;&gt; • Knowledge of Java or Ruby&gt; • Experience with virtualization software (e.g. VMware, VirtualBox)&gt; • Network administration experience&gt;&gt; Other Desirable Qualifications:&gt;&gt; • Experience with one or more ticket tracking systems&gt; • Experience with QA processes&gt; • Technical knowledge in Mac OS X and Windows environments&gt; • Experience working with source code control software&gt; • Intermediate scripting/dynamic language skills, including past or&gt; current use of ActiveState Perl, Python, and/or Tcl productsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "ActiveState",
	"division" : "Head Office",
	"website" : "www.activestate.com"
}