{
	"id" : "54346",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Application Software Developer (Co-op)",
	"job_location" : "Great Village, NS",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Ocean Sonics (www.OceanSonics.com) is a world-class innovation house that designs andmanufactures smart hydrophones for leaders in ocean observation, ocean research, offshore energyand ocean industries.Application Software Developer (Co-op)Ocean Sonics has an opportunity for a co-op software developer at our main office in Great Village,Nova Scotia. Join a team of design experts who are tackling real-world technical problems. We havebeen a co-op employer for over 4 years.About the RoleOur innovation team consists of experts in hardware, firmware and software. You will have broadexperience in software development, design and architecture with a focus on connectivity and datapresentation.This role is both high-level and hands-on.Your role will include:•&nbsp;&nbsp;&nbsp; Development of usable, scalable and feature-rich software•&nbsp;&nbsp;&nbsp; Software architecture planning/design&nbsp;OutcomesLearn about software standards, problem solving, hardware and software integration, C development,vendor and customer relations, working in a business environment as part of a team.Relocation:There is car-pooling assistance available from Truro and Bible Hill to the office in Great Village.Many of the employees car pool to reduce the environmental impact and save money on gas. PreviousCo-op students found the car pool very convenient especially if they did not have a vehicle. It isa great way to meet the other employees.Reasonably priced accommodations are available in the Truro area due to the presence of DalhousieAgricultural Campus.&nbsp;",
	"job_requirements" : "Position Requirements•&nbsp;&nbsp;&nbsp; Co-op in Computer Science, Engineering or equivalent•&nbsp;&nbsp;&nbsp; Exposure to software developmentExperience with the following tools is desirable:•&nbsp;&nbsp;&nbsp;&nbsp; The C and C++ and programming language•&nbsp;&nbsp;&nbsp;&nbsp; HTML/CSS, JavaScript•&nbsp;&nbsp;&nbsp; Software development in a Linux environment•&nbsp;&nbsp;&nbsp;&nbsp; Source code control•&nbsp;&nbsp;&nbsp;&nbsp; Microsoft Office applications•&nbsp;&nbsp;&nbsp; Embedded/Microprocessor environments•&nbsp;&nbsp;&nbsp; Software debug and performance analysis tools•&nbsp;&nbsp;&nbsp; Human-machine interface design•&nbsp;&nbsp;&nbsp;&nbsp; Software testing and quality control&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Ocean Sonics Ltd",
	"division" : "Ocean Sonics Ltd"
}