{
	"id" : "54359",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op/Developmental - Operating Planning - Electrical Engineering Technology (262)",
	"job_location" : "Barrie, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "You will be a member of one of the above groups, which are responsible for:The Customer and Operating Support department is responsible for post-event support to large customers, Interconnections to other Transmitters, Operating Services, and System Event Investigations.&nbsp;Your job duties may include:Assist Planning in production of Outage Packages for execution in the control room, perform system studies, and maintain records and databases.Assist Control Room personnel with special projects, produce technical reports, maintain databases, perform Controller job shadowing, partake in field visits, and correspond with field personnel.Assist Training with technical research and production support, special projects, improvements to and delivery of reports, directory and file management, perform Controller job shadowing, partake in field visitsAssist COS staff in the maintenance of Transmission Connections Agreements, the creation of System Event Investigations, and maintain records and databases.&nbsp;This job will provide you with the following professional development:Gain an understanding of Power System Real-time Operations and PlanningGain experience working with a team in a busy production oriented office environmentGain an understanding of emergency preparedness and restoration, and experience with in-house software tools",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://jobs.hydroone.com/job/Barrie-Co-opDevelopmental-Operating-Planning-Electrical-Engineering-Technology-ON/242092800/",
	"company" : "Hydro One Networks Inc.",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):262"
}