{
	"id" : "54351",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Test Engineering, Product Engineering",
	"job_location" : "Ballard, Burnaby",
	"number_of_positions" : "3",
	"salary" : "Dependent on # of work terms",
	"frequency" : "Hourly",
	"industry" : "Manufacturing/R&D - Power/Energy/Fuel Cells",
	"company_type" : "Private Business",
	"job_description" : "Ballard Power Systems requires 3 co-op students for an 8 month term to assist in Test Engineering activities associated with Product Development and Engineering Services related to fuel cell stacks, fuel cell stack components, and fuel cell systems for transportation, back-up power and other applications.&nbsp;The student will be responsible for:• Designing tests for design characterization and verification• Preparing test plans, and writing test procedures• Conducting fuel cell tests:&nbsp; Set-up and execution of tests, using a variety proprietary fuel cell system test equipment and techniques• Data gathering and data analysis: collecting and organizing test data, data crunching, use of analysis tools and computational support• Summarizing technical results in both formal and informal reports• Presenting results to colleagues and customers• Supporting product design by interacting with design and manufacturing staff as well as program management, applications engineering staff, and others.",
	"job_requirements" : "This opportunity is appropriate for students from the following (and related) disciplines: Chemical Engineering Mechanical Engineering Engineering Physics Systems or Mechatronics EngineeringKey skills include: Ability to work in an active laboratory environment Strong mechanical aptitude to support “hands-on work” Strong oral and written communication ability Strength in understanding technical theory as well as in the practical application of theory. Data analysis using MS Excel.&nbsp; Familiarity with Excel macro writing and editing is desirable Basic understanding of fuel cell operation is desirable Experience working in a laboratory environment is desirablePreference will be given to students who have completed their 3rd year of their designated degree, and are NSERC eligible.Ballard values diversity in the workplace and is committed to Employment Equity.&nbsp; We encourage applications from all qualified candidates.&nbsp;&nbsp;Open To All Majors:Yes",
	"start_date" : "05/04/2015",
	"end_date" : "12/18/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Ballard Power Systems",
	"division" : "Head Office",
	"website" : "ballard.com"
}