{
	"id" : "54355",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Intern Analyst, Information Technology (Summer 2015) (Job# 1625)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Make an impact at a global dynamic investment organizationWhen you invest your career in CPP Investment Board (CPPIB), you join one of the most respected and fastest growing institutional investors in the world. With current assets under management valued in excess of $200 billion, and projected to reach $300 billion by 2020, CPPIB is a professional investment management organization that globally invests the funds of the Canada Pension Plan to ensure long-term sustainability. CPPIB invests in all major asset classes, including public equity, private equity, real estate, infrastructure and fixed-income instruments, and currently has offices in Toronto, Hong Kong, London, New York and São Paulo.CPPIB attracts and selects high-calibre individuals from top-tier institutions around the globe. Join our team and look forward to:Diverse and inspiring colleagues and approachable leadersStimulating work in a fast-paced, intellectually challenging environmentAccelerated exposure and responsibilityGlobal career development opportunitiesA deeply rooted culture of Integrity, Partnership and High PerformanceIf you share a passion for performance, value a collegial and collaborative culture, and approach everything with the highest integrity, here’s an opportunity for you to invest your career at CPPIB.OpportunityWe are currently seeking Developers who will participate in our summer internship program.&nbsp; Successful interns will be considered for our Graduate Rotational program.We understand you are approaching the end of your university program and are excited to apply your skills to real world problems.&nbsp; This is an opportunity to work with one of our established software development teams to develop systems that support our investment research and operations mandates.ResponsibilitiesCollaborate with business and technology teams to ensure deliverables are clearDesign and develop new and existing applications using one or more of Java, Python, JavaScript, AngularJS, MSSQL, Oracle, kdb, HDF5Estimate work effort, identify risks and provide feedback on the feasibility to deliver by target datesPromote development tools and Agile best practices through active team participation, knowledge sharing sessions and maintenance of documentation on team wikiEnsure sufficient test coverage to guard against breaking existing functionalityWhat does it take to join our team?Candidates in an undergraduate program that will be returning to school in the Fall of 2015 are eligible to apply.&nbsp; We look for candidates that have displayed academic success while balancing extracurricular activities, a strong skill-set in financial modeling, valuation and analytics, as well as good communication, interpersonal and relationship building skills.&nbsp; .If you have an interest in working with talented professionals in the financial industry in an environment of integrity, partnership and high performance then you should consider a career in Information Technology at CPP Investment Board.Visit our LinkedIn Career Page or Follow us on LinkedIn.At CPP Investment Board, we are committed to diversity and equitable access to employment opportunities based on ability.&nbsp; We thank all applicants for their interest but will only contact candidates selected to advance in the hiring process.",
	"job_requirements" : ".Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.cppib.com/en/careers/campus/job-opportunities.html?locale=en-us&cpUrl=http%3A%2F%2Fcareers.peopleclick.com%2Fcareerscp%2FClient_CPPIB%2Fcampus%2Fen-us%2Fgateway.do%3FfunctionName%3DviewFromLink%26jobPostId%3D2018%26localeCode%3Den-us",
	"company" : "Canada Pension Plan Investment Board",
	"division" : "Canada Pension Plan Investment Board",
	"website" : "www.cppib.com"
}