{
	"id" : "54353",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "ARUP Intern / Sandwich Student",
	"job_location" : "Hong Kong",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Internship Program 2015Category: Consulting EngineersCompany: Ove Arup & Partners Hong Kong Ltd.Title: Intern / Sandwich StudentDescription:Arup is a global firm of planners, designers, engineers and consultants with over 11,000employees working in more than 91 offices across more than 39 countries. The firm is thecreative force behind many of the world’s most innovative and sustainable projects. Our Asiaoffices employ over 3,000 staff and are engaged in prestigious multi-disciplinary projectscovering buildings, infrastructure, transportation, structural, environmental and industrial areas.We embrace diversity and inclusion in all aspects including individual differences and openmindedness.Please feel free to visit our company website at www.arup.com.Arup is looking for well motivated and creative student to join our internship program in variousdisciplines. We invite engineering and planning student to join us in tackling problems throughresearch, design and analysis.Disciplines offered: Building Sustainability/Renewable Energy Civil Communications (Information Systems Engineering/Computer Science/Electronic) Environmental/Acoustics/Lighting Geotechnical/Engineering Geology/Geographic Information Systems Mechanical/Electrical/Building Services Structures Transport Planning Urban Planning/Urban Design",
	"job_requirements" : "Requirements:Applicants should be highly motivated, eager to learn and be adaptable to a fast-pacedlearning environment.We also look for the following: Excellent written and oral communication skills Experience with AutoCAD and Microsoft Visio is an assetThis internship will be taken place in Arup Hong Kong office subject to Hong Kong visaapproval granted to the student if applicable. Visa approval process takes around 4-6 weeksbefore internship starts.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science in GeologicalMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering CivilMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in BiomedicalMaster of Engineering in GeologicalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaster of Software SystemsMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Interested students, please apply by sending full resume with availability, contact details, andacademic transcripts.Application letters collected will be used for recruitment purpose only. Applicants notcontacted within 8 weeks may consider their applications unsuccessful.Company:Ove Arup & Partners Hong Kong Ltd.",
	"division" : "Ove Arup & Partners Hong Kong Ltd."
}