{
	"id" : "54361",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "16 months",
	"job_title" : "Internship - Transmission and Distribution Settlements - Engineering or Business (504)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Working collectively with the Transmission and Distribution Settlements team, you will help ensure our customers are receiving correct billing information and charges. You will assist in analyzing and monitoring load and generation meter data required for customer billing. As well, you will be responsible for managing and maintaining aspects of our meter warehouse application and help develop processes to create a more efficient and effective business unit. You will produce and manage analyses on various types of customers to help provide billing information and rate class designation.&nbsp;Responsibilities:Complete daily procedures, including meter data checks essential to the maintenance of the meter warehouse application.Perform audit checks on customer accounts by reviewing schematic drawings and customer information across several different systems.&nbsp;Assist in analyzing certain parameters of customer accounts to ensure billing is within the accurate rate class as per the Hydro One Conditions of Service.Validate data transfers and respond to the inquiries from the Hydro One BCC and Meter Data Services.Analyze various weekly meter data reports and aggregate them into a consolidated report.Maintain and update the load data and customer meter connections in the meter warehouse application.Develop, revise and implement procedures, guidelines and work instructions for various processes as required.Manage and maintain the Embedded Generator and Transmission and Distribution Tracking databases.Organize, prepare and lead the TDS Monthly Meeting and various other meetings as requested.Update and maintain various programs, systems and databases based on changes that occur to customer information or identified errors which need to be adjusted.Review electric power supply diagrams for the generators connecting to Hydro One’s distribution facilities to detect potential impact on settlements.Review technical and non technical documents for Hydro One stations across Ontario to ensure correct settlement between Hydro One, local distribution companies and the IESO.Participate in the development of efficient business process.Other duties as required.&nbsp;This job will provide you with the following professional development:Insight into the electricity industry within OntarioProvide you with stronger analytical skillsEnhance your knowledge of revenue metering and customer service",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://jobs.hydroone.com/job/Toronto-Internship-Transmission-and-Distribution-Settlements-Engineering-or-Business-ON/241700400/",
	"company" : "Hydro One Networks Inc.",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):504"
}