{
	"id" : "54365",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Co-op - Telecom - Engineering/Computer Science (645)",
	"job_location" : "Rexdale, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "You will be a member of the above group, which is responsible for:Provide Technical Support for Hydro One Telecom and Hydro One Networks Fibre Optic Transport equipment and networks.&nbsp;Your job duties may include:Circuit and equipment provisioning, remote maintenance testing and verifications on fibre optic equipment, radios and associated equipment, software programming/scripting for automation of operational procedures, documentation and database updates, Network Management server administration.&nbsp;This job will provide you with the following professional development:One will obtain an understanding of the telecom industry/field, Operations and Change Management processes.&nbsp; Hands on experience in configuration of Fibre Optic network equipment and telecom networking associated equipment. Hands on experience in using various Server and workstation operating systems such as HP/SUN UNIX, Windows 20xx, Windows 7.",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://jobs.hydroone.com/job/Rexdale-Co-op-Telecom-EngineeringComputer-Science-ON/241701600/",
	"company" : "Hydro One Networks Inc.",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):645"
}