{
	"id" : "54369",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "12 months",
	"job_title" : "Internship - Telecom Operations - Electrical/Computer Engineering (521)",
	"job_location" : "Rexdale, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "You will be a member of the above group, which is responsible for:Providing Second Level Support for Hydro One Data Network as well as providing project support for changes and configurations to Hydro One WAN/LAN, Wireless, and VoIP implementation.&nbsp;Your job duties may include:Assist in the monitoring of equipment performance, investigate problems and initiate corrective action; Network change co-ordination, program Cisco routers/switches (independently or under supervision of one of the Professional staff), oversee the installation of them, and once completed test and evaluate their success; Documentation of all changes; Perform other duties as required.&nbsp;This job will provide you with the following professional development:Hands on experience in design, development, implementation and daily operation of multiple networks; Hands on experience in configuration and troubleshooting of Cisco Data/VoIP/Wireless device; Understanding of Change Management Process; Teamwork, Client management skills, and Leadership.",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://jobs.hydroone.com/job/Rexdale-Internship-Telecom-Operations-ElectricalComputer-Engineering-ON/241700100/",
	"company" : "Hydro One Networks Inc.",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):521"
}