{
	"id" : "54362",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "12 months",
	"job_title" : "Internship - Information Systems - Electrical/Computer Engineering (505)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "You will be a member of the above group, which is responsible for:&nbsp;Information Services (IS) within PSIT provides information services and support&nbsp; to the OGCC, IESO and other LOBs through the management,&nbsp;validation,&nbsp;interpretation, value-added analysis and delivery of power system information in support of key business requirements such as SAP Asset Registry, IESO equipment registration, power system planning, OGCC network modelling, work management, rate development, settlements, and connection agreements. It is responsible for ensuring data integrity, quality and sustainment of tools for delivering data in a reliable, useable and robust form to end users.&nbsp;Your job duties may include:Assist in support of corporate initiatives dealing with enhancing, integrating, consolidating and rationalizing customer and asset information systems.Assist in data quality initiatives required for successful support of enterprise projects such as ADS- Distribution Management System initiativeSupport data quality initiatives related to power assets characteristics verifications by comparing multiple data sources: station operating diagrams, power assets databases, field tests and others.Support data quality initiatives related to customer and customer connectivity characteristics verifications and information systems integrations and rationalizations.&nbsp;This job will provide you with the following professional development:Experience with development &nbsp;and &nbsp;implementation of &nbsp;initiatives focused on improving business processes related to the access and use of asset and customer registry systemsExperience with day to day customer and asset data maintenanceExperience with business processes used in power system industryExperience in a corporate environment working both independently and within teams with common objectives",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://jobs.hydroone.com/job/Toronto-Internship-Information-Systems-ElectricalComputer-Engineering-ON/241700700/",
	"company" : "Hydro One Networks Inc.",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):505"
}