{
	"id" : "54376",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "12 months",
	"job_title" : "Internship - Project Management - Electrical Engineering (503)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "&nbsp;You will be a member of the above group, which is responsible for:Students hired into Project Management will be given the opportunity to learn the coordination of engineering, procurement, commissioning and/or construction services to deliver electrical, environmental, and civil work programs.&nbsp; Students will have exposure to telecommunications programs, power line and electrical sub-station projects.&nbsp; Leadership and communication skills will be developed to instil confidence in the candidate’s abilities.&nbsp; In addition, there will be opportunities to develop working relationships with suppliers and consulting firms.&nbsp;Your job duties may include:The integration of transmission stations, lines, civil, electrical, environmental and real estate,Monitor, report and update on engineering, construction, transmission and distribution programs,Monitor, report and assist with schedulingAssess, plan, budget and schedule assigned work providing necessary data and reports as required,Assist in establishing project in-service dates and monitor progress to achieve successful project completion,Conduct station site visits and surveys.Assist in the development of capital project program, engineering and construction plans,Utilize various project application software to populate and articulate project plans.Assist with administrative duties to support Project Management Staff&nbsp;This job will provide you with the following professional development:Working as part of a project team,Gain the knowledge necessary to develop project plans, project status and reporting on Projects",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsCivilElectricalIntegratedMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering CivilMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://jobs.hydroone.com/job/Toronto-Internship-Project-Management-Electrical-Engineering-ON/241700000/",
	"company" : "Hydro One Networks Inc.",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):503"
}