{
	"id" : "54377",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "12 months",
	"job_title" : "Internship - Dx Strategy & Tech Development - Electrical Engineering (581)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "You will be a member of the above group, which is responsible for:Distribution strategies and business planningResearch and new technology development&nbsp;Your job duties may include:Assisting members of the Strategy and/or R&D teams with respect to the responsibilities described above and undertaking assigned tasks. This may include, but not be limited to:development of spare strategies for distribution equipment, performing life cycle costs for various asset types, analyzing planned costs versus actual spending in capital and maintenance work through SAP and BIBW reports, integrating assets from acquired utilities into the SAP Functional Location and Equipment Hierarchy with develop maintenance plans and strategies for these assets. Other duties may include, interfacing with customers on technical & non-technical issues, writing technical or non-technical reports, completing project tracking sheets and reports, completing or assisting with presentations and written documents. Providing advice and support related to entire business management of R&D program and overseeing entire process of R&D from Purchase Requisitioning to Invoicing in SAP. Executing reporting of R&D projects status and acting as a liaison with other Lines of Business along with maintaining our SharePoint library and project proposals.&nbsp;This job will provide you with the following professional development:Technical knowledge related to power systems planningInitiating technical innovation as well as policy developmentDevelopment of communication skills and skills to effectively deal with technical and commercial/process issuesKnowledge of power industry accepted standards and software for technical assessmentsKnowledge of Hydro One policies in business planning, process execution and reporting",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://jobs.hydroone.com/job/Toronto-Internship-Dx-Strategy-&-Tech-Development-Electrical-Engineering-ON/241699400/",
	"company" : "Hydro One Networks Inc.",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):581"
}