{
	"id" : "54374",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "12 months",
	"job_title" : "Internship - Protection, Control & Metering Engineering - Electrical Engineering (652)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "5",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "You will responsible for:Development of project-specific or generic specifications, standards, test and commissioning procedures, estimates, application designs, engineering calculations, drawings and other related documentation for protection, control and/or metering systems used in the Hydro One Bulk Transmission System.&nbsp;Your job duties may include:Preparation of project specific or standard designs and related documentation. Analysis of manufacturers’ hardware and software implementations for digital protective relays, SCADA and revenue metering systems. Preparation of test and commissioning procedures for protection systems based on digital equipment. Development of logic and elementary (schematic) diagrams. Preparation of sketches and reports associated with project designs or generic design standards. Assisting senior engineers with projects of significant complexity.&nbsp;This work term will provide you with the following professional development:Actual “hands-on” electrical engineering design experience in a busy department involved with the development and application of new microprocessor-based protection, control and revenue metering technology in the power systems discipline.",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://jobs.hydroone.com/job/Toronto-Internship-Protection%2C-Control-&-Metering-Engineering-Electrical-Engineering-ON/241701100/",
	"company" : "Hydro One Networks Inc.",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):652"
}