{
	"id" : "54378",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "16 months",
	"job_title" : "Internship - Project Management - Electrical Engineering (508)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "You will be a member of the above group, which is responsible for:Students hired into Project Management will be given the opportunity to learn the coordination of engineering, procurement and construction services to deliver electrical, environmental, and civil work programs.&nbsp; Students will have exposure to power line and electrical substation projects.&nbsp; Leadership and communication skills will be developed to instil confidence in the candidate’s abilities.&nbsp; In addition, there will be opportunities to develop working relationships with contractors, suppliers and consulting firms.&nbsp; A strong element of this work-term is the development and execution of large scale contracts for construction activities and materials.&nbsp;Your job duties may include:Assist in monitor, control and direct projects and programs during the execution phase under the direction of a Senior Project Manager.Co-ordinate activities with stakeholders.Assist in resolving issues through negotiations with the customer.Prepare comprehensive reports and specifications, and present recommendations to resolve issues, producing documentation as necessary.Assist in the preparation of contract specifications and awards and provide necessary technical guidance.Manage risks throughout the course of a project.&nbsp; Develop and communicate risk response through acceptance, avoidance or mitigation.Contribute to the development of project strategies, plans and identify opportunities for cost savings.Contribute to the regular reports prepared for the projects.Manage materials required for projects.Other duties as required.&nbsp;This job will provide you with the following professional development:Working as part of a project team,Exposure to application of engineering in power lines, and substation power systems.Gain the knowledge necessary to develop project plans.Experience with the management processes used to design, procure and construct power systems for both Transmission and Distribution assets.Experience in a corporate environment working both independently and within teams on common objectives.",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://jobs.hydroone.com/job/Toronto-Internship-Project-Management-Electrical-Engineering-ON/241699200/",
	"company" : "Hydro One Networks Inc.",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):508"
}