{
	"id" : "54375",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "12 months",
	"job_title" : "Internship - Distribution Investment Planning - Electrical Engineering (381)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "You will be a member of the above group, which is responsible for:completing technical assessmentsidentifying alternatives for the connection of loads and renewable generatorsassisting with the preparation of business cases, other business documentsAssisting with influencing and implementing applicable technical policies (eg. Transmission System Code & Distribution System Code) affecting load and generator customersAssisting with designing and documenting processes and improvements&nbsp;Your job duties may include:Assisting members of the DIPS team with respect to the responsibilities described above and undertaking assigned tasks.&nbsp; This may include, but not be limited to, undertaking studies & assessments involving technical calculations, interfacing with customers on technical & non-technical issues, writing technical or non-technical reports, completing project tracking sheets and reports, completing or assisting with presentations and written documents.&nbsp;This job will provide you with the following professional development:Technical knowledge related to power systemsAn interest in the renewable energy sector and the power systems industryAn interest in leading technical innovation as well as policy developmentStrong communication skills, skills to deal with technical/commercial issues in real lifeKnowledge of industry accepted standards, software for technical assessmentsKnowledge of Hydro One policies and practices for generation connections",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://jobs.hydroone.com/job/Toronto-Internship-Distribution-Investment-Planning-Electrical-Engineering-ON/241698900/",
	"company" : "Hydro One Networks Inc.",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):381"
}