{
	"id" : "54387",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Civil Engineering/Materials Engineering Technician Co-op Positions",
	"job_location" : "Calgary, Saskatoon, Red Deer, Regina, Bonnyville, Lloydminster, or Fort McMurray",
	"number_of_positions" : "15",
	"salary" : "Salary is dependent on experience and location ? time and a half for overtime",
	"frequency" : "Hourly",
	"industry" : "Construction",
	"company_type" : "Private Business",
	"job_description" : "POSITION: CIVIL ENGINEERING/MATERIALS TECHNOLOGIST CO-OP POSITIONSPOTENTIAL FOR LOTS OF OVER TIME (variable from year to year, and office to office, based on weather and projects)&nbsp;Location: Calgary, Red Deer, Saskatoon, Regina, Bonnyville, Lloydminster, Fort McMurray and Edmonton. (approximately 25+ positions total)&nbsp;Term of Employment: Construction Season (approx. May to early December)&nbsp;Calgary is a picturesque, young and dynamic city, located less than two hours drive from the Rocky Mountains, home of some of the best skiing on the planet. Economic activity in Calgary is mostly centered on the petroleum industry; however, agriculture, tourism, and high-tech industries also contribute to the city’s thriving economy. Major Attractions include the Calgary Stampede, the Flames, the Stampeders, as well as a wide variety of festivals, theatre, and other diverse cultural experiences. Calgary has a lively night life. Calgary simply is a great place to live.Red Deer is the third largest city in Alberta.&nbsp; From engaging local culture and art to challenging and unique golfing adventures.&nbsp; It is located in Central Alberta between the major cities of Edmonton and Calgary, near the summer paradise of Sylvan Lake.Edmonton offers both a balanced and unsurpassed quality of life opportunity.&nbsp; Edmonton has evolved over the years to become a vibrant and dynamic community, rich in attractions including recreation, cultural, tourist and community services, as well as leading education and health facilities.&nbsp; Edmonton has the small town friendliness with conveniences and amenities of a big city.&nbsp;Lloydminster has been acknowledged as one of Canada's top entrepreneurial cities.&nbsp; The bustling community straddles the border that separates the western provinces of Alberta and Saskatchewan.&nbsp; The city is rich in attractions including recreation, cultural and community services, and education facilities such as Lakeland College.&nbsp;Bonnyville is a fabulous place to work and play.&nbsp; It provides the perfect mix of community services through health, educational, recreation, and cultural facilities.&nbsp; Surrounded by lakes and majestic boreal forest, Bonnyville offers locals a treasure trove of natural wonders.&nbsp; Bonnyville is 20 minutes from the beautiful resort community of Cold Lake.&nbsp;RESPONSIBILITIES:The successful applicants will be responsible for field and laboratory materials testing of concrete, asphalt, aggregates & soils. Other responsibilities may include assisting other geotechnical and environmental staff with field investigations, geotechnical instrumentation, and sampling.&nbsp; With the potential for out-of-town work, candidates must be willing to travel.&nbsp;Amec Foster Wheeler Environment & Infrastructure (AmecFW) is a leading full-service environmental engineering and construction/remediation services firm in North America, providing environmental and geotechnical engineering and scientific consulting services.&nbsp;AmecFW is an international project management and services company that designs, delivers and supports client assets for customers across the public and private sectors. AmecFW employs approximately 40,000 people working from a network of offices throughout the U.K., U.S. and Canada, as well as regional offices and projects worldwide. AmecFW shares are traded on the London Stock Exchange and New York Stock Exchange where the company is listed in the Oil Equipment and Services Sector (AMFW). In North America, AmecFW has approximately 8,000 employees operating from over 100 offices.&nbsp;Additional information can be obtained from our website at www.amecfw.com.Amecfw is committed to the principle of equal opportunity in employment.&nbsp;PLEASE SPECIFY YOUR ORDER OF PREFERENCE BETWEEN CALGARY, RED DEER, SASKATOON, REGINA, BONNYVILLE, LLOYDMINSTER, AND EDMONTON IN THE FIRST LINE OF YOUR COVER LETTER&nbsp;",
	"job_requirements" : "This is a position which will appeal to a self-motivated individual with a strong technical/practical background, excellent interpersonal/communication skills, and a solid work ethic, coupled with an interest in career growth. Applicants must be well organized, and have the ability to manage and prioritize several tasks at one time to ensure a commitment to excellent service and technical excellence.&nbsp; In addition, the potential candidates will need to be flexible, adaptable, and have an understanding of the variation of schedules due to weather and project needs.Preferred candidates will be working toward a degree in Civil Engineering, but students in other engineering disciplines will still be considered. The ability to work well independently, as well as in a team environment are necessary to this position.&nbsp;Applicants must hold a valid Class 5 drivers licence with some North American driving experience.&nbsp;Hours will range from approximately a minimum of 1200 to a maximum of 2000 hours for an 8-month work term depending on weather conditions and project demands. Most students will average a total of 1650 hours during a double (8-month) work term.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilElectricalEnvironmentalGeologicalIntegratedMaster of Applied Science in GeologicalMaster of Applied Science in MaterialsMaster of Applied Science Okanagan in CivilMaster of Engineering CivilMaster of Engineering Clean EnergyMaster of Engineering ElectricalMaster of Engineering in GeologicalMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMiningUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:05/04/2015",
	"end_date" : "12/18/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "AMEC Foster Wheeler (Environment & Infrastructure)",
	"division" : "Calgary Office (Env. & Infrastructure)",
	"website" : "www.amecfw.com"
}