{
	"id" : "54381",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "12 months",
	"job_title" : "Internship - Project Engineering - Electrical Engineering (644)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "You will be a member of the above group, which is responsible for:Managing the engineering deliverables for the design of new and refurbishing power substations and power transmission lines.&nbsp; Track, monitor and report design progress, analyse key performance indicators of the Engineering Services Division.&nbsp;Your job duties may include:Assisting Project Engineers to co-ordinate different design disciplines to produce design for replacing/upgrading power equipment and their protection and control systems in power stations, monitor and track progress of design to make sure projects are designed within the given budget and meeting project schedules.&nbsp;This job will provide you with the following professional development:General knowledge of designing a power substation and power transmission linesProject management (planning, scheduling, control and reporting)Project performance analysisCommunication and presentation skillsNegotiation skill",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://jobs.hydroone.com/job/Toronto-Internship-Project-Engineering-Electrical-Engineering-ON/241700600/",
	"company" : "Hydro One Networks Inc.",
	"division" : "Main",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):644"
}