{
	"id" : "54386",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Engineering Co-op Position",
	"job_location" : "Burnaby, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "D-Wave is looking for exceptionally motivated people who love to see the impact of their work on adaily basis, who will do whatever it takes to ensure success of the company, and who want to be apart of something special. We are working to radically change what is possible with computers andare leading the effort to commercialize quantum computing.As a member of the Software Engineering team, you will be engaged in Quantum Processor systemsoftware projects. While partnered with a senior software engineer/coach, you will support the teamin the entire software development lifecycle.In this role, you will be expected to:•&nbsp;&nbsp;&nbsp;&nbsp; Participate in the design and implementation of system components•&nbsp;&nbsp;&nbsp;&nbsp; Participate In code reviews•&nbsp;&nbsp;&nbsp;&nbsp; Evaluate current code coverage and identify additional tests•&nbsp;&nbsp;&nbsp;&nbsp; Assist the team in identifying and implementing test process improvements•&nbsp;&nbsp;&nbsp;&nbsp; Research and evolve product test plans.\About us:D-Wave has over sixty peer reviewed papers describing the various aspects of our work that havebeen published in journals such as Nature, Physical Review Letters, and Physical Review B. Recentarticles about D-Wave have appeared in Time Magazine, MIT Technology Review, Forbes, USC Viterbimagazine,D-Wave Systems Inc.3033 Beta Ave Burnaby, BC V5C 4M9Telephone (604) 630-1428&nbsp; Facsimile&nbsp; (604) 630-1434web: www.dwavesys.comand Wired. D-Wave was recently named the 2012 Cool Vendor in High-Performance Computing andExtreme-Low-Energy Servers by the Gartner Group and our CTO was honored as the Canadian Innovatorof the Year for 2011 by the Canadian Innovation Exchange. Some of the investors in D-Wave includeDraper Fisher Jurvetson, Goldman Sachs, Bezos Expeditions, In-Q-tel, and Business Development Bankof Canada. . A D-Wave Two quantum computer is the center piece of the Google NASA QuantumArtificial Intelligence Lab at NASA’s Ames Research Center:http://www.youtube.com/watch?v=CMdHDHEuOUEWe thank all applicants for their interest, however, only those who are selected for interviewswill be contacted.D-Wave Systems Inc. is an equal-opportunity employer and encourages applications from all qualifiedcandidates regardless of race, color, religion, sex, national origin, age, sexual orientation,genetic information, physical or mental disability, protected veteran status, or any othercharacteristicprotected by federal, state/provincial, local law.&nbsp;",
	"job_requirements" : "Required Qualifications:•&nbsp;&nbsp;&nbsp;&nbsp; Enrolled in 3rd year or higher in Computer Science, Math or Science program•&nbsp;&nbsp;&nbsp;&nbsp; Understanding of Software Development Lifecycle•&nbsp;&nbsp;&nbsp;&nbsp; Experience with Python, C/C++•&nbsp;&nbsp;&nbsp;&nbsp; Working experience with Linux, OS X platforms using command line (bash, sh)•&nbsp;&nbsp;&nbsp;&nbsp; Strong analytical abilities•&nbsp;&nbsp;&nbsp;&nbsp; Ability to work well in a fast-paced team environment that is focused on priorities and endresults•&nbsp;&nbsp;&nbsp;&nbsp; Self-motivated, proactive, flexible and passionate about learning•&nbsp;&nbsp;&nbsp;&nbsp; Excellent hands-on ability•&nbsp;&nbsp;&nbsp;&nbsp; Ability to work independentlyExceptional candidates will have experience in one or more of the following:•&nbsp;&nbsp;&nbsp;&nbsp; Detail oriented with excellent follow up skills•&nbsp;&nbsp;&nbsp;&nbsp; Experience with web based development, HTTP protocol&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "D-Wave Systems Inc",
	"division" : "Main"
}