{
	"id" : "54389",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Powertrain Engineering Internship / Co-Op (Summer 2015)",
	"job_location" : "Palo Alto, CA, USA",
	"number_of_positions" : "9",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "About TeslaTesla’s goal is to accelerate the world’s transition to electric mobility with a full range ofincreasingly affordable electric cars. California-based Tesla designs and manufactures EVs, as wellas EV powertrain components for partners such as Toyota and Daimler. Tesla&nbsp; has delivered over15,000 electric vehicles to customers in 31 countries. Model S is the world’s first premium sedanto be engineered from the ground up as an electric vehicle. Model S was named Motor Trend’sprestigious 2013 Car of the Year, achieved the best safety score of any car ever tested by theNHTSA, and Consumer Reports is calling it the best car it has ever tested.Tesla Motors is committed to hiring and developing top talent from across the world for any givendiscipline. Our world-class teams operate with a non-conventional automotive product developmentphilosophy of high inter-disciplinary collaboration, flat organizational structure, and technicalcontribution at all levels. You will be expected to challenge and to be challenged, to create, andto innovate. These jobs are not for everyone, you must have a genuine passion for producing thebest vehicles in the world. Without passion, you will find what we're trying to do too difficult.The RoleYou will design, test, and prototype mechanical components and/or electrical subsystems. Your scopeof work will be electromechanical in nature and will challenge you to come up with creativesolutions to affect rigorous quality and cost-down targets. Additionally, you will workcollaboratively with cross-functional partners and external vendors and suppliers.Your application to the Powertrain Engineering Internship will be considered for all opportunitiesacross Powertrain Hardware and Powertrain R&D teams in Palo Alto, CA.&nbsp;",
	"job_requirements" : "Required Skills•&nbsp;&nbsp;&nbsp; Mechanical wrenching, basic fabrication, machining, wiring, general electronics, debugging,and parts chasing.•&nbsp;&nbsp;&nbsp; Experience with automotive component/system testing including environmental and safetytesting.•&nbsp;&nbsp;&nbsp; Understanding of thermodynamics and heat transfer, high voltage and low voltage DC circuits.•&nbsp;&nbsp;&nbsp; Experience designing, fabricating and programming test equipment for the validation ofelectronic and electromechanical equipment.•&nbsp;&nbsp;&nbsp; Practical experience modeling components and assemblies in CAD (Solidworks, CATIA V5). Workingknowledge of Matlab, Labview, and Python.•&nbsp;&nbsp;&nbsp; Experience using test equipment, oscilloscopes, DVMs, signal generators, power supplies andother standard EE lab equipment.•&nbsp;&nbsp;&nbsp; Understanding of thermal and mechanical modeling and testing of components.•&nbsp;&nbsp;&nbsp; Knowledge of electronics packaging issues: isolation, EMC, heat sinking and cooling,tolerances, materials, fastening, and machine design elements.•&nbsp;&nbsp;&nbsp; Experience with power semiconductors - IGBTs, Mosfets, and gate drive circuits.•&nbsp;&nbsp;&nbsp; Experience with automotive environmental, reliability, and safety requirements is a plus.•&nbsp;&nbsp;&nbsp; Knowledge of lithium-ion battery technology and electrochemistry a plus.Qualifications•&nbsp;&nbsp;&nbsp; Currently working towards a BS, MS, or advanced degree in a relevant engineering program.•&nbsp;&nbsp;&nbsp; You must be self-managed and committed to working in a fast-paced environment.•&nbsp;&nbsp;&nbsp; Hands-on experience is a must.•&nbsp;&nbsp;&nbsp; Professional and positive communication skills.•&nbsp;&nbsp;&nbsp; Previous internship and/or project experience is a plus.•&nbsp;&nbsp;&nbsp; Ability to relocate to the Bay Area, California.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Tesla Motors",
	"division" : "Tesla Motors"
}