{
	"id" : "54392",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "ATLAS Software and Distributed Computing TR15-2-17",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "$ 1810 to $ 2710 per month plus 4% vacation pay",
	"frequency" : "Monthly",
	"job_description" : "TRIUMFCanada's National Laboratory for Particle and Nuclear Physics STUDENT JOB PROGRAM Summer 2015 job posting Job number TR15-2-17Student job title:&nbsp;&nbsp;&nbsp;&nbsp; ATLAS Software and Distributed ComputingName of project:&nbsp;&nbsp;&nbsp;&nbsp; Software Performance and Distributed Computing ToolsOverview:&nbsp;&nbsp;&nbsp;&nbsp; The ATLAS experiment at the Large Hadron Collider LHC) is studying&nbsp;&nbsp;&nbsp;&nbsp; proton-proton, proton-lead and lead-lead collisions at very high&nbsp;&nbsp;&nbsp;&nbsp; energy. The unprecedented energy densities created are allowing us to&nbsp;&nbsp;&nbsp;&nbsp; study the structure of matter at a much smaller scale than was&nbsp;&nbsp;&nbsp;&nbsp; previously possible, to extend investigations of the fundamental&nbsp;&nbsp;&nbsp;&nbsp; forces of Nature, to understand the origin of matter and to search for&nbsp;&nbsp;&nbsp;&nbsp; physics beyond the Standard Model (SM) of particle physics such as&nbsp;&nbsp;&nbsp;&nbsp; supersymmetry, quark substructure, and extra dimensions, to name a&nbsp;&nbsp;&nbsp;&nbsp; few. The experiment is collecting several Petabytes of raw data each&nbsp;&nbsp;&nbsp;&nbsp; year during LHC operations, and is producing several derived and&nbsp;&nbsp;&nbsp;&nbsp; simulated datasets that are of similar scale. The enormous amount of&nbsp;&nbsp;&nbsp;&nbsp; data generated by ATLAS is distributed and analyzed onto the Worldwide&nbsp;&nbsp;&nbsp;&nbsp; LHC Computing Grid infrastructure. The software and distributed&nbsp;&nbsp;&nbsp;&nbsp; computing platforms used by ATLAS are critical to its scientific&nbsp;&nbsp;&nbsp;&nbsp; success.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; More information about ATLAS can be found at http://atlas.ch/ and&nbsp;&nbsp;&nbsp;&nbsp; http://www.atlas-canada.ca&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Duties:&nbsp;&nbsp;&nbsp;&nbsp; The student will become familiar with the ATLAS research program and&nbsp;&nbsp;&nbsp;&nbsp; its software and distributed computing environments that are used to&nbsp;&nbsp;&nbsp;&nbsp; perform simulations and data analysis at the global scale. Develop&nbsp;&nbsp;&nbsp;&nbsp; tools to integrate a cloud computing platform into ATLAS distributed&nbsp;&nbsp;&nbsp;&nbsp; computing, including VM images optimization and performance testing&nbsp;&nbsp;&nbsp;&nbsp; (I/O and cpu); optimize the interface between the ATLAS distributed&nbsp;&nbsp;&nbsp;&nbsp; computing production system (used for simulation and analysis) and&nbsp;&nbsp;&nbsp;&nbsp; local resource management system (including testing of new LRMS&nbsp;&nbsp;&nbsp;&nbsp; solutions); data mining of ATLAS production and analysis jobs executed&nbsp;&nbsp;&nbsp;&nbsp; on Canadian resources and performance assessment.Skills learned during this work experience:&nbsp;&nbsp;&nbsp;&nbsp; The student will be introduced to the ATLAS software environment and&nbsp;&nbsp;&nbsp;&nbsp; distributed computing platforms and tools (Grid and Cloud computing)&nbsp;&nbsp;&nbsp;&nbsp; and its applications to perform intensive computational tasks and to&nbsp;&nbsp;&nbsp;&nbsp; store and access large amounts of data which is distributed all around&nbsp;&nbsp;&nbsp;&nbsp; the world.",
	"job_requirements" : "Qualifications:&nbsp;&nbsp;&nbsp;&nbsp; Ideally the student will have completed its second or third year in&nbsp;&nbsp;&nbsp;&nbsp; physics or computer science field or equivalent. Good computing and&nbsp;&nbsp;&nbsp;&nbsp; programming skills (C++ and/or Python) with experience and ease&nbsp;&nbsp;&nbsp;&nbsp; working under a UNIX environment (e.g. Linux) are also an asset.Shiftwork required: NoPeriod of Work: May - Aug 2015Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Salary is commensurate with academic progress and previous relevant work experience, and ranges from $ 1810 to $ 2710 per month plus 4% vacation pay. TRIUMF pays return air fare (this does not apply to Vancouver/Victoria students); for Vancouver Island students, TRIUMF will pay ferry costs.Due to the volume of applications we receive, the TRIUMF Job Number must be clearly indicated on the application.&nbsp;&nbsp;&nbsp;Applications must include:&nbsp;&nbsp;&nbsp; - a covering letter,&nbsp;&nbsp;&nbsp; - a resume&nbsp;&nbsp;&nbsp; - a copy of academic transcript (unofficial copies are accepted).A separate application must be submitted for each job the student wishes to be considered for.&nbsp;&nbsp;Incomplete applications may not be considered.&nbsp;&nbsp;This job is available to eligible students from an accredited post secondary institution in Canada. To be eligible, the student must be a Canadian Citizen or a Permanent Resident. Foreign students may apply, provided they have temporary resident status, where required, and are eligible to obtain a work permit.Company:TRIUMF",
	"division" : "TRIUMF Research Labs"
}