{
	"id" : "54391",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Firmware Internship / Co-Op (Summer 2015)",
	"job_location" : "Palo Alto, CA, USA",
	"number_of_positions" : "9",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "About TeslaTesla’s goal is to accelerate the world’s transition to electric mobility with a full range ofincreasingly affordable electric cars. California-based Tesla designs and manufactures EVs, as wellas EV powertrain components for partners such as Toyota and Daimler. Tesla has delivered over15,000 electric vehicles to customers in 31 countries. Model S is the world’s first premium sedanto be engineered from the ground up as an electric vehicle. Model S was named Motor Trend’sprestigious 2013 Car of the Year, achieved the best safety score of any car ever tested by theNHTSA, and Consumer Reports is calling it the best car it has ever tested.Tesla Motors is committed to hiring and developing top talent from across the world for any givendiscipline. Our world-class teams operate with a non-conventional automotive product developmentphilosophy of high inter-disciplinary collaboration, flat organizational structure, and technicalcontribution at all levels. You will be expected to challenge and to be challenged, to create, andto innovate. These jobs are not for everyone, you must have a genuine passion for producing thebest vehicles in the world.&nbsp; Without passion, you will find what we're trying to dotoo difficult.&nbsp;The RoleYou will develop firmware for Tesla’s current and next generations of battery management systems,charging systems, and autopilot program. You will work within the development team to automatetesting, implement new tests, and create innovative automated test systems. You will contribute tocross-functional system architecture, software system design, and rapid prototyping.Your application to the Firmware Engineering Internship will be considered for all opportunitiesacross Autopilot, Firmware, Gateway, Charging Systems, and Power Electronics teams in PaloAlto, CA.&nbsp;",
	"job_requirements" : "Required Skills•&nbsp;&nbsp;&nbsp; Proficiency in C/C++ and strong scripting skills in at least one common language (Python,Perl, Shell).•&nbsp;&nbsp;&nbsp; Familiarity with National Instrument Testing Software ( LabView, TestStand, VeriStand).•&nbsp;&nbsp;&nbsp; Experience designing and developing complex power electronics control systems including AC-DCand DC-DC converter topologies.•&nbsp;&nbsp;&nbsp; Experience designing real-time embedded systems in C.•&nbsp;&nbsp;&nbsp; Experience with CAN bus systems and associated tools.•&nbsp;&nbsp;&nbsp; Familiarity with automotive ECUs, especially those in hybrid and electric powertrains.•&nbsp;&nbsp;&nbsp; Experience with FPGA/CPLD device programming.•&nbsp;&nbsp;&nbsp; Ability to read and interpret electrical schematics and work efficiently with hardware designresources.•&nbsp;&nbsp;&nbsp; Capable of hands-on bring up, debug and code optimization.•&nbsp;&nbsp;&nbsp; Experience with DSPs, microcontrollers and realtime operating systems.•&nbsp;&nbsp;&nbsp; Familiarity with thermal control hardware, including compressors, pumps, andthermocouples are a plus.•&nbsp;&nbsp;&nbsp; Experience implementing real-time control strategies, especially PID based control developmentis a plus.•&nbsp;&nbsp;&nbsp; Familiarity with Vector analysis tools is a plus.•&nbsp;&nbsp;&nbsp; Prior AUTOSAR or other automotive RTOS embedded programming experience is a plus.Qualifications•&nbsp;&nbsp;&nbsp; Currently working towards a BS, MS, or advanced degree in a relevant engineering program.•&nbsp;&nbsp;&nbsp; You must be self-managed and committed to working in a fast-paced environment.•&nbsp;&nbsp;&nbsp; Hands-on experience is a must.•&nbsp;&nbsp;&nbsp; Professional and positive communication skills.•&nbsp;&nbsp;&nbsp; Previous internship and/or project experience is a plus.•&nbsp;&nbsp;&nbsp; Ability to relocate to the Bay Area, California.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Tesla Motors",
	"division" : "Tesla Motors"
}