{
	"id" : "54397",
	"application_deadline" : "Jan 21, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8, 12 or 16 months",
	"job_title" : "Front End Developer",
	"job_location" : "Vancouver - Mount Pleasant",
	"number_of_positions" : "1",
	"salary" : "Depends on experience",
	"frequency" : "Monthly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "Who are we?At Cumul8, we are building tools that enable people to make sense of their data. We operate at the intersection of world-class UX, information visualization, business intelligence and data science.&nbsp; Our unique design and technical approach, borne out of experience in the visual effects and videogame sectors, is now being applied to big data problems in a variety of industries. Disruptive innovation is our mantra.What will you do?You will help us build and improve the user experience for Cumul8, our Enterprise and SaaS solutions.You will work with a team of designers and programmers to implement and customize the user experience and workflow of Cumul8, write, test, and support code through the entire life cycle.What will your responsibilities be?● Design, build, and deploy a variety of web user interfaces with a great user experience● Write excellent code and deliver on time● Iterate with a small, experienced team to build pixel perfect layouts● Customize the front end to meet ongoing client feedback● Work with technologies, such as Node.js, Javascript, HTML5, CSS (LESS) and React",
	"job_requirements" : "What qualifications are we looking for?● Experience with front end MVC frameworks such as React, Backbone, Angular, or Ember● Experience using Javascript, CSS3 (LESS), HTML5● Knowledge of cross-browser support and layout design paradigms● Passion for performance debugging and benchmarking● Passionate about great design●&nbsp;Strong customer focus and interpersonal skills● Bonus: Interest in data visualization&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:40",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):If available, please include a link to your GitHub, LinkedIn profile or portfolio website.Company:Gener8 Digital Media Corp.",
	"division" : "Gener8 Digital Media Corp.",
	"website" : "www.cumul8.com"
}