{
	"id" : "54402",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Associate Engineer Web Applications ? 8 Month Internship Opportunity",
	"job_location" : "Sunnyvale, CA, USA",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "About The Team:We’re a small engineering team looking for someone who’s excited about delivering products and user experiences that exceed expectations. As an Associate Engineer in the Web Applications team, you’ll be responsible for refining, evolving and innovating new features to improve the speed and functionality of our software applications.&nbsp; By utilizing your expertise with all aspects of the software development lifecycle (architecture through release) and your strong coding skills, you will influence internal teams to develop software that will take our job seeker and employer experiences to the next level.&nbsp; You’ll play a key role in establishing Simply Hired as a pivotal and unmatched resource for both job seekers and employers.&nbsp;We value insight driven innovation, collaboration, and feedback. This is a place where individual passion to improve lives directs our collective curiosity which fuels the ideas and projects we use our talents to deliver.&nbsp;Although we’re an established company, in a lot of ways we still act like a start up. Our organization and processes are fluid, allowing us to act quickly on emerging business opportunities. This should genuinely excite you. If so, let's talk...&nbsp;About Simply Hired:Simply Hired®, a technology company based in Sunnyvale, California, operates job search engines in 24 countries and 12 languages. With more than 30 million unique visitors per month, the company provides job seekers access to over 8 million job openings across all job categories and industries, reaching job seekers on the web, social networks, mobile devices, email, and via thousands of partner sites including LinkedIn, The Washington Post, and Bloomberg Businessweek. With its Sponsored Jobs offering, Simply Hired enables employers to efficiently and cost-effectively reach candidates searching for jobs through its full-service and self-service pay-per-click (PPC) job advertising solutions. Simply Hired was founded in 2005, has offices in Sunnyvale, Los Angeles, New York and Toronto, and is privately held with funding from Foundation Capital and IDG Ventures. For more information, visit&nbsp;www.simplyhired.com.&nbsp;&nbsp;Responsibilities:&nbsp;Research, validate and recommend key technology decisions for our core applications and customer facing offeringsDefine technical scope of products and their featuresActively contribute to software development (using open-source software, such as Python/Django, PHP, Linux, MySQL, and TCP/IP, HTTP, etc.) that engages and delights our usersDesign, implement and test core componentsCreate new applications which&nbsp;leverage our core infrastructure in new and exciting waysCreate slick and fast front-ends for our consumer site, partner portals, and monetization systemBring SDLC best practices to our web applications development teamWork with Operations team to ensure smooth deployment of product releases and updates",
	"job_requirements" : "About You:&nbsp;You are confident, creative and a proven collaborator.&nbsp; You’re passionate about knowing your customer. You constantly seek new insights which you use to create breakthroughs.&nbsp;You’re self-aware and constantly working to understand and overcome blindspots. You’re an active listener yet you speak candidly and challenge assumptions with honesty, an even-temperedness, and grace that encourage others to seek you out for collaboration.&nbsp;You’re flexible, adaptable, and creative. You can move swiftly from a high-level strategy discussion to tactical implementation details, with equal passion and persuasion. You seek clarity for ideas to serve as a catalyst for collaboration. Most importantly you back up your words with action.&nbsp;Qualifications:&nbsp;Experience with Linux, MySQL, PHP, Python/Django, Apache is a plusHands-on experience developing with XHTML, CSS, JavaScript and AJAXExperience in an Agile software development environment in a web contextDemonstrated expertise with the entire software development lifecycleMust be pursuing a Bachelor’s or Master’s degree in Computer Science or related field&nbsp;Benefits:Simply Hired will handle immigration and visa paperwork, as neededFree lunch each day; fully stocked snacks and beveragesParticipate in initiatives like Hack Day, user testing, and even ping pong tournamentsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Simply Hired, Inc.",
	"division" : "Toronto Office",
	"website" : "www.simplyhired.com"
}