{
	"id" : "54408",
	"application_deadline" : "Jan 25, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Enterprise & International Applications Planning Coordinator (Summer) (80194)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "CO-OP STUDENTSEnterprise & International Applications Co-op&nbsp;Project StreamRBCTechnology and Operations Student Program&nbsp;At RBC we know that to excel, we must first create: opportunities for growth; environments that foster collaboration and rewards that recognize achievement.&nbsp; We have the resources employees need to reach their full potential, enabling them to deliver outstanding service to our clients and create careers they can take pride in.&nbsp;Technology and Operations (T&O) plays a critical role in the day to day activities that align with RBC’s business strategies, outcomes and objectives to ensure continued focus on enabling leading advice and service for RBC clients that is backed by technological and operational excellence.&nbsp;TECHNOLOGY AND OPERATIONS STUDENT PROGRAM&nbsp;In the search for its future leaders, Technology and Operations is offering a brand new Student Program which offers career-defining opportunities to build upon your dynamic critical thinking and interpersonal skills, while learning the ‘business behind the banking’.&nbsp;Technology and Operations is looking to build a strong team to sustain its promising future, and is interested in high-performing students who are willing to explore this opportunity as a career during their student work term.&nbsp;Apply your talents and expertise for the opportunity to:Gain in-depth knowledge of the ‘business behind the banking’Collaborate with teams around the globeIdentify key opportunities for improvement and provide creative solutions to business issues&nbsp;As a result of the diversity within Technology and Operations, we are excited to introduce the Technology and Operations Student Program which offers positions within four unique streams!&nbsp;1. &nbsp;Project-Based:&nbsp; Opportunity to work in a fast-paced project environment where typical roles include Business Analyst, Business Systems Analyst, Project Control Officer, or Project Manager2. &nbsp;Operational Execution:&nbsp; Lift the hood and discover the nuts and bolts of how the bank operates while improving your eye for operational and process efficiency with teams managing essential client experience such as. Typical roles would include Operations Analyst, Business Process Analyst, Junior Process Analyst.3. &nbsp;Technical:&nbsp; Looking for students interested in applying their technical skills in the world of IT infrastructure. Typical roles would include: Technical Systems Analyst, Business Systems Analyst, Quality Assurance Analyst.4.&nbsp; Specialized: Try out a unique opportunity in a specialized field. Area’s you could work in are: &nbsp;Business Continuity Management or Interbank Operations. Typical roles would include: Business Systems Analyst, Junior BCM (Business Continuity Management) Analyst.&nbsp;ABOUT THE OPPORTUNITY&nbsp;Enterprise & International Applications, a business team within Technology and Operations, is currently seeking a bright, Co-op Student who is ready to embrace this exciting opportunity with room for growth and development.&nbsp;Are you currently enrolled in a Co-op Program with your school?&nbsp; Is your major in Business, Finance or Project Management? Are you available for a 4-month work term starting in May? If you answered YES to ALL these questions, check out the job description below!&nbsp; If you fit this profile and are interested, apply today!&nbsp;THE PURPOSE:Purpose of this position is to provide assistance to the Sr. Manager, EIA Planning, Control and Compliance and the larger extended Planning Team for EIA.&nbsp;WHAT YOU WILL BE DOING:&nbsp;To assist the Sr. Manager, EIA Planning, Control and Compliance in:Coordinating and completing of a review and update of all SharePoint sites within&nbsp;the EIA Planning&nbsp;group.Following up on measures, metrics and reporting anomaliesDocumenting and communication Cost Savings ideas and opportunities.Data analysis and communicationUpdating Communications for the group via different media, newsletters, social networking site, intranet.Gathering best practices with respect to communication from those People Managers who do it really wellBuilding a process to support excellent communication amongst our people managers, group moderators, and site managersCommunicating process improvements as necessaryThey will report to me, but work with the extended EIA Planning TeamThere may also be other duties as assigned with respect to analyzing and communicating metric results, looking for and building communication around improvement in process.",
	"job_requirements" : "WHAT YOU NEED TO SUCCEED:&nbsp;Senior Student entering their 3rd or 4th YearAnalytical thinkingTechnical and Business SavvyExcellent skills in excel or accessExcellent knowledge of social media, sharepoint, collaboration toolsProcess orientationGood organizational skillsGood people skillsGood communication skillsKnowledge and Experience with process mapping, process development or process improvement would be an assetKnowledge and Experience with MS Office Tool Suite, HTMLOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:37.5",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://career8.successfactors.com/sfcareer/jobreqcareerpvt?jobId=80194&company=RBC&username=&st=4DB541DF974E351C105BA6CBDB9F9FF6C049EA53",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):How to Apply: &nbsp;Please submit your cover letter and resume&nbsp;to be considered for this opportunity!&nbsp;We thank all interested candidates; however, only those selected for an interview will be contacted.&nbsp;Please submit your cover letter, resume, and academic transcripts online at www.rbc.com/careersby&nbsp;January 25th, 2015.&nbsp;In order for your application to be considered, please specify the university or college you are currently attending and your program of study on the application form.&nbsp;At RBC diversity and inclusion are at the heart of bringing out the best in all our people.&nbsp;Diversity and Equal Opportunity Employment:RBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, national origin, age, disability, protected veterans status or any other legally-protected factors. Company:RBC Financial Group",
	"division" : "Head Office",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):80194"
}