{
	"id" : "54409",
	"application_deadline" : "Jan 25, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Technical Systems Analyst (Co-op) (81803)",
	"job_location" : "Mississauga, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "&nbsp;Key Accountabilities:&nbsp;Support and Consulting:&nbsp;Application design and coding using .NetCode deployment preparation for multiple environmentsScripting and JCL changes across multiple environmentsAutomation of manual operational proceduresPlatform batchCreate MS SQL server queries – SQL InquiryMonitor dedicated mailbox for errors in QA/PROD regions&nbsp;Documentation:&nbsp;Responsible for documenting procedures for sharing knowledgeDocument procedures for keeping various environments in sync",
	"job_requirements" : "",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:37.5",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://career8.successfactors.com/sfcareer/jobreqcareer?jobId=81803&company=RBC&username",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):We thank all interested candidates; however, we will only contact those being considered for an interview.&nbsp;Diversity:Diversity in the workplace, one of our shared values, lies at the heart of our rewarding, open, supportive and inclusive work environment. We respect and respond to the many competing and evolving priorities in our lives so you can focus on what you can do best – put clients first. &nbsp;EOE/M/F/D/VCompany:RBC Financial Group",
	"division" : "Head Office",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):81803"
}