{
	"id" : "54406",
	"application_deadline" : "Jan 25, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Technology Solutions Analyst (Summer) (79934)",
	"job_location" : "Mississauga, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Technology Solutions Analyst, Enterprise & International ApplicationsRBCTechnology and Operations&nbsp;At RBC we know that to excel, we must first create: opportunities for growth; environments that foster collaboration and rewards that recognize achievement.&nbsp; We have the resources employees need to reach their full potential, enabling them to deliver outstanding service to our clients and create careers they can take pride in.&nbsp;In Technology and Operations (T&O) plays a critical role in the day to day activities that align with RBC’s business strategies, outcomes and objectives to ensure continued focus on enabling leading advice and service for RBC clients that is backed by technological and operational excellence.&nbsp;Enterprise & International Applications, a business team within Technology and Operations is currently seeking a bright, Co-op Student who is ready to embrace this exciting opportunity with room for growth and development.&nbsp; If you fit this profile and are interested, apply today!&nbsp;THE PURPOSE:This position entails providing support for the management of a portfolio of applications to ensure compliance with regulatory, enterprise and local standards.&nbsp; This includes status reporting, documentation of existing processes, creation of new processes, management of change, as well as identifying opportunities for improving the existing processes.&nbsp;&nbsp;WHAT YOU WILL BE DOING:Supports the Application Portfolio Manager in planning, executing, controlling various aspects of the portfolio management cycle. Participates in portfolio management planning and development sessions (strategic, tactical plans, budgeting),Supports the portfolio by identifying application related dependencies and constraints.Assist with the management of risk/impact to the application portfolio from enterprise initiated changes/activities by ensuring compliance with regulatory and audit related activities,Design and implement appropriate process and management controls to enable more effective management of outsourced vendor contracts for example, Reports of adherence to agreed upon Service Level Agreement’s(SLA),This role might involve some opportunities for software development but is&nbsp;primarily nota software development role.Documentation of new and existing processes.",
	"job_requirements" : "WHAT YOU NEED TO SUCCEED:Working towards a Bachelor’s degree in Computer Science, Information Management or equivalent.1-2 years software development experience,Strong understanding and knowledge of current infrastructure and technology platforms (windows and/or mainframe),Good understanding of the software development life cycle and the various phases from requirements gathering to deployment,Ability to think outside the box to develop creative and innovative solutions to problems.Knowledge of ITIL will be an asset,Willingness and ability to work two consecutive works terms will be an asset.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:37.5",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://career8.successfactors.com/sfcareer/jobreqcareerpvt?jobId=79934&company=RBC&username=&st=E1FF5C2670B0BCC82C403760CEE1E15ACF6A6CD0",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):How to Apply:Please submit your cover letter and resume to be considered for this opportunity!We thank all interested candidates; however, only those selected for an interview will be contacted.&nbsp;At RBC diversity and inclusion are at the heart of bringing out the best in all our people.&nbsp;Is your major in Computer Science or Engineering? Are you available for a 8-month work term starting in May?&nbsp; If you answered YES to ALL these questions, we have an exciting opportunity for you available in RBC Technology & Operations!&nbsp;Diversity:Diversity in the workplace, one of our shared values, lies at the heart of our rewarding, open, supportive and inclusive work environment. We respect and respond to the many competing and evolving priorities in our lives so you can focus on what you can do best – put clients first. &nbsp;EOE/M/F/D/VCompany:RBC Financial Group",
	"division" : "Head Office",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):79934"
}