{
	"id" : "54405",
	"application_deadline" : "Jan 25, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Technical Systems Analyst (Co-op) (81289)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Technical Systems Analyst, Technical StreamRBCTechnology and Operations Student Program&nbsp;At RBC we know that to excel, we must first create: opportunities for growth; environments that foster collaboration and rewards that recognize achievement.&nbsp; We have the resources employees need to reach their full potential, enabling them to deliver outstanding service to our clients and create careers they can take pride in.&nbsp;Technology and Operations (T&O) plays a critical role in the day to day activities that align with RBC’s business strategies, outcomes and objectives to ensure continued focus on enabling leading advice and service for RBC clients that is backed by technological and operational excellence.&nbsp;TECHNOLOGY AND OPERATIONS STUDENT PROGRAM&nbsp;In the search for its future leaders, Technology and Operations is offering a brand new Student Program which offers career-defining opportunities to build upon your dynamic critical thinking and interpersonal skills, while learning the ‘business behind the banking’.&nbsp;Technology and Operations is looking to build a strong team to sustain its promising future, and is interested in high-performing students who are willing to explore this opportunity as a career during their student work term.&nbsp;Apply your talents and expertise for the opportunity to:Gain in-depth knowledge of the ‘business behind the banking’Collaborate with teams around the globeIdentify key opportunities for improvement and provide creative solutions to business issues&nbsp;As a result of the diversity within Technology and Operations, we are excited to introduce the Technology and Operations Student Program which offers positions within four unique streams!&nbsp;1. &nbsp;Project-Based:&nbsp; Opportunity to work in a fast-paced project environment where typical roles include Business Analyst, Business Systems Analyst, Project Control Officer, or Project Manager2. &nbsp;Operational Execution:&nbsp; Lift the hood and discover the nuts and bolts of how the bank operates while improving your eye for operational and process efficiency with teams managing essential client experience such as. Typical roles would include Operations Analyst, Business Process Analyst, Junior Process Analyst.3. &nbsp;Technical:&nbsp; Looking for students interested in applying their technical skills in the world of IT infrastructure. Typical roles would include: Technical Systems Analyst, Business Systems Analyst, Quality Assurance Analyst.4.&nbsp; Specialized: Try out a unique opportunity in a specialized field. Area’s you could work in are: Business Continuity Management or Interbank Operations. Typical roles would include: Business Systems Analyst, Junior BCM (Business Continuity Management) Analyst.&nbsp;ABOUT THE OPPORTUNITY&nbsp;Enterprise & International Applications, a business team within Technology and Operations, is currently seeking a bright, Co-op Student who is ready to embrace this exciting opportunity with room for growth and development.&nbsp;Are you currently enrolled in a Co-op Program with your school?&nbsp; Is your major in Computer Science, Engineering or Programming? Are you available for a 4-month work term starting in May? If you answered YES to ALL these questions, check out the job description below!&nbsp; If you fit this profile and are interested, apply today!&nbsp;THE PURPOSE:&nbsp;This Co-op position will be responsible for assisting the IT operations and production support team within RBC Insurance, Life and Health IT.The candidate will be working with three different application areas to support their day to day activities.&nbsp; The role involves working with Operation team to support, maintain and monitor a complex suite of development regions.&nbsp;WHAT YOU WILL BE DOING:&nbsp;Support and Consulting:Application design and coding using .NetCode deployment preparation for multiple environmentsScripting and JCL changes across multiple environmentsAutomation of manual operational proceduresPlatform batchWebmaster for team SharePoint SiteCreated MS SQL server queries – SQL InquiryMonitor dedicated mailbox for errors in QA/PROD regionsMaintain deployment spreadsheetWrite deployment scripts (j-script, .bat, ,com, .Net)&nbsp;Documentation:Responsible for documenting procedures for sharing knowledgeDocument procedures for keeping various environments in syncKey Organization Relationships:Reports to: Manager, Insurance IT, Life and HealthPartners include: QA Team Members, Application Development/Maintenance Teams, DBA, Business Representatives&nbsp;",
	"job_requirements" : "WHAT YOU NEED TO SUCCEED:&nbsp;Behavioural Competencies:Achievement MotivationAnalytical ThinkingAble to work on multiple tasks and prioritizeInformation SeekingInitiativeTeamwork & CooperationOrganizational skill&nbsp;Education/Experience:Currently enrolled a co-operative education program in the field of Computer Science or related fieldPrevious IT Systems experience preferred but not requiredExposure to Mainframe environment would be an assetFamiliar with Java Scripts, .Net, or JavaWindows 2008/2012 server experienceSharePointMicrosoft Office SuiteInsurance business exposure will be an asset&nbsp;Systems Knowledge:IT Standards and Development MethodologiesProgramming experience with any of the following (.Net, Java and J-Script) an assetFamiliar with SQL coding (MS Sequel Server)Windows 2008/2012 server experienceMicrosoft Office SuiteOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://career8.successfactors.com/sfcareer/jobreqcareerpvt?jobId=81289&company=RBC&username=&st=BC337A48A657AA061177031EEF1E4F0C157057DB",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):How to Apply: &nbsp;Please submit your cover letter and resume.&nbsp;We thank all interested candidates; however, only those selected for an interview will be contacted.&nbsp;Please submit your cover letter, resume, and academic transcripts online at www.rbc.com/careersby January 25th, 2015.&nbsp;In order for your application to be considered, please specify the university or college you are currently attending and your program of study on the application form.&nbsp;At RBC diversity and inclusion are at the heart of bringing out the best in all our people.&nbsp;Diversity and Equal Opportunity Employment:RBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, national origin, age, disability, protected veterans status or any other legally-protected factors. Company:RBC Financial Group",
	"division" : "Head Office",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):81289"
}