{
	"id" : "54403",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Student Co-Op Position - Engineering",
	"job_location" : "North Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Student Co-Op Position - EngineeringPowell Canada is a large and growing electrical manufacturing company with offices based in across Canada. We design, manufacture and package equipment and systems for the distribution, control, generation and management of electrical energy and other dynamic processes. We work with large industrial customers such as oil and gas producers, refineries, petrochemical plants, pulp and paper mills, transportation facilities, and public and private utilities.Our North Vancouver office is responsible for experimental research and product development activities for our emerging sensing and control product suites. These products constitute highly integrated electronics and sensors along with proprietary technologies which splice into our existing product lines.&nbsp; The environment is fast-paced, dynamic and extremely rewarding.A co-op position is open for either a 4 or 8 month term, depending on the candidate’s availability.&nbsp; The exact scope of work will be highly tailored to the successful candidate’s skill-set and preferences in conjunction with the immediate needs of the R&D group.&nbsp; A hands-on skillset with an interest / background in electronics and hardware is required. This opportunity is ideal for those looking to gain experience in industrial applications of technology.Essential Responsibilities:•&nbsp;&nbsp; &nbsp;Debugging and troubleshooting prototype electronics hardware.•&nbsp;&nbsp; &nbsp;Designing and implementing rigorous test procedures for early-stage products.•&nbsp;&nbsp; &nbsp;Developing algorithms for industrial applications.•&nbsp;&nbsp; &nbsp;Validating design and performance of production test jigs / tooling.•&nbsp;&nbsp; &nbsp;Documenting test results and refining future testing based on results.•&nbsp;&nbsp; &nbsp;Completing tasks associated with the completion of an engineering design cycle.&nbsp;",
	"job_requirements" : "NSERC Eligibility required.To be NSERC eligible, you must fulfill the following three requirements:&nbsp;&nbsp; * Have Canadian citizenship or permanent residency in Canada&nbsp;&nbsp; * Have obtained a cumulative average of 68% (or B- grade) or higher.&nbsp;&nbsp; * Have not received a NSERC award in the current fiscal year (April 1, 2014 to March 31, 2015)should you not meet any one of the above requirements, please do not apply for this position.---------------------------------------------------&nbsp;Qualifications:•&nbsp;&nbsp; &nbsp;Candidate must be at the 2nd year or higher level in studies in an engineering discipline.&nbsp; Suitable candidates will likely be enrolled in Electrical Engineering, Engineering Physics or Mechatronics disciplines.&nbsp; &nbsp;•&nbsp;&nbsp; &nbsp;Experience at working both independently and in a team-oriented, collaborative environment is essential and have strong interpersonal skills.•&nbsp;&nbsp; &nbsp;Can conform to shifting priorities, demands and timelines through analytical and problem-solving capabilities.•&nbsp;&nbsp; &nbsp;Strong written and oral communication skills and experience with Microsoft Office•&nbsp;&nbsp; &nbsp;Ability to effectively prioritize and execute tasks in a high-pressure environment is crucial.•&nbsp;&nbsp; &nbsp;Must be NSERC elligibleSuccessful candidates must have legal authorization to work in Canada on a full-time basis for any employer, only those candidates selected for an interview will be contacted. Powell Canada, Inc is an equal opportunity employer.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Powell Canada Inc.",
	"division" : "Vancouver Office",
	"website" : "http://www.powellind.ca/"
}