{
	"id" : "54404",
	"application_deadline" : "Jan 31, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "16 months",
	"job_title" : "Supply Chain 16 Month Internship Program",
	"job_location" : "Calgary",
	"number_of_positions" : "1",
	"salary" : "$20-$35",
	"frequency" : "Hourly",
	"industry" : "Oil & Gas",
	"company_type" : "Private Business",
	"job_description" : "Supply Chain 16 Month Internship Program (Requisition #: 13949)Program Purpose and OutlineSupply Chain Internship program is designed to provide a complete experience in the Strategic Sourcing process from need identification through market research, end to end competitive procurement process and program rollout to the Business Unit staff.The program will also provide exposure to and use of key supporting Supply Chain systems including SAP Procurement; SAP Contract Lifecycle Management (CLM); Ariba E-Procurement suite, and additional supporting integrated systems and processes.As part of the Supply Chain process the Internship participants will also receive exposure to contract management, contract administration; master data management; and inventory and materials management.&nbsp; A key aspect will be to provide a thorough involvement in practical, tangible work and processes within the total Husky Energy Supply Chain.Opportunity LocationThe 16 month Supply Chain Internship position is located in Calgary, Alberta.&nbsp;The Field Operations rotation will require relocation for a three to four month period at a Husky operating production plant location.*Please submit your application at http://jobs.huskyenergy.com/*",
	"job_requirements" : "Candidate RequirementsInternship candidates are preferably completing their third year of a four year University program, with a specialization or confirmed interest in Supply Chain Management or Engineering program career. Candidates should be comfortable in MS Excel, databases and have a strong interest in analytical methods.Candidates will have the ability to complete a 16 month Internship program that includes the rotations outlined below:Category Management – Strategic Sourcing&nbsp;Field Operations - Procurement and Materials ManagementGovernance and Enablement – Sourcing AnalyticsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:05/04/2015",
	"end_date" : "08/31/2016",
	"hours_per_week" : "0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://jobs.huskyenergy.com/",
	"company" : "Husky Energy Inc.",
	"division" : "Head Office"
}