{
	"id" : "54400",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8, 12 or 16 months",
	"job_title" : "Live operations/Software Development Internship",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "Competitive",
	"frequency" : "Monthly",
	"job_description" : "The Company: &nbsp;Demonware is an industry leading company specializing in networking software and services for computer game development. We design, develop and host custom online features and services for some of the top video game franchises in the world, including Call of Duty, Diablo III and Skylanders.&nbsp;Demonware currently has 469+ million registered users, in excess of 3.2 million concurrent connected users, manages 4,000+ physical servers, and responds to 10,000+ database queries per second with an average response time of less than 0.02 seconds. Demonware is a technology- driven company, with core focuses on Python, Erlang, C++, MySQL and Linux, and a strong commitment to Open Source.&nbsp;Demonware has offices in Dublin, Ireland, Vancouver, Canada and Shanghai, China and is a wholly-owned subsidiary of Activision Blizzard Inc.&nbsp;Big company challenges, small company culture Demonware hosts millions of concurrently connected users. We’re a technology-driven company, with core focuses on C++, Python, Erlang, Linux, and MySQL. We solve tough problems on a day to day basis, and interns have a big impact on what we do. We’ve had interns commit code and have it running in production within the first 3 days of joining.&nbsp;We also like to have fun while we’re working hard. We wear what we want to work, we have flexible hours, and we have kickass coffee.&nbsp;“We get to work with large distributed systems, debug them, and have to visualize them in our heads – things you wouldn’t have exposure to or get to touch in any other workplace. The work is challenging, and you get to work alongside highly experienced people…”- Tyler Dixon, intern, 16 months&nbsp;The Role:Writing client− and server−side code to support multiplayer features, as well as tools that help game studios integrate multiplayer features into their title.Developing plugins and extending our automation frameworkDeveloping core features for our allocation and provisioning systemsCreating tools to automate all the things!&nbsp;Position Type:Regular Co-op, Full Time hours, 4 Months / 8 Months / 12 Months / 16 MonthsSalary:CompetitiveHours per week:35-40Location:VancouverStart Date:May 2015Here are just a few of the perks of working at Demonware:Complimentary breakfast, lunch, and drinks from a fully stocked kitchenBBQs and friendly beer o’clock FridaysCity-centre office locationVacation allowanceCompetitive payFree games&nbsp;Relocation assistance: we provide assistance to students relocating to Vancouver in the form of return flights and two weeks of accommodation&nbsp;",
	"job_requirements" : "Requirements:Excellent Programming &nbsp;skillsA good grasp of the fundamental algorithms and data structuresFamiliar with LinuxExcellent debugging and analytical skillsCan identify complex problems and find simple solutionsAdditional assets: Understanding of SQL−based databases (MySQL preferred)Has an understanding of networking technologies, e.g. TCP, UDPHas experience with multi−platform software developmentHas experience with security and scalabilityHave an understanding of SQL and relational databasesHave experience developing REST web servicesFamiliarity with the physical world, switches, servers (x86 architecture for example)&nbsp;All candidates must:Be familiar with source control (Git preferred)Work comfortably in a Linux/Unix environment &nbsp;(CentOS/Ubuntu)Be able to clearly communicate technical concepts in plain EnglishEnjoy working as part of a team in a high-pressure environmentBe self-motivated, and can take on projects with minimal supervisionThe ideal candidate may not have the complete list of bullet points mentioned above, but more generally speaking, we’re looking for the same qualities that Joel Spolsky looks for: “smart, and get things done”. For that reason, we welcome you to apply even if your work experience is limited and you haven’t yet built up a mile-long resume.&nbsp;Please list any additional experience you have with Linux at home (for example, any projects you have done), any programming-related hobbies and the resulting projects, any interesting school projects you worked on, and any open source involvement and a link to your code repository and / or blog.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:35",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):You can apply through your school Coop Department by submitting:&nbsp;ResumeCover letter (optional but preferred)Transcripts of grades from your University&nbsp;As part of the application process, you will need to complete a Coding Challenge. Once you have completed the test, your results will be reviewed by our hiring managers along with your resume/cover letter/transcripts.&nbsp;Below you will find a link to the Codility site where the challenge is hosted. You will need a full 90 minutes of uninterrupted time to complete the challenge. We recommend that you try the demo on the site before attempting the official test.&nbsp;Once you click on the actual test linkbelow you will see welcome screen which contains an option to Try demo button. You will need to complete the actual test in order for us to review your application.&nbsp;DemonWare Codility Test:Demonware Codility Challenge- May 2015&nbsp;The interview:&nbsp;The interview will be 1 hour, either in person (ideally) or via phone or skype for out of town applicants. For the in person interview, there is no need to wear a suit; ours is a very informal environment.&nbsp;The team will be interested in learning about recent projects you have been involved in, as well as your technical skills (please highlight any experience you have with Python or Linux - these are not required but highly desirable). We’re looking for smart people who get things done.&nbsp;Company:DemonWare",
	"division" : "Activision-Blizzard",
	"website" : "www.demonware.net"
}