{
	"id" : "54407",
	"application_deadline" : "Jan 25, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "RBC Technology & Operations - Corporate Systems Program (Co-op) (79735)",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "At RBC we know that to excel, we must first create; opportunities for growth, environments that foster collaboration, and rewards that recognize achievement.&nbsp; We have the resources employees need to reach their full potential, enabling them to deliver outstanding service to our clients and create careers they can take pride in.&nbsp;Technology and Operations (T&O) plays a critical role in the day to day activities that align with RBC’s business strategies, outcomes and objectives to ensure continued focus on enabling leading advice and service for RBC clients that is backed by technological and operational excellence.&nbsp;Corporate Systems has global responsibility for technology services to the following diverse functions; Risk, Finance, Compliance, Corporate Treasury, Human Resources, Fraud Detection and Procurement.&nbsp;Corporate Systems Co-op Program&nbsp;In the search for its future leaders, Corporate Systems is offering a co-op program for undergraduates with career-defining opportunities to build upon their dynamic critical thinking and interpersonal skills.&nbsp; This program offers the opportunity to learn about the financial sector and how technology is being used to deliver innovative solutions that differentiate RBC from its global competitors.&nbsp;The Corporate Systems Co-op Program&nbsp;provides the opportunity placement in a variety of streams, supporting technology services to one or more functional areas in the business.&nbsp;&nbsp;The Corporate Systems Co-op Programoffers positions within the following five unique streams:&nbsp;Technical – Technical Systems Analyst, DeveloperBusiness&nbsp; - Business Systems AnalystProject-Based – Project ManagementQuality Assurance – Quality Assurance AnalystSupport – Support Analyst&nbsp;Apply your talents and expertise for the opportunity to:&nbsp;Gain in-depth knowledge of the key functions that support a large banking organizationCollaborate with teams around the globeIdentify key opportunities for improvement and provide creative technology solutions to business issues&nbsp;",
	"job_requirements" : "Qualifications&nbsp;All interested candidates must be able to demonstrate the following to be considered for interview:&nbsp;Practical experience with an object oriented programming language (Java, C#, C++)ORApplied experience in project managementAn interest in, or experience with financial markets and the use of technology to solve business problems&nbsp;Additionally, successful candidates should possess the following:&nbsp;Leadership acumen and a passion to apply it in a dynamic business environmentExcellent interpersonal and highly developed communication skills (verbal and written)Confidence in working autonomously or as member of a teamCapability to manage multiple priorities across a number of assignments and prioritize effectivelyAbility to resolve any minor conflicts/issues and escalate to others as appropriate&nbsp;Upon completion of the Corporate Systems co-op placement, you may have the opportunity to build your career at RBC through the Corporate Systems Rotational Program once you graduate. If you want to be a part of our exciting team and gain career-defining exposure to the RBC Technology & Operations business, please apply to this opportunity.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://career8.successfactors.com/sfcareer/jobreqcareerpvt?jobId=79735&company=RBC&username=&st=02736993B8E079AAE9025CA1A60DA9AD7DDF9CD8",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):&nbsp;In order for your application to be considered, please specify the university or college you are currently attending and your program of study on the application form.&nbsp;&nbsp;We thank all interested candidates; however, only those selected for an interview will be contacted.&nbsp; At RBC, diversity and inclusion are at the heart of bringing out the best in all our people.&nbsp;Diversity and Equal Opportunity Employment:RBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, national origin, age, disability, protected veterans status or any other legally-protected factors. Company:RBC Financial Group",
	"division" : "Head Office",
	"additional_informationemployer's_internal_job_code_(if_applicable)" : "ADDITIONAL INFORMATIONEmployer's Internal Job Code (if applicable):79735"
}