{
	"id" : "54415",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Software Engineer Co-op",
	"job_location" : "Vancouver",
	"number_of_positions" : "4",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "Axiom Zen is a team of experienced software architects, engineers, and designers who like to workon&nbsp;experimental, cutting­edge projects. With low hierarchy and an open, supportive environment, we cangive you space to create the best work of your life.Working alongside some of the best talent in the world, you will drive rewarding projects forward,impacting lives and expanding the frontiers of technology. Your experience at Axiom Zen will berewarding, challenging, and fun.Position DescriptionAxiom Zen is a best practices­driven engineering team (committed to continuous deployment,continuous integration, automated testing, etc), looking for talented and startup­minded iOSdevelopers to join our growing team ­­ in Vancouver, BC; San Francisco, CA; or Santiago, Chile.If you're a talented, hard­working, and creative builder with a demonstrated record of achievement,Axiom Zen might be the place for you to jump­start your career.About UsAxiom Zen is an idea catalyst: we build, launch, and accelerate iconic companies.We are thinkers and builders; artisans and architects. Reflecting Vancouver and San Francisco, thetwo dynamic cities that surround us, we are a diverse, multi­faceted, and multi­national team withan&nbsp;extraordinary range of perspectives and experiences.Our team of creatives have built complex infrastructure and award­winning applications servingmillions of&nbsp;delighted users, working with industry giants like Apple, Google, Baidu, and Facebook.Axiom Zen team members have also helped build, grow, and successfully exit multiple technologystartup companies, generating hundreds of millions of dollars in shareholder value and giving ourteam a unique perspective on product ideation, launch, and iteration to market fit.Let’s build the future together.Perks and Benefits:We provide exceptional benefits:●&nbsp;&nbsp;&nbsp;&nbsp; Top­tier healthcare. Full health, life and AD&D insurance as well as premium vision, dental,and extended health care.●&nbsp;&nbsp;&nbsp;&nbsp; Personal development budget. We actively participate in the development of our team. You haveaccess to a Professional Development budget of $400 per quarter allocated, separate from yourcompensation, to be spent on conferences, classes, books, and any other resources to maintain andexpand your skill set, industry knowledge, and professional growth. Or take someone interesting tolunch or coffee for in­person learning●&nbsp;&nbsp;&nbsp;&nbsp; Flexible Vacation and Remote Work Policy. We support work­life harmony and also believe inbalance. Make your impact consistently and we’re totally flexible on time off. Minimum of 2 weeksevery year, with no limit.●&nbsp;&nbsp;&nbsp;&nbsp; Speaker Travel Budget. We believe strongly that all our team members should have theopportunity to become thought leaders in their fields. To support this, we have a standard policyto cover travel + accommodations for speaking engagements anywhere in the Americas, and are verywilling to support speaking engagements elsewhere around the world as well.●&nbsp;&nbsp;&nbsp;&nbsp; “Live the Brand” Experiences. [Axiom Zen Canada] Several times per week, the team engages infun and exciting products & experiences sponsored by the company. Everyone has the opportunity tosubmit ideas. We believe time outside of the office helps us think outside the box.●&nbsp;&nbsp;&nbsp;&nbsp; “Live the Brand” Products. We also believe that using great products helps us build thembetter. Every team member receives a generous equipment budget to try new gadgets, tools,platforms, and products.●&nbsp;&nbsp;&nbsp;&nbsp; Maternity / Paternity Leave.&nbsp; Flexible leave in addition to existing leave allowance inaccordance with state and federal laws.●&nbsp;&nbsp;&nbsp;&nbsp; Commuter Reimbursement. We cover public transport to work and back. If you bike to workinstead, we set aside $1000/year for bike maintenance.●&nbsp;&nbsp;&nbsp;&nbsp; Top­Line Equipment. Apple laptop, large 2nd monitor, personal gadget budget, companysmartphone of your choice in addition to fully paid voice and data plan. Models dependent uponneeds and department function.&nbsp;",
	"job_requirements" : "As the ideal candidate, you:●&nbsp;&nbsp;&nbsp; Code for fun and are a true geek at heart●&nbsp;&nbsp;&nbsp;&nbsp; Have a strong grasp of CS fundamentals, algorithms, data structures, and design patterns●&nbsp;&nbsp;&nbsp;&nbsp; Have some familiarity with agile software development methodologies including automatedtesting, pair­programming, continuous integration, and continuous delivery●&nbsp;&nbsp;&nbsp;&nbsp; Interest or knowledge of UX and UI design principles●&nbsp;&nbsp;&nbsp;&nbsp; Are pursuing or have completed a BS/MS in Computer Science or Computer Engineering, orequivalent experience●&nbsp;&nbsp;&nbsp;&nbsp; Are excited about learning from an experienced and fast­paced team, taking on significantresponsibilities, and pushing the boundaries of what's possible on the web, mobile, and otheremerging platforms.Bonus Points●&nbsp;&nbsp;&nbsp;&nbsp; Awesome, demo­able apps especially those built with JavaScript, Objective­C, Ruby, or Python●&nbsp;&nbsp;&nbsp;&nbsp; Interest or expertise in big data, machine learning, natural language processing (NLP), datamining, voice recognition or other artificial intelligence●&nbsp;&nbsp;&nbsp;&nbsp; Mobile / iOS interest or experience●&nbsp;&nbsp;&nbsp;&nbsp; Experience with JavaScript, especially Node.js●&nbsp;&nbsp;&nbsp;&nbsp; REST API familiarity / expertise●&nbsp;&nbsp;&nbsp;&nbsp; Active Facebook API developer●&nbsp;&nbsp;&nbsp;&nbsp; Passion for performance optimization●&nbsp;&nbsp;&nbsp;&nbsp; Prior experience with top­tier Silicon Valley companies and startups●&nbsp;&nbsp;&nbsp;&nbsp; Familiarity and comfort with Git and GitHub●&nbsp;&nbsp;&nbsp;&nbsp; Creator or contributor to open source projects&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:40",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://grnh.se/so6avl",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Please include a cover letter with your application and apply using this link: http://grnh.se/so6avl.&nbsp;Company:Axiom Zen",
	"division" : "Vancouver Office",
	"website" : "www.axiomzen.co"
}