{
	"id" : "54424",
	"application_deadline" : "Jan 20, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Jr. Software Tester (Co-op)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Job DescriptionPowerex Corp. has an exciting opportunity for an individual looking to gain more than just programming experience. If you are driven to succeed, team-oriented, “able to make things happen”, and demonstrate strong communication and analytical abilities, we want to hear from you.Powerex has a co-op position available within our IT Department, directly supporting our business operations. For the right individual, this will mean numerous technical and non-technical learning opportunities, as well as exposure to the dynamic environment of energy trading.Responsibilities Provide support in the testing and sustainment of new and existing applications to address business and IT needs Interact with Business Analysts to elicit and understand business/technical requirements and specifications Create technical documentation, test plans, record detailed metric to track progress outcomes. Perform regression tests, develop new and maintain existing test cases Analyze the results of tests and test coverage to determine the quality of the solution. Perform tests under tight time constraints with a high degree of quality and accuracy.The successful individual must be a self-starter and be able to work with limited supervision. All applicants should have a valid employment visa if required for them to work in Canada. We thank all applicants for their interest; however only those selected for an interview will be contacted.&nbsp;About PowerexPowerex Corp., a wholly-owned subsidiary of BC Hydro, is a leading marketer of wholesale energy products and services in western Canada and the western US and a growing niche player in other markets across North America.At Powerex we work hard to provide our customers -- utilities, power pools, large industrials and power marketers -- with the energy products and services they need, when and where they need them. From energy and capacity sales to natural gas trading, Powerex has come to be known as a power marketing and trading company with the reliable supply, business flexibility and customer commitment to get the deal done.Supply. Flexibility. Commitment. We stake our reputation on it.Find out more about Powerex at www.powerex.com",
	"job_requirements" : "Qualifications Software development experience in an Object Oriented environment , C# .NET Knowledge of Relational Database is an asset Experience with Microsoft Office Products an asset Development and debugging experience in C# is an asset Test automation skills and prior use of automated test tools is an asset Ability to manage multiple priorities and deadlines Strong written and verbal communication skills Previous co-op experience is an assetOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Powerex Corporation",
	"division" : "Powerex Corporation",
	"website" : "www.powerex.com"
}