{
	"id" : "54428",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Software Quality Engineering Co-op",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "4",
	"salary" : "$18-$45 /hr",
	"frequency" : "Hourly",
	"industry" : "Semiconductor",
	"job_description" : "800x600Broadcom CorporationBroadcom Corporation is a global leader in wired and wireless broadband communications semiconductors. Our products enable the convergence of high-speed data, high definition video, voice and audio at home, in the office and on the go. Broadcom provides manufacturers of computing and networking equipment, digital entertainment and broadband access products, and mobile devices with the industry's broadest portfolio of state-of-the-art system-on-a-chip and software solutions.Our diverse product portfolio addresses every major broadband communications market and includes solutions for digital cable, satellite and Internet Protocol set-top boxes; high definition television (HDTV); cable and digital subscriber line (DSL) modems and residential gateways; high-speed transmission and switching for local, metropolitan, wide area and storage networking; home and wireless networking; cellular and terrestrial wireless communications; Voice over Internet Protocol (VoIP) gateway and telephony systems; broadband network and security processors; and SystemI/O server solutions. These solutions support our core mission: Connecting everything®.Broadcom Canada is located in Richmond, BC’s Lower Mainland, within close proximity of Vancouver’s ocean and mountains. The region is known for its natural beauty and rich multi-cultural heritage.A Company of Innovation and EngineeringBroadcom is a company created by engineers, managed by experienced industry leaders and powered by the talents of a highly diverse and motivated workforce. We support a multi-cultural environment and make it our business to hire, inspire and develop the very best people in the industry, worldwide.Our culture emphasizes collaboration, cooperation and distributed decision making. Small teams of smart people focused on solving difficult challenges and delighting customers on a regular basis. It's the type of environment where you can see your talents make an immediate and lasting impact.For more, please see http://jobs.broadcom.com/Normal0falsefalsefalseEN-USX-NONEX-NONEMicrosoftInternetExplorer4",
	"job_requirements" : "Responsibilities:The student would be a member of the software Quality Engineering team at Broadcom Canada. The QE team is responsible for maintaining the quality of embedded software throughout the development cycle. The student would be working with Enterprise Voice/Video over IP products which are based upon Broadcom Application Processors. Team members are involved with managing automated test systems, analyzing test results, investigating failures, and designing automated test scripts and data post-analysis routines for a variety of features and systems. In this position, the student is exposed to many different concepts of modern communications and will have the opportunity to work with state of the art consumer products. These include Linux and Android-based systems, consumer applications, as well as voice and video over IP/WiFi telephony.&nbsp;You will have the opportunity to work with a talented team of embedded software engineers and be a part of the software development cycle of leading edge communications products. Students in these positions have the opportunity to significantly enhance their problem solving and analytical skills.&nbsp;Preferred skills:- experience with scripting languages, in particular Tcl/Tk and Perl- familiarity with unit, system and application level testing- well-developed problem solving and troubleshooting experience- experience working with Android devices, PC's (Linux and Windows) and computer networks- other programming and/or testing experience an asset&nbsp;Compensation and Benefits:Co-op employees are well compensated.&nbsp; We do our very best to ensure that your co-op work experience is a very rewarding one.&nbsp; We provide relocation stipends and can help to find housing in the Richmond area. Broadcom provides all employees with a subsidized vending machine, free beverages, access to gyms, as well as many other on-site amenities. We have an active social committee which organizes a number of activities where you can socialize and get to know your colleagues.&nbsp;**Please note that all roles with Broadcom are subject to compliance with US Export laws.&nbsp; In order to ensure compliance with such laws, all persons hired will be required to provide information regarding citizenship before commencing the role so that any legal issues and additional requirements can be identified. &nbsp;&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Cover letter not required. GPA is requestedCompany:Broadcom Canada Ltd.",
	"division" : "Recruiting - University Relations Dept.",
	"website" : "www.broadcom.com"
}