{
	"id" : "54423",
	"application_deadline" : "Jan 28, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 or 12 months",
	"job_title" : "Co-op Student - Electrical Engineering (STUDENT00208)",
	"job_location" : "Fort McMurray, AB",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Company Overview&nbsp;A global energy leader with an exciting future Nexen is responsibly developing energy resources in some of the world’s most significant basins including the UK North Sea, Western Canada, the United States and offshore West Africa. As a wholly-owned subsidiary of CNOOC Limited, Nexen has three principal businesses: conventional oil and gas, oil sands, and shale gas.&nbsp;At Nexen, our culture of accountability is key to delivering superior results. Underpinning this culture&nbsp; is a set of beliefs that drive company-wide behaviours around safety, collaboration, innovation and striving to exceed expectations every day.&nbsp;With a robust portfolio of assets, we need high-performing employees who strive for continuous improvement and the chance to share in our future success. Your valued contributions are rewarded with a competitive compensation and benefits package including training that will open doors to your future.&nbsp;Location & Business Unit OverviewFort McMurray, AlbertaPosition OverviewAt Nexen, we have new graduate and student employee development programs that accelerate your career and allow you to step in, step up and stand out. These paid work terms, lasting four or eight months, enable students to develop technical skills to complement their academic learning. Students, recruited from both universities and colleges, not only meet Nexen’s short-term needs, but provide a potential source of future full-time employees. To be eligible for the co-op program, students must be enrolled in a co-op program sponsored by an accredited post-secondary institution.Job Duties & ResponsibilitiesStudents are maily focused on the optimizing the Preventative Maintenance in SAPJob Duties include:• Actual field equipment data acquisition.• Compare to the actual data with SAP.• Optimize the data in SAP.• Willing to work in the field.",
	"job_requirements" : "Education & ExperienceEducation: 2nd year Electrical EngineeringAvailability: Must be available for 8-12 monthsAdditional Skills:• Analytical and problem solving skills.• Excellent computer skills, especially excel and database.• Knowledge of electrical and mechanical engineering.• Experience with AUTOCAD would be considered an asset.&nbsp;Application InformationIndicate if you are enrolled in a co-op or internship programIndicate if you are available for the full work termInclude your GPA and expected graduation dateUpload your resume and cover letter as one documentOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.nexencnoocltd.com/careers",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Closing StatementTo apply please visit http://www.nexencnoocltd.com/careers. Click the “Apply for Job” button&nbsp;to start the application process.No agency or telephone inquiries please.&nbsp;Follow us on Twitter! @nexencampushttps://twitter.com/nexencampusBecome a member of our LinkedIn Group!The Nexen Student Connection&nbsp;Company:Nexen Inc.",
	"division" : "Calgary Office",
	"website" : "https://www.nexeninc.com"
}