{
	"id" : "54420",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Full Stack Web Developer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Monstercat is looking for a full stack web developer to join the team who is comfortable developing complex web applications in a unix environment. &nbsp;Monstercat is Canada's largest independent record label and was founded in 2011 by Mike Darlington and Ari Paunonen, both graduates from the University of Waterloo. Monstercat has grown from 2 to 25 employees in the last three and a half years and is one of the only record labels to leverage technology to scale operations and bring new products into both the label and consumer markets. &nbsp;About 2000 people engage with one of our platforms every minute! Monstercat has a distinctly ‘start up’ feel even though our business has grown to 25 employees. We are located in the heart of Rail Town in Vancouver, the office having a distinctly warehouse feel with exposed wood and brick.&nbsp;A typical day involves creating solutions to fit the needs of complex business problems and application evolution. This means fixing bugs, developing new features, amending and developing new platform architecture, creatively thinking about new useful functions and implementing said functions. You will be required to finesse graphical user interfaces using well known technologies like LESS, Jade, and Backbone. Additionally you will need to be able to write client agnostic server APIs in Node.js using Express and other known components. ",
	"job_requirements" : "Required Skill Set -Advanced knowledge of JavaScript -Up to date knowledge of modern web technologies -Ability to create and understand your own unix scripts -Able to reflect and refactor your code on the fly. Organization and cleanliness is important -A passion for coding your best work &nbsp;Required Technology Knowledge -Bash/GNU Make -HTML(Jade)/CSS(LESS)/JS(CoffeeScript) -Node.js &nbsp;What We Like to See -Activity in open source communities -Code you make your own and can be proud of -Ability to come up with creative solutions -Ability to critique your own code as well as others -Enjoy discussing various and complex concepts (cryptography, bitcoin, the future) -Knowledge of YouTube, SoundCloud and streaming store API's -Love for electronic music, music consumption and consumption of IPAs, Lagers and or Hefe's -Self motivated and independent project leader &nbsp;Perks-Standing or sitting desk-Flexible work hours-Work from home 1 day per week (optional)-Kitchen stocked with healthy foods&nbsp;Monstercat will cover round trip transportation to Vancouver (380 Railway Street) from Waterloo or Toronto. We can also help you find housing in the area. &nbsp;Our team is small and you will be working closely with the founders and other developers. We promote a good work life balance so hours our flexible as we work on a requirements and sprint basis. Our office is quiet and there are lots of office events and social opportunities. The startup environment can be stressful but also very rewarding, your work will be seen by millions!&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Monstercat",
	"division" : "Head Office",
	"website" : "https://www.monstercat.com/"
}