{
	"id" : "54425",
	"application_deadline" : "Jan 23, 2015 1159PM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Mobile Developer-Co-op Student",
	"job_location" : "Sault Ste. Marie.",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "“We are building an eHealth solutions company that will support people afflicted with chronic health conditions and the health care ecosystem around them.&nbsp; By developing and integrating software and hardware into the health care delivery process, our mission will be to enhance Quality Of Life.”&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Binh Nguyen – CEO eQOL Inc.eQOL is a start-up company working out of Sault Ste. Marie and Toronto.&nbsp; We create innovative solutions that enable people living with chronic conditions to care for themselves and transition out of the hospital setting.&nbsp; We are looking for people with experience in software development and the desire to work as part of a fast-paced, small but growing organization with great ambitions.&nbsp; We are recruiting individuals who share a passion for applying innovative and truly creative thinking, understand and value development, are bright and committed to doing whatever it takes for clients, and can make things happen working independently and within teams in a dynamic environment.&nbsp;We are looking for a co-op student with knowledge and interest in mobile application development.&nbsp; The placement will be in Sault Ste. Marie.• Works with the Sault Ste. Marie Team Leader to translate software requirements into workable programming code – including front-end presentation and Android development work.• Build customized scalable solutions based on client objectives and project requirements.• Ensure systems integration and solution design support the business objectives.• Writes specifications and designs, builds, tests, implements, and supports application development as required using programming languages and development tools• Always act in accordance with the company’s guiding principles and values.• Work as part of a team both inside and outside your department.• Lead by example – follow all defined rules, policies, regulations, processes and procedures while never being hesitant to recommend improvements.• Never knowingly surprise someone to whom a commitment has been made.• Execute quality control – check your own work first, never hesitate to point out other quality concerns.• Continually improve the capability of one’s own resources (people, processes, equipment, etc.) by making suggestions and keeping an open mind to other’s suggestions.• Consistently coach all direct reports and mentor all reports once removed.• Conserve all resources wherever possible and use them efficiently, while still delivering on one’s commitments.&nbsp; Continuously reduce all types of waste..",
	"job_requirements" : "• Currently enrolled in a co-op program at a University or College level post-secondary institution in a Computer Science-related field or:o Information systemso Mathematics with programming training and experienceo Business management with programming training and experienceo Physical / mathematical / applied science with programming training and experience• Strong working knowledge of HTML5 and Android development• Android native UI/UX experience• Demonstrated experience in developing Android applications• Knowledge of the following would be an asset:o Communicating with Bluetooth deviceso Latest iOS environment’s featureso iOS SDK, Xcode and Objective-C• An ability to merge technical skills with business understandingOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "eQOL Inc.",
	"division" : "eQOL Inc.",
	"website" : "http://www.eqol.ca/"
}