{
	"id" : "54430",
	"application_deadline" : "Jan 25, 2015 1159PM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 or 12 months",
	"job_title" : "Engineering Co-op - Regional Planning",
	"job_location" : "Kelowna",
	"number_of_positions" : "1",
	"salary" : "tba",
	"frequency" : "Monthly",
	"industry" : "Utility Company",
	"job_description" : "The assignment will provide opportunities for engagement with engineers, managers and others in different departments in the organization, and provide an understanding of some of the workings within the operating and engineering groups at FortisBC.Work&nbsp;with the Distribution Design Group and be involved in the planning of new Overhead and Underground power linesCreate models in order to simulate the distribution system and allocate loads given from a load forecastModel the distribution system using a power simulation software for large customers and operational inquiries&nbsp;&nbsp;&nbsp;&nbsp; Perform&nbsp;site visits when working with Distribution Design GroupProvide technical support and work with the Distribution Design & Operations groupResearch technical information on new utility products and practices and design proceduresThis position is for the May and September 2015 work terms (8 months).",
	"job_requirements" : "&nbsp;Electrical Engineering Student&nbsp;- Third or Fourth year preferredValid driver’s license required and current abstractExperience or knowledge with AutoCAD and competence in Excel, Word and PowerPointInterested in learning more about the Electrical Utility IndustryCompetent public speaker&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering Clean EnergyMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.fortisbc.com/careers",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):To learn more about FortisBC and the great initiatives we are involved in, visit us at www.fortisbc.comCompany:Fortis BC",
	"division" : "FortisBC Alternative Energy Services Inc."
}