{
	"id" : "54436",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "QA Software Test Engineer",
	"job_location" : "Richmond",
	"number_of_positions" : "1",
	"salary" : "3000",
	"frequency" : "Monthly",
	"industry" : "Software Development",
	"company_type" : "Private Business",
	"job_description" : "Responsibilities- Specify and create test cases for new features- Develop automated test tools for continuous integration testing- Write and maintain test scripts that will provide test reports for every sprint- Profile our apps to check for performance, responsiveness and memory footprint- Assist the decision makers in approving the final go for each release- Understand the need for white box vs. black box testing, and coordinate with the development team to deliver each when necessary- Manage traceability of epic to user story to implementation to test to defect- Find, document and track defects and verify their fixes- Engage with end-users to triage potential released defects and collect feedbackNice to have- Understanding of REST APIs and structured responses such as JSON and XML- Command-line scripting- Experience with iOS and/or Android development- Relational database design and SQLCompany Background (www.mobidia.com)Mobidia has a deep background in the mobile industry, and is headquartered in Richmond. We have sales offices in the UK, US and SE Asia. Our audience is every consumer who has a Smartphone. Our target customers range from mobile operators to enterprise management companies, as well as app developers.EnvironmentOur entire engineering group is tied closely with the business initiatives. As an engineer, you will hear the issues and challenges faced by both existing and potential clients. In return, we are looking to you with your inquisitive mind to really understand the problems at hand, to be creative in devising solutions, and to work well with your team to produce a solid product that not only meets the requirements, but also far exceeds them.Why Mobidia?• Let the world see your work! Our app has been downloaded over 9 million times in over 170 countries, and it continues to expand• Learn efficient development practices in a fast-paced environment• Work in an atmosphere that encourages new ideas, new ways of doing things, and critical thinking• Be part of the fastest growing technology sector: the mobile industry",
	"job_requirements" : "RequirementsKey attributes: energetic, thoughtful, listens and communicates well, appreciates the importance of user experienceSkills / Experience: demonstrated critical thinking, likes to break software, detail-oriented, but also wants to understand “the big picture”, able to articulate during demonstrationsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalStart Date:09/04/2013",
	"end_date" : "04/30/2014",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Online via system",
	"company" : "Mobidia",
	"division" : "Corporate Office"
}