{
	"id" : "54437",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Automation Development - IoT, Hypervisor",
	"job_location" : "Kanata, ON",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Title: Automation Development - IoT, HypervisorCo-op PositionWind River Systems, the company that created the operating system used on the Mars Rovers and the Boeing 787 Dreamliner, is looking to fill a co-op position to enable an automated test infrastructure system to power high quality delivery of its operating systems and products. In a company with significant growth and the leader in embedded platforms, you will be part of an Agile Scrum team developing the test infrastructure for a variety of products used in the embedded market. This position requires proven skills in software development tools and excellent oral and written communication skills. The ability to consider multiple operating systems, multi-core devices, virtualization technology, and multiple targets while designing and implementing a feature is essential. You will likely need to work with a variety of tools, operating systems, and products to ensure delivery of high quality code.Responsibilities:Automate test cases for IoT or Hypervisor Products at Wind River using your Python, 'C', and other skills. You will be responsible to understand an integrated environment while coding in a portable manner with exposure to Linux and VxWorks based Wind River products.Wind River, a wholly owned subsidiary of Intel Corporation (NASDAQ: INTC), is a world leader in embedded and mobile software, and has been pioneering computing inside embedded devices since 1981.",
	"job_requirements" : "Requirements:• 2+ years in software development• General experience with development and maintenance• General experience with kernel design and philosophy, as well as user-space design and philosophy• Experience with Python development or experience with 'C' development• Ability to work with general direction, or on specific tasks• Highly organized, detail-oriented, possessing a high level of integrity, and highly motivated• Ability to work collaboratively and independently in a cross-functional and team-oriented environment• Experience with VxWorks an asset• Experience with Linux development an asset- Experience with networking an assetOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Wind River Systems Inc.",
	"division" : "Canada"
}