{
	"id" : "54449",
	"application_deadline" : "Jan 22, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "UI Developer/Software Engineer",
	"job_location" : "Vancouver",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "What is Sidebuy?Sidebuy is a mobile eCommerce technology solution. Focusing on the Fashion vertical,Sidebuy technology is an application platform that helps shoppers find items in fashionimages in a local store. They will receive notifications on favorited items within theirSidebuy App to help them find items in a store nearby.Who are we?We love building cool things that bring value to users. We’re particularly passionate abouttechnology that enables mobile eCommerce and contributes to fashion publishers andmerchants.Our goal is to bridge the online discovery of fashion products within images, with offlineretailers/merchants to drive and influence local instorepurchases using MobileWe’re a smart, fun, techie and stylish startupin the trendy Gastown and looking for uniquetalent to join us in this exciting stage.Your Responsibilities● Delight customers by shipping awesome mobile and desktop user interfaces● Create and maintain scalable and reliable code● Discuss, debate and dream with the team about how to improve how we work",
	"job_requirements" : "Your Qualifications● You’ve shipped a large web or mobile application you are proud of● You’re a great developer, or are willing to put in the hard work to become one● You have a deep understanding of a modern web programming language especially Ruby and JavaScript● You like open source, performance best practices and making stuff really, really fast● You are familiar with libraries like angular.js, require.js, backbone.js, underscore.js● You are familiar with Rails and SQL data stores● You have some experience working with REST APIs (bonus if you’ve worked with&nbsp;Pinterst, Tumblr or Facebook APIs)● You document your code well● You have a B.S. or M.S. Computer Science or you’re working towards it in School in&nbsp;a relevant program or have related experienceOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Sidebuy",
	"division" : "Head Office",
	"website" : "sidebuy.com"
}