{
	"id" : "54447",
	"application_deadline" : "Jan 29, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Co-op or Developmental Student",
	"job_location" : "Clarington, Ontario",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "We are offering one student placement in our Fuel Handling Department which is based at the Darlington Nuclear Station located in Bowmanville, Ontario, approximately 70 kilometers east of Toronto.&nbsp; Please note there is no public transit to the Darlington work site.In this role, you will be exposed to the role of engineers at an operating nuclear facility and how engineering interfaces with Operations, Maintenance, Design, Construction and Support areas (Materials Management, Costing, Estimating, Scheduling).As the successful applicant, you may have the opportunity to:• Collect, trend, and interpret field performance• Prepare and distribute weekly and monthly department report card• Participate in equipment troubleshooting• Gain experience with database and Excel macros• Perform field surveillance of Project Work",
	"job_requirements" : "We are searching for an enthusiastic Mechanical, Electrical, or Computer Engineering, Student, who has completed a minimum of second year and will be returning to University (full-time) after completion of this work term, or requires one final work term to graduate.Preference will be given to candidates with the following knowledge and skills:• A good understanding of Technical Documentation (Design Information, Drawings, Bills of Material) Leadership experience• Excellent computer skills in a windows NT Environment• Experience with programming languages (visual Basic) and database queries would be an asset.We hire dozens of Co-op Students each term, and we work hard to keep them challenged and provide learning opportunities.&nbsp; In fact, many of our Co-op Students return for a second term because the OPG experience is so valuable.&nbsp; Many return after graduation.&nbsp; So tell us what areas you're interested in and we'll tell you what you can accomplish in the months you're with us, while you enjoy networking with your peers in a flex-time and business casual environment!If you are ready to be challenged, please apply on-line only at http://www.mypowercareer.com/ no later than midnight, Thursday January 29, 2014.&nbsp;OPG sincerely thanks all those who apply, however only those selected for an interview will be contacted.&nbsp; In the event you are invited for an interview, please note you will be required to provide transcripts.You must be eligible to work in Canada.OPG supports the principles and practices of diversity.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in BiomedicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaster of Software SystemsMechanicalUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.mypowercareer.com/",
	"company" : "Ontario Power Generation",
	"division" : "Default Division"
}