{
	"id" : "54444",
	"application_deadline" : "Jan 28, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "12 months",
	"job_title" : "Computer Science/Computer Engineering (STUDENT00200)",
	"job_location" : "Calgary, Alberta",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "A global energy leader with an exciting futureNexen is responsibly developing energy resources in some of the world’s most significant basins including the UK North Sea, Western Canada, the United States and offshore West Africa. As a wholly-owned subsidiary of CNOOC Limited, Nexen has three principal businesses: conventional oil and gas, oil sands, and shale gas.At Nexen, our culture of accountability is key to delivering superior results. Underpinning this culture&nbsp; is a set of beliefs that drive company-wide behaviours around safety, collaboration, innovation and striving to exceed expectations every day.With a robust portfolio of assets, we need high-performing employees who strive for continuous improvement and the chance to share in our future success. Your valued contributions are rewarded with a competitive compensation and benefits package including training that will open doors to your future.Location & Business Unit OverviewCalgary, AlbertaPosition OverviewAt Nexen, we have new graduate and student employee development programs that accelerate your career and allow you to step in, step up and stand out. These paid work terms, lasting four or eight months, enable students to develop technical skills to complement their academic learning. Students, recruited from both universities and colleges, not only meet Nexen’s short-term needs, but provide a potential source of future full-time employees. To be eligible for the internship program, students must be enrolled in a internship program sponsored by an accredited post-secondary institution.Job Duties & Responsibilities3 positions available:1:• Provide end user support in Oracle and MSSQL environments• Support and execute routine maintenance and operational tasks• Review and update operational documentation• Maintain inventory of all items associated with the DB environment• Knowledge of relational DB concepts• Ability to understand DBA operational documentation• Working knowledge of command line interface, command/scripting with DB environments2:• Implement upgrades and patching• Build and maintain Servers• Perform Active Directory and GPO and management• VMWare administration• Manage and maintain the global Citrix environment• Perform print server and antivirus administration• On-call Rotation3:• Understanding of concepts and application of all facets of TCP/IP, routing, and the Internet infrastructure are core proficiencies.• Exposure to internetworking protocols and services, such as TCP, UDP, ICMP, BGP4, OSPF, RIP, IPsec/IKE, SMTP, HTTP, and FTP are fundamental to success in this position.• Strong troubleshooting and communications skills and the ability to implement quick workarounds to technical problems.• Participate in network designs and consolidation of various network solutions.• A strong working knowledge of network best practices and business continuity planning is desired.• Work on client teams to design low risk implementation of solutions.• Ability to work after-hours change windows for customer projects• Provide day-to-day support for network systems, including 24x7 on-call support.",
	"job_requirements" : "Education & ExperienceEducation: 3rd year Computer Science studentAvailability: Must be available for 12-16 monthsAdditional Skills: There are computer science courses that are directly related to the DBA role that would be necessary for this individual, students should also have education in network infrastructureApplication Information• Indicate if you are enrolled in a co-op or internship program• Indicate if you are available for the full work term• Include your GPA and expected graduation date• Upload your resume and cover letter as one documentOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.nexencnoocltd.com/careers.",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):To apply please visit http://www.nexencnoocltd.com/careers. Click the “Apply for Job” button to start the application process.• No agency or telephone inquiries please.Follow us on Twitter! @nexencampushttps://twitter.com/nexencampusBecome a member of our LinkedIn Group!The Nexen Student ConnectionCompany:Nexen Inc.",
	"division" : "Calgary Office",
	"website" : "https://www.nexeninc.com"
}