{
	"id" : "54459",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Junior Consultant, Scientific Research Experimental Development (SRED)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "JOB DESCRIPTIONKPMG's RD group consists of multidisciplinary teams of engineers, accountants andtax specialists. These teams assist our clients in obtaining Scientific Research andExperimental Development (SRED) tax credits offered by both the federal andprovincial governments.&nbsp; For information on this program, please visithttp://www.cra-arc.gc.ca/txcrdt/sred-rsde/menu-eng.html. These tax credits are usedto foster a company's new innovative products and processes such as 3D televisions,super powered magnets, new drugs and plants, and new software technologies. The KPMGRD group is one of the fastest growing groups at KPMG and consists of over 100engineers and computer scientists across Canada.Position Summary:Do you want to develop client relationships with some of the largest softwaredevelopment companies in Canada? Tired of programming and want to develop consultingskills?&nbsp; KPMG is looking for a Junior Consultant with a software and web developmentbackground to join their RD Tax group.Various businesses conduct RD activities to develop (or modify existing) productsor processes with a view to developing intellectual property, reducing costs,improving performance, or creating new markets. To qualify for RD tax credits,these activities must meet certain eligibility criteria. The successful candidatewill assist our clients in identifying eligible activities and describing theseactivities in a technical report. The candidate will benefit from exposure totechnology leaders and state-of-the-art innovations at companies in severalindustries, and from continuous learning through conferences and networking.Your main duties as a Junior Consultant in SRED are (but are not limited to):1) Interviewing people from software development companies, and preparing technicalreports documenting their industrial research projects (technical objectives, stateof knowledge, technological advancements, steps carried out in an experimentalprocess)2) Keeping up-to-date with innovative technologies and trends in the world of webtechnologies and software development3) Working in a cross functional team environment to complete RD tax claims forsmall, medium and large corporations4) Planning, organizing and executing engagements on time and within budget.5) Developing an understanding of the RD tax program and the ability to interpretlegislation",
	"job_requirements" : "Required Skills:Strong technical report writing skillsExcellent analytical, conceptualization and problem solving skillsAbility to understand clients’ technical problems, quickly learn new technologies, and work both independently and part of a team to rapidly deliver technical reports.Excellent interpersonal and communication (verbal and written) skillsRequired KnowledgeStrong knowledge in various software design and architectural patterns (e.g. MVC, MVVP, SOA, AOP, etc.).Solid understanding in relational/non-relational database systems and architecture (e.g. RDBMS, Oracle, Cassandra, CouchDB, MongoDB)Working knowledge of various web servers (IIS, Apache, Nginx) and caching systems (Memcached) and cloud computing system (AWS)Working knowledge of Agile development methodologyUndergraduate and graduate level computer engineeringPreference Towards3rd, 4th or 5th year students in applicable disciplinesStudents with past work experience (Co-op or other)Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "KPMG Inc",
	"division" : "Vancouver"
}