{
	"id" : "54465",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Software Development Engineer Co-op/Intern - Social Casino Products",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Software Development Engineer Co-op/Intern - Social Casino&nbsp;Products [Summer 2015]A Thinking Ape is a Y Combinator-funded mobile gaming startup in high-growth mode.We are looking for smart engineers; we care less about experience and more about rawtalent. As a full-fledged member of our team, you will help build and ship top-grossingmobile games to our dedicated worldwide communities!The ATA Social Casino Products team is one of our fastest growing teams at ATA andyou will be joining a small team competing in an extremely competitive and excitingproduct market. You will be working hand-in-hand with a highly motivated team lookingto win. If you enjoy the mathematics and art behind video slots, blackjack, poker andother games of chance, this will be a great opportunity for you to work on a passionateproduct team.Projects for previous co-ops included:• Client development: porting an iOS mobile game to Android from scratch andshipping a worldwide featured product to the App Store• Tools development: building a patent-pending animation pipeline that enablesour artists to deliver complex assets at a performant and cost-effectivethreshold• Analytics: creating data visualizations that drive key product decisions andcustomer acquisition strategy• Distributed systems: creating applications using service orientedarchitectures that power our live gaming products• Data mining: building a continuous real-time data collection and miningplatform for player behaviour intelligence&nbsp;",
	"job_requirements" : "Things we require:• Strong algorithmic and problem solving skills• Strong communication skills; clear writing and coding ability is a must• Enthusiastic learner• Ownership: takes pride and responsibility in their own work• Independently motivatedThings that don’t matter as much:• Knowledge of specific languages or domain expertise in particular platforms• Mobile development experience• Specific year level.In your application, please also tell us if you: contribute to an open source project,work on side projects, or have participated in hackathons.In addition to working with a world-class engineering team, we provide standingworkstations, open spaces for collaboration, mobile whiteboards, weekly catered lunch,and stocked pantries. We foster a culture of ownership, encourage everyone to set theirown work schedule, explore exciting ideas, and focus on building quality products. If thissounds like an ideal work environment for you, we’d love to hear from you.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "A Thinking Ape",
	"division" : "Head Office"
}