{
	"id" : "54463",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Motion Control Software Developer Co-op 395278",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "About UsZaber Technologies is an established and steadily growing employee-owned companythat designs, manufactures, and sells precision motion control equipment for high-tech markets around the world.We strive to create an open, friendly, and high-achieving work environment. Ourstaff are progressive, enthusiastic individuals whose hobbies and interests arereflected in the work we do. Some aspects of Zaber that our employees especiallyenjoy include the people, the sense of community, flexible hours, level of employeeengagement, employee-organized activities and opportunities to le arn. Most of uscycle, bus, or carpool to work and put in extra effort to make sustainable choices.Last, but not least, our office has several friendly dogs.How to Apply1. In your cover letter, please describe an interesting project that you designedand implemented recently. We'd prefer a personal project or specific work done aspart of an extracurricular team.2. Include source code, design documents, schematics/layouts, and/or photos tosupport your descriptions.Zaber Technologies is looking for a programming co-op student who is passionateabout device driver and user interface designs to start in January 2015.This is a full-time RD position with flexible hours. The successful candidate willjoin the Firmware and Electronics team in developing cutting-edge precision motioncontrol products.",
	"job_requirements" : "ResponsibilitiesThis is an interdisciplinary position with opportunities to gain hands-on experiencein RD processes as well as product management. Projects and responsibilities willbe tailored to the abilities and interests of the candidate. Some possibleresponsibilities include:*Research and brainstorm API's and GUI applications for inter facing with Zaber'sproducts*Gather and prioritize requirements with inputs from colleagues and customers*Design and implement proposed ideas into elegant, functional, and user-friendlysolutions*Prepare and refine documentation and packaging that will be shared with internalstaff and customersRequirements*Experience in Python, Java, C#, and similar languages*Understanding of user interface designs and GUI architectures*Experience with serial communication programming an asset*Enthusiasm for problem solving, challenges, and the process of learning*Enjoy working in a small team environment*Attention to detail along with good testing and documentation practices*Ability to manage and prioritize tasks and responsibilities with little supervision*Experience with LabVIEW, MATLAB, and PLC ladder logic an asset*Understanding of embedded microcontrollers, firmware programming, and electronicsan asset*Legally entitled to work in CanadaOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Zaber Technologies Inc.",
	"division" : "Zaber Technologies Inc."
}