{
	"id" : "54472",
	"application_deadline" : "Feb 15, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4, 8 or 12 months",
	"job_title" : "Summer 2015 Co-op Opportunities",
	"job_location" : "Various Locations in Canada",
	"number_of_positions" : "4",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Calling all future technical leaders!Are you in Computer Science or Engineering? Do you have a passion for technology? Are you looking for an exciting co-op opportunity?&nbsp; One where you will be empowered, challenged, and given the ability to have an impact on large-scale initiatives that will drive our business forward? Are you looking for a place to apply your spirit of innovation and enhance your leadership capabilities?&nbsp; You will have the chance to do all of that and more in co-op roles we offer in our Business Transformation team (IT area) of TELUS.Business Transformation (BT) team - Information Technology at TELUSInformation Technology makes our day-to-day work, customer interactions, and transactions possible at TELUS. The Business Transformation team with more than 1,900 internal and 820 external team members is internal IT organization at TELUS.&nbsp; This team is responsible for TELUS’ IT strategy and leads application development, release management, operations, change management, and support activities. We deliver technology solutions for virtually every aspect of our business.What is the Technology (IT) Co-op ProgramThis is your chance to shine! TELUS Business Transformation (BT) Team is currently looking for the best and brightest university students to join our exciting and rigorous Co-op program. This is an excellent way for you and TELUS to explore long term fit for our permanent positions as a new grad. We offer 4- or 8-month work terms in various locations across Canada. By participation in this program, you will learn different areas of the Business Transformation and experience how to turn leading-edge technologies into solutions for our clients.&nbsp; Fit for a specific co-op role available will be based on a combination of your strengths, personal interest and business needs.Positions are available in Alberta, British Columbia and Ontario.Our IT co-op roles typically fall into one of following main areas:• Software development & support• Operating systems• Database administration and data technologies• Hardware and infrastructure design and support• Storage designRoles currently available in our program are listed below. Please indicate in your cover letter which ones are your top 2 choices in order of preference.1) Developer Analyst – Service Assurance Team – Burnaby, BC – work term length: 8 monthsThe team takes care of the SyNOPsis, Solvatio and HDM applications used for Assurance agents (Call Centre, Field Technicians and tier 2-3 support people). As our team implements our Strategy to Live and Breathe our Customer First philosophy, and we strive to improve every customer experience, looking for ways to make more efficient the current processes and to provide timely information and proactively identify opportunity areas in the systems we support is key.Key responsibilities are:• develop tools (e.g. macros, scripts. programs) that willo automate/enhance the process to create of the SLAs metrics agreed on the SAE Phase III Program, ando continue to automate the current processes behind the Team Scorecard.2) Systems Analyst – Scarborough, ON – work term length: flexible (8 months preferred)The Marketing team in Business Transformation (IT) supports systems for Product and Offer Managers with the goal of developing tools to provide clients with incentives to renew their contracts or upgrade phones.&nbsp;&nbsp;Key responsibilities:• analysis, development and/or enhancement of web applications• development and implementation of monitoring tools dashboard for non-prod• creating and implementing process improvements/efficiencies• implementation of TELUS Automated Frameworks for new front-end tool that they develop• assignments to their own initiatives such as building new UI for Service Health Monitoring Tool. This tool has the potential of being scaled across multiple teams if successful.&nbsp;3) Project Coordinator&nbsp; – Development & Support Team – Burnaby, BC - work term length: 8 monthsThe Program Management team plans, governs, and tracks a large corporate IT transformation initiative. Our team has to collect and process a large amount of data in order to provide our executives with the information they require in order to make informed decisions. This opportunity will provide the student with a strategic view of a very large program. You will learn about key performance indicators and methods to track and present them. You will also learn about project management methods and practices.Key responsibilities:• the student will help to ensure our information is up-to-date and help identify opportunities to drive additional benefits• own the relationship with a sub-set of the project teams within the program• ensure timely and meaningful status/progress reports from the project teams• Analyze large volume of data (excel, python, SQL) and provide business/project recommendations&nbsp;• Additional duties as required• assist in determining appropriate success measures for the site; collect and store metrics, present reports on those metrics readably and comprehensibly4) Technology Specialist&nbsp; - Edmonton, AB - work term length: 4 monthsTELUS Internal Windows Server Operations Team is responsible for the support and health of the 4000 TELUS Windows and VMware Servers.&nbsp; We provide strategic direction for new technologies and support high availability, mission critical infrastructure. You will develop skills in the Windows and VMware technologies.Key responsibilities:&nbsp;• analyze process and develop improvement recommendations regarding operational efficiency• learn TELUS processes for deployment and administration of VMWARE and MS windows servers• manage HP/IBM hardware remediation and participate in general process improvement activitiesNo matter what your role is, in our co-op program, you will:• learn about leading-edge technology solutions involved in mobile, TV and broadband service delivery• gain hands-on experience by working on some of strategic initiatives at TELUS including procurement and trialing of new hardware / software for corporate use, Cloud / virtualized software, continuous integration automation tools, and more• build strong technical foundation with enterprise technologies in cross-functional teams• put newly learned technical and analytical skills into practice and learn the complexity of an enterprise environment with many unique requirements to consider• collaborate with various business units to develop and support a wide variety of solutions• obtain process improvement and communication skills and grow business acumen• gain experience in estimating effort, planning work and reporting status• develop ad-hoc queries in response to business needs• gain visibility into other roles and responsibilities in the SDLC – such as project management, systems analysts, architects, and business systems analysts• gain an understanding of the core business functions of a leading telecommunications company• work in an organization that uses both Agile and Waterfall methodologies• deploy meaningful work as its outcome is clearly aligned with our Corporate strategyThe program also offers support to grow your skills through:• Technical, leadership, and business learning opportunities• Buddy and Mentorship program and networking opportunities• Informal and formal interaction with senior leaders at TELUS",
	"job_requirements" : "Education:Students must be enrolled in an accredited internship or a co-op program in Computer Science or Engineering.Required Knowledge & Skills:No matter which team you join, YOU:• have an excellent software development skill-set• demonstrate analytical, conceptualization and problem solving skills• are able&nbsp; to translate technical and business terminology to all audiences• demonstrate leadership in the way you approach your work, as proven through your academic, community or extracurricular activities• are creative and innovative in your approach• possess strong communications skills (both written and verbal)• are skilled at relationship-building and collaborating• have a strong sense of personal initiative, and want to make a difference for TELUS customers and your team• can easily grasp “the big picture” and take ownership of your work• enjoy working in a high-performing, fast-paced and sometimes ambiguous environment• you can flexibly adapt to new situations and reprioritize when needed• are passionate about learning, new technologies and our industryIn addition, we look for the following skills and knowledge.Required Technical Knowledge and Experience:• Proficiency in at least one of the following categories:o Software development & support Object-oriented concepts SDLC, requirements gathering, software design, project planning and testing methodologieso Operating systems Microsoft Server, Linux, Unix-based operating systemso Database administration and data technologies SQL, RDBMS, ETL Oracle, MS SQL Server or other database management software Reporting toolso Hardware and infrastructure design and support Virtualization software Apache, Tomcat, Weblogic, ColdFusion, or other application serverso Storage design RAID, networking and security technologies Environment setup• Open source project contributions and examples of self-initiated technical projectsBeneficial and complementary skills are considered an asset in the following areas• Familiarity with web technologies and development: J2EE, HTML, CSS, PHP, Spring MVC, Stripes• Scripting languages: Perl, Bash, Shell• Continuous integration systems: Jenkins, Hudson, Cruise Control• Mobile application developmentOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://telus.taleo.net/careersection/10560/jobdetail.ftl?lang=en&job=ROL01716-15&src=UNV-10425",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):IMPORTANT NOTE: All applicants MUST also APPLY DIRECTLY TO TELUS AND ANSWER PRESCREENING QUESTIONS using the following link: https://telus.taleo.net/careersection/10560/jobdetail.ftl?lang=en&job=ROL01716-15&src=UNV-10425When applying, please ensure you include your cover letter, resume and transcripts. You will receive an automatic email to confirm your application.Company:TELUS Corporation",
	"division" : "TELUS"
}