{
	"id" : "54475",
	"application_deadline" : "Jan 30, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "CIVIL/STRUCTURAL SUMMER STUDENT- 743828",
	"job_location" : "Thompson, Manitoba",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Who We AreAt Vale, we believe in innovation as a foundation for our development, to create the mining of the future and achieve our vision of being the biggest and best mining company in the world.Operating in Canada for over 100 years, we are a leading producer of iron-ore, copper, cobalt and precious metals and the world’s second largest nickel mining company. We aim to grow profitably but only as a safe, high-quality and sustainable mining company.Are you interested in joining our team of over 6,000 professionals in Canada?We employ a wide range of occupations from engineers, underground miners and supervisors in Thompson, Sudbury and Voisey’s Bay, to our R&D team from our world class Technology Centre in Mississauga.The Manitoba Operations, located in Thompson Manitoba was the world’s first fully-integrated nickel mine where ore is mined, concentrated, refined and shipped to market all from one location.&nbsp; With three operating mines – Thompson Mine, T-3 Mine and Birchtree Mine - Manitoba Operations has a strong future in mining and milling, with a goal to grow as a safe, high quality, sustainable and long-term nickel producer.&nbsp; Manitoba Operations also has a strong commitment to Zero Harm to its employees, the community and the environment.",
	"job_requirements" : "CIVIL/STRUCTURAL SUMMER STUDENT - CENTRAL ENGINEERING (2015)Working within the Central Engineering team, the summer student will aid the department Engineers in providing technical support for plant operations and maintenance.Accountabilities:Participate as a team member of single discipline as well as multi-discipline engineering projects (Civil, Mechanical, Electrical, and Instrumentation). Perform design and drafting work for projects.Provide field inspections for projects as assigned.Work with senior engineers to advance skill setEducation:The ideal candidate will be:Currently enrolled in an Engineering Degree Program at an accredited Canadian University.Preferences will be given to 3rd year students going into their 4th year of study.Knowledge and Skills:Strong computer skills requiredExperience working on project teamsExperience in Microstation, or AutoCAD drafting software an assetOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsCivilComputerElectricalIntegratedMaster of Applied Science in CivilMaster of Applied Science in Electrical & ComputerMaster of Applied Science in MechanicalMaster of Applied Science Okanagan in CivilMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering CivilMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering Okanagan in CivilMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaster of Software SystemsMechanicalUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.recruitingsite.com/csbsites/vale/careers.asp",
	"company" : "Vale",
	"division" : "Manitoba Operations"
}