{
	"id" : "54482",
	"application_deadline" : "Jan 26, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "2015-004 - Energy Specialist Co-op",
	"job_location" : "Kamloops, BC - New Afton Mine",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "POSITION TITLE:&nbsp; Junior Energy Specialist Co-op StudentLOCATION: New Afton Mine, located 10km west of Kamloops, BC.Kamloops is city of 90,000 people, located 350km east of Vancouver.&nbsp; The area provides the opportunity to live and work in a vibrant community with its own University and within easy reach of world class ski resorts, championship golf courses, mountain biking trails, popular recreational lakes and the vineyards of the Okanagan Valley.New Gold is an intermediate gold mining company. The company has a portfolio of four producing assets and three significant development projects. The New Afton Mine in Canada, the Cerro San Pedro Mine in Mexico, the Mesquite Mine in the United States and the Peak Mines in Australia provide the company with its current production base and solid foundation. In addition, New Gold owns 100% of the Blackwater and Rainy River projects, both in Canada, as well as 30% of the El Morro project located in Chile. New Gold's objective is to continue to establish itself as a leading intermediate producer, focused on the environment, sustainability and generating peer-leading shareholder returns.Our Values drive every decision and action we take at New Gold:Integrity:&nbsp; Do what’s rightCreativity:&nbsp; Lead with innovationCommitment:&nbsp; DeliverDevelop our employees:&nbsp; Commitment to personal developmentTeamwork:&nbsp; Leverage our collective skillsFor further information on our company, please visit www.newgold.com.POSITION SCOPE: We currently have an exciting opportunity for a student to join our New Afton Team for a 4 month work term. The incumbent will be working in a support role to the Energy Specialist.Energy Management at New Afton plays a major role in minimizing the impact on the environment and in producing copper/gold concentrate as efficiently as possible. A brand new Energy Management Information System (EMIS) has been installed to provide information on energy consumption and performance against energy intensity targets. New Afton is also an industry leader in the initiation of an ISO 50001 Energy Management System (EnMS).RESPONSIBILITIES: The successful applicant will:• Assist with the setup of the Energy Management Information System (EMIS)• Assist with the familiarization, use and training on the new EMIS for New Afton Mine;• Be involved with the setting up of the new ISO 50001 EnMS;• Work on studies for energy performance improvement projects.• Work with the New Afton Energy Specialist to select contractors and various New Gold personnel on energy performance improvement projects;• Help to co-ordinate events and communications with employees as part of a big drive on Employee Awareness relating to energy management and efficiency;• And any other duties as required by the Energy Specialist.COMPENSATION: A competitive salary will be provided.",
	"job_requirements" : "SKILLS & EXPERIENCE: Qualified Candidates are currently enrolled in an undergrad program for Electrical Engineering, Mechatronics Engineering, Mining Engineering, Process Engineering or Chemical Engineering. The incumbent will have excellent interpersonal skills, demonstrated leadership skills, a business focus with an emphasis on safety. Preference will be given to candidates that have previous experience in energy management or energy efficiency. Demonstrated advanced-level proficiency in Microsoft Office applications including: Word, Excel, Access, PowerPoint and Outlook is essential.Applicants must possess a valid BC Driver’s License and have access to personal transportation.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalElectricalIntegratedMaster of Applied Science in Chemical & BiologicalMaster of Applied Science in Electrical & ComputerMaster of Applied Science in GeologicalMaster of Applied Science in MaterialsMaster of Applied Science in MechanicalMaster of Applied Science in MiningMaster of Applied Science Okanagan in ElectricalMaster of Applied Science Okanagan in MechanicalMaster of Engineering Chemical & BiologicalMaster of Engineering Clean EnergyMaster of Engineering ElectricalMaster of Engineering in Mechatronics DesignMaster of Engineering MechanicalMaster of Engineering MiningMaster of Engineering Okanagan in ElectricalMaster of Engineering Okanagan in MechanicalMaterialsMechanicalMiningUBC OkanaganUBC Okanagan ElectricalUBC Okanagan MechanicalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):FOR FURTHER INFORMATION, CONTACT: Please contact your co-op office to apply. Please include subject line 2015-004 – Energy Specialist Co-op on your application.Company:New Gold Inc.",
	"division" : "New Afton Mine"
}