{
	"id" : "54485",
	"application_deadline" : "Jan 26, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "2015-007 - Electrical Co-op",
	"job_location" : "Kamloops, BC - New Afton Mine",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "POSITION TITLE:&nbsp; Electrical Engineering Co-op StudentLOCATION New Gold is an intermediate gold mining company. The company has a portfolio of four producing assets and three significant development projects. The New Afton Mine in Canada, the Cerro San Pedro Mine in Mexico, the Mesquite Mine in the United States and the Peak Mines in Australia provide the company with its current production base and solid foundation. In addition, New Gold owns 100% of the Blackwater and Rainy River projects, both in Canada, as well as 30% of the El Morro project located in Chile. New Gold's objective is to continue to establish itself as a leading intermediate producer, focused on the environment, sustainability and generating peer-leading shareholder returns.Our Values drive every decision and action we take at New Gold:Integrity:&nbsp; Do what’s rightCreativity:&nbsp; Lead with innovationCommitment:&nbsp; DeliverDevelop our employees:&nbsp; Commitment to personal developmentTeamwork:&nbsp; Leverage our collective skillsFor further information on our company, please visit www.newgold.com.POSITION SCOPE: We currently have an exciting opportunity for a student to join our New Afton Team for a 4 month work term. This position will provide assistance to the Maintenance Department and Electrical Engineering Department.RESPONSIBILITIES:The successful candidate will be exposed to a variety of tasks in the areas of projects, maintenance and reliability.&nbsp; Working closely alongside the Senior Electrical Engineer, the candidate will be assisting in all aspects of project management for site based projects, conduct field visits to create and update existing drawings, as well as provide assistance with maintaining on-site maintenance and reliability programs. This position requires a dedication to safety, equipment care and the environment.COMPENSATION: A competitive salary will be provided.",
	"job_requirements" : "SKILLS AND EXPERIENCE:Qualified candidates are currently enrolled in an Undergrad program for Electrical Engineering and enrolled in the CO-OP Program.&nbsp;The incumbent will have excellent interpersonal skills, demonstrated leadership skills, a business focus with an emphasis on safety. Demonstrated advanced-level proficiency in Microsoft Office applications including: Word, Excel, Access, PowerPoint and Outlook is essential. Previous experience working In the mining industry will be seen as an asset.Applicants must possess a valid BC Driver’s License and have access to personal transportation.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):FOR FURTHER INFORMATION, CONTACT: Please contact your co-op office to apply. Please include subject line 2015-007-Electrical Co-op on your application.Company:New Gold Inc.",
	"division" : "New Afton Mine"
}