{
	"id" : "54497",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 months",
	"job_title" : "Intern, Data Migration and Quality Analyst",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "3",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "As market leader in enterprise application software, SAP helps companies of all sizes andindustries run better. From back office to boardroom, warehouse to storefront, desktop to mobiledevice – SAP empowers people and organizations to work together more efficiently and use businessinsight more effectively to stay ahead of the competition.PURPOSE AND OBJECTIVESThe Data Migration and Quality Analyst position is best suited for candidates with a passion towork in the software development or project management fields. The candidate should have a workingknowledge of project management, process automation, databases, web applications, andinformation/database management. This position requires working independently, achieving tighttimelines and collaboration across teams such as development, product management, and compliance.This position is part of the Global Licensing team whose initiative is to determine licensingstandards and manage inbound software licenses for SAP. The candidate will be responsible formanaging and executing major data migration projects for the team and ensuring data quality. Inparticular, the candidate will gain hands-on knowledge about SAP’s software standards and approvalprocesses and be responsible for migrating SAP data to state of the art compliance tools (such asBlack Duck Protex).The candidate must be attentive to details and able to think out-of-the-box. Superb oral andwritten communication skills suitable for a professional work environment are required. Thecandidate should possess leadership skills and thrive for achieving the highest quality of work ina fast-paced environment.&nbsp;EXPECTATIONS AND TASKS• Work with stakeholders to gather data requirements for Black Duck Protex• Develop project plans for major data migration projects• Execute data migration plans in a tight timeline while ensuring utmost data quality (some manualdata entry will be required)• Gain an understanding of software approval processes and its data integrity requirements• Demonstrate interest, knowledge, and curiosity in the area of software licensing• Assist in other duties consistent with the team’s initiatives&nbsp;",
	"job_requirements" : "EDUCATION AND QUALIFICATIONS / SKILLS AND COMPETENCIESGeneral• Highly self-disciplined and self-motivated individual with positive work attitude• Outstanding written and verbal communication skills suitable for a professional work environment• Knowledge of process improvement methodologies and use of technology to streamline processes• Excellent team player showing initiative, interest and passion in producing high quality work• Ability to work independently and efficiently with minimal supervision• Able to develop creative solutions to novel problems• Passion for technology and software developmentTechnical• Strong analytical and problem solving skills with attention to detail• Knowledge of project management principles, past experience a plus• Good working knowledge of database and web applications• Software development experience a plus&nbsp;WORK EXPERIENCE• Previous co-op or similar work experience highly recommendedSAP'S DIVERSITY COMMITMENTTo harness the power of innovation, SAP invests in the development of its diverse employees. Weaspire to leverage the qualities and appreciate the unique competencies that each personbrings to the company.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "SAP",
	"division" : "Toronto Office"
}