{
	"id" : "54496",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Visual UX Designer",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Purpose and ExpectationsWe are looking for an experienced Visual UX designer to help define the product visual identity for SAP Business Objects products.&nbsp; Collaborating closely with UX Design and Solution Management, the Visual Designer supports development projects by delivering graphical assets and detailed design specifications for the target UI technology to enable the implementation of the product visual identity.SAP BusinessObjects business intelligence (BI) solutions provide comprehensive business intelligence functionality that empowers users to make effective, informed decisions based on solid data and analysis. All users, from the high-end analyst to the casual business user, have access to the information they need -with minimal dependence on IT resources and developers. With these powerful solutions, users throughout the enterprise can access, format, analyze, navigate, and share information across the organization. &nbsp;http://www.sap.com/pc/analytics/business-intelligence.htmlExpectations and TasksWork closely with interaction designers and other stakeholders to achieve visual design goals.Ability to design to and evolve an existing&nbsp; visual UI standardComfortable defining and implementing web based grid frameworksScreen layout design including spacing and positioning of design elementsFamiliar with writing and implementing CSS designs&nbsp;&nbsp;&nbsp;Design and delivery of visual assets including icons and interactive controlsDesign of color palettes for content elements such as charts and graphs.",
	"job_requirements" : "Education and Qualifications/ Skills and CompetenciesPost Secondary Degree in Fine Arts, Graphic design, Illustration or equivalentIn depth knowledge of graphic design tools like Photoshop, and&nbsp; IllustratorWorking knowledge of typography&nbsp;Excellent written, visual, and verbal communication skillsAbility to work well with interdisciplinary teamsWork ExperienceVisual UX Design experience for web and/or thick client applicationsOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in CivilMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "SAP",
	"division" : "Toronto Office"
}