{
	"id" : "54494",
	"application_deadline" : "Jan 23, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "8 or 12 months",
	"job_title" : "User Interaction Designer",
	"job_location" : "Vancouver",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Purpose & Objective of PositionWe are looking for an Interaction Designer with prototyping and usability testing skills to join the SAP Business Objects User Experience team in Vancouver, BC.&nbsp; Working collaboratively with user interaction designers, developers, program/product managers and other related disciplines you will be designing best practice user interfaces for the SAP Business Objects Intelligence Platform. To learn more about our solutions, please visithttp://www.sap.com/solutions/sapbusinessobjects/large/business-intelligence/index.epx&nbsp;&nbsp;Expectations & TasksGather design and user requirements through collaboration with the project team.Generate wire frames and interactive prototypes quickly and reliably.Design, conduct and interpret usability research.",
	"job_requirements" : "Skills / CompetenciesKnowledge of User Centered Design principals.Experience in tools like Visio, Flash, Illustrator and Photoshop.Experience with usability testing.Excellent communication, organization, and time management skillsEducational Requirements (degrees, class completion, etc.)University Degree Program with 1 or more courses in “Human Factors”, “Human Computer Interaction” and/or Design&nbsp;Qualifications: &nbsp;&nbsp;Requires candidates to currently be enrolled in an undergraduate, Masters, MBA or PhD degree program which is applicable to the position.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "SAP",
	"division" : "Toronto Office"
}