{
	"id" : "54504",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Hardware (IC Design) Co-op",
	"job_location" : "Richmond, BC",
	"number_of_positions" : "1",
	"salary" : "$18-$45 /hr",
	"frequency" : "Hourly",
	"industry" : "Semiconductor",
	"job_description" : "&nbsp;Broadcom Canada is looking for individuals to join our IC development team and contribute to the development of highly integrated broadband access system-on-chips. As part of our IC development team you will have an active role in the design, development, testing, and support of various integrated cable modem/ ADSL / VDSL / EPON / GPON gateways. You would be exposed to a wide breadth of technologies including:* PCI Express* USB* Wifi* SDR/DDR/DDR2/DDR3* ARM embedded processors* MIPS embedded processors* Networking protocols* JTAG protocols&nbsp;You will have the opportunity to work with a talented team of IC design engineers and be a part of the development cycle of leading edge communications products.** Students with at least two work terms of experience are preferred",
	"job_requirements" : "Required skills:- strong communication and documentation skills- strong programming skills, including experience in C/C++- familiarity with IC design concepts and languages an asset- familiarity with scripting languages an asset, such as VBScript, Perl and Tcl/Tk- experience working in Unix development environments an assetOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Cover letter not required. GPA is requestedCompany:Broadcom Canada Ltd.",
	"division" : "Recruiting - University Relations Dept.",
	"website" : "www.broadcom.com"
}