{
	"id" : "54507",
	"application_deadline" : "Mar 21, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Electrical Power Engineer, Co-Op Student (Vancouver, BC)",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Electrical Power Engineer, Co-Op Student (Vancouver, BC)&nbsp;&nbsp;Amec Foster Wheeler(www.amecfw.com) designs, delivers and maintains strategic and complex assets for its customers across the global energy and related sectors.&nbsp;With pro-forma 2013 annualized scope revenues of £5.5 billion and over 40,000 employees in more than 50 countries, the company operates across the whole of the oil and gas industry – from production through to refining, processing and distribution of derivative products – and in the mining, clean energy, power generation, pharma, environment and infrastructure markets.&nbsp;Amec Foster Wheeler shares are publicly traded on the London Stock Exchange and its American Depositary Shares are traded on the New York Stock Exchange. Both trade under the ticker AMFW.&nbsp;Amec Foster Wheeler offers competitive salaries along with a complete benefits package and a variety of Training and Development Programs to help you develop the skills you need to succeed in your chosen career path. Additional information can be obtained from our website at www.amecfw.com.&nbsp;&nbsp;Role Overview&nbsp;Our Mining business performs consulting and EPCM services for many of the world’s leading mining companies and is executing world-class projects on five continents.&nbsp;&nbsp;We currently have an exciting opportunity for an Electrical Power Engineering Co-Op Student. Reporting to the Electrical Department Manager, this position will be located in our Vancouver, BC office. If you have a successful track record and thrive on challenges in a fast paced environment, this is the opportunity for you.&nbsp;&nbsp;Key Responsibilities:Providing assistance with engineering design on light to heavy industrial and utility&nbsp; projectsLearning and understanding work process flows as well as engineering protocolsPreparing simple plans and reports; including, related engineering calculationsCarrying out straightforward specifications under the supervision and guidance of senior personnelAssisting more experienced technical personnel with specific aspects of project workProviding support to as well as developing and establishing communication with internal Amec Foster Wheeler personnel in order to ensure that work flows smoothly&nbsp;",
	"job_requirements" : "Role Requirements:Successful completion of at least third year of an undergraduate degree program in Electrical Engineering – Power option.Experience and knowledge of engineering design packages such as AutoCAD or MicrostationProficiency with Microsoft Word and Microsoft ExcelFamiliarity with Google Earth, Visual Basic, or XML&nbsp;&nbsp;If you believe you have the necessary knowledge, experience and enthusiasm to succeed in this position, then we would like to hear from you.&nbsp;Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "https://sjobs.brassring.com/tgwebhost/jobdetails.aspx?partnerid=25283&siteid=5191&jobid=1211957",
	"company" : "AMEC Foster Wheeler--Americas Limited (Canada)",
	"division" : "Vancouver Head Office - Divisional H/Q",
	"website" : "http://www.amec.com"
}