{
	"id" : "54514",
	"application_deadline" : "Jan 28, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "Computer Engineering/Computer Science (STUDENT00198)",
	"job_location" : "Calgary, Alberta",
	"number_of_positions" : "2",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Company OverviewA global energy leader with an exciting futureNexen is responsibly developing energy resources in some of the world’s most significant basins including the UK North Sea, Western Canada, the United States and offshore West Africa. As a wholly-owned subsidiary of CNOOC Limited, Nexen has three principal businesses: conventional oil and gas, oil sands, and shale gas.At Nexen, our culture of accountability is key to delivering superior results. Underpinning this culture&nbsp; is a set of beliefs that drive company-wide behaviours around safety, collaboration, innovation and striving to exceed expectations every day.With a robust portfolio of assets, we need high-performing employees who strive for continuous improvement and the chance to share in our future success. Your valued contributions are rewarded with a competitive compensation and benefits package including training that will open doors to your future.Location & Business Unit OverviewCalgary, AlbertaPosition OverviewAt Nexen, we have new graduate and student employee development programs that accelerate your career and allow you to step in, step up and stand out. These paid work terms, enable students to develop technical skills to complement their academic learning. Students, recruited from both universities and colleges, not only meet Nexen’s short-term needs, but provide a potential source of future full-time employees. To be eligible for the intern program, students must be enrolled in an intern program sponsored by an accredited post-secondary institution.&nbsp;",
	"job_requirements" : "Job Duties & Responsibilities2 Positions Available:Position 1:As a member of the Applications Support (SaaS Subsurface Applications) team, you will provide development and applications support to existing and new Geological, Geophysical, Engineering and other Oil and Gas applications. Main duties include software development and implementation.Main responsibilities include:• Development support to reservoir simulation cluster environment, including HPC queuing system.• Development support to Wellview/Siteview system.• Development support to Gateway and DART systems.• Maintain the license management system (i.e. License Tracker, etc.) to generate regular usage statistics.Position 2:This non-project-focused support role will be embedded within the Surface Applications team at Nexen. The applications supported primarily relate to project development and field operations and include Primavera, PRISM, Triangle, SmartPlant, MI3,&nbsp; CGI Landman, and many others.&nbsp;&nbsp; This individual will be involved in system administration, upgrades, enhancements, patching, incident resolution, as well as some potential C# development relating to these applications.Education & ExperienceEducation: 3rd or 4th year Computer Science or Computer Software Engineering studentAvailability: Must be available for 12 to 16 monthsAdditional Skills:• Knowledge of MS Visual Studio, VB, ASP.NET, Java, C# and GIS.• Excellent oral and written communications skills• Experience in help computer systems support, troubleshooting, and one-on-one training• Previous application support experience would be considered an asset.• Confident self starter.• Strong analytical, problem solving, and troubleshooting skills.Application Information• Indicate if you are enrolled in a co-op or internship program• Indicate if you are available for the full work term• Include your GPA and expected graduation date• Upload your resume and cover letter as one documentOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://www.nexencnoocltd.com/careers.",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):Closing StatementClick the “Apply for Job” button to start the application process.No agency or telephone inquiries please.For more information regarding campus recruitment at Nexen please follow us here!Follow us on Twitter! @nexencampushttps://twitter.com/nexencampusBecome a member of our LinkedIn Group!The Nexen Student ConnectionCompany:Nexen Inc.",
	"division" : "Calgary Office",
	"website" : "https://www.nexeninc.com"
}