{
	"id" : "54527",
	"application_deadline" : "Feb 04, 2015 0700AM",
	"position_type" : "Co-op Undergraduate Employment",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "SNAP Habitat Restoration Team",
	"job_location" : "Surrey, BC",
	"number_of_positions" : "4",
	"salary" : "$16-18",
	"frequency" : "Hourly",
	"industry" : "Charitable Organization (not for profit)",
	"company_type" : "Non-Profit Organization",
	"job_description" : "JOB DESCRIPTIONThe Green Timbers Heritage Society is hiring Habitat Restoration Team Leaders and Members for the Surrey Natural Areas Partnership (SNAP) summer program.&nbsp; The SNAP program is a unique partnership involving three local non-profit groups and Surrey Parks, Recreation&nbsp; Culture.&nbsp; The goals of the program are to: 1) restore and enhance Surrey’s natural area parks; 2) provide environmental education to the community; 3) encourage the public to become stewards of natural areas; and 4) raise awareness and promote the care of boulevard trees.&nbsp; Through this program, the successful applicants will receive training and experience in environmental restoration and habitat enhancement techniques.&nbsp; The Habitat Restoration Team Leaders will lead a team of Habitat Restoration Team Members, and will work under the direction of the SNAP Coordinator to implement restoration prescriptions in Surrey parks. This is a field based position.DutiesLeaders: Lead a team to implement restoration prescriptions (e.g. removal of invasive plant species, park clean-ups, small fauna projects, trail closures, planting maintenance), assist with the training of Habitat Restoration Team MembersContribute to a positive work environmentEnsure work is completed in a safe and efficient mannerAssist with training and supervision of volunteersMaintain accurate daily records and complete a final reportCommunicate with the public and park neighbours in relation to restoration and enhancement projects, as well as appropriate park use and impacts on the environmentOccasionally assist other SNAP teams with staffing environmental displays at special events, leading community stewardship events, and other educational outreach activities",
	"job_requirements" : "Required QualificationsEnrolment in, or completion of, an undergraduate degree or two year diploma program in Biology, Environmental Science, Environmental Studies, Geography or related disciplineLeaders: Supervisory and/or leadership experienceDemonstrated willingness and ability to perform repetitive, physical work in all weatherDemonstrated ability to ID native and invasive plants and knowledge of ecological principlesStrong public relations and interpersonal skillsMust have steel toed bootsA valid Class 5 BC Driver’s LicenseValid Level 1 First Aid Certification will be required as a condition of employmentCompletion of a criminal record check will be required as a condition of employmentAs these positions are dependent on external funding, all applicants must indicate if they meet the following criteria:Current full-time student returning to full-time studies in SeptemberBetween the ages of 15 and 30You must indicate whether you meet these criteria on your applicationOpen To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsChemical & BiologicalCivilComputerElectricalEnvironmentalGeologicalIntegratedMaster of Applied Science in CivilMaster of Applied Science Okanagan in CivilMaster of Engineering CivilMaster of Engineering in GeologicalMaster of Engineering Okanagan in CivilMaterialsMechanicalMiningUBC OkanaganUBC Okanagan CivilUBC Okanagan ElectricalUBC Okanagan MechanicalStart Date:05/04/2015",
	"end_date" : "08/28/2015",
	"hours_per_week" : "40",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "www.surreysnaturalareaspartnership.com",
	"company" : "SNAP (Surreys Natural Areas Partnership)",
	"division" : "Green Timbers Heritage Society",
	"website" : "www.surreysnaturalareaspartnership.com"
}