{
	"id" : "54531",
	"application_deadline" : "Jan 27, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 or 8 months",
	"job_title" : "Computer Science Co-op",
	"job_location" : "Vancouver, BC",
	"number_of_positions" : "1",
	"salary" : "TBD",
	"frequency" : "Monthly",
	"job_description" : "Convergent Manufacturing Technologies (www.convergent.ca), a small and dynamic university spin-off company located on the UBC Vancouver campus, is a world-leader in virtual manufacturing for the aerospace industry with the majority of customers outside Canada. We develop specialized engineering simulation software and provide engineering support to the leading aerospace companies worldwide.Position Overview:Convergent is seeking a co-op student who would be available for a 4 or 8 month term starting May 2015. This position will report to the Engineering Lead of the software development group.The successful candidate will be a dynamic, self-motivated, computer-savvy individual who will provide programming support for all of our software products, in particular dealing with application testing. The successful candidate will be involved with implementing an automated build/test environment.Convergent’s software offerings range from desktop engineering applications, to real-time data acquisition and management systems, to plug-ins and modules for finite element analysis packages. Most development at Convergent uses Python, but significant development in C, C++, and FORTRAN also occurs.Key Responsibilities include but not limited to the following: Working with the rest of the development team, implement a multi-application, cross-platform build/test environment, including creating a library of tests for the various applications Code, test, and document applications, utilities, firmware, etc., as required for internal and customer projects Review, debug, refactor existing applications, utilities, firmware, etc.",
	"job_requirements" : "Qualifications: Experience – Demonstrated programming skills, particularly in testing and UI design and implementation Education – Working towards a degree or diploma related to computer science or programming Computer Skills – Comfortable working in Windows and Linux environments Programming Skills – Familiarity with Python would be an asset, but is not required Organizational/Multi-Task Skills – An independent self-starter; able to allocate one's time effectively; detail oriented; efficient and organized; works well under pressure Relationship Skills – A team player with an outgoing personalityPlease note that some of the work is subject to the Controlled Goods Program (http://ssi-iss.tpsgc-pwgsc.gc.ca/dmc-cgd/index-eng.html). Prior to receiving an offer of employment, you must consent to a security assessment which includes a criminal background check.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Online via system",
	"company" : "Convergent Manufacturing Technologies Inc (CMT)",
	"division" : "Convergent Manufacturing Technologies, Inc (CMT)"
}