{
	"id" : "54532",
	"application_deadline" : "Jan 30, 2015 0700AM",
	"position_type" : "Both Undergraduate and Graduate",
	"start_of_workterm" : "May 2015",
	"length_of_workterm" : "4 months",
	"job_title" : "The Ward Family Summer Student Research Program",
	"job_location" : "Toronto, ON",
	"number_of_positions" : "1",
	"salary" : "$11.00",
	"frequency" : "Hourly",
	"job_description" : "The Ward Summer Student program provides the opportunity to experience a unique interdisciplinary mentorship experience. Successful incumbents will have opportunities to work with their mentor on a research project and participate in events such as the Bloorview Research Institute Film Festival and Lunch n Learns. Students will also participate in the annual Ward Summer Student Research Day, where they will have an opportunity to present their findings to the organization and its visitors.Who is eligible?At the time of application, eligible students must be enrolled in a university or college undergraduate degree/diploma program. Students in medical school may also apply. Students who have taken part in this program before may not re-apply. Students currently in a MSc/MA or PhD program are not eligible for summer studentships.The program runs for a minimum of 12 weeks beginning May 11th, 2015.&nbsp; Students will be paid $11.00 per hour based on a 37.5 hour week, less statutory deductions, including 4% in lieu of vacation and relevant statutory holiday pay. Students will be paid biweekly through payroll",
	"job_requirements" : "How do I apply?Candidates should submit their application through Holland Bloorview's Current Openings website to the relevant scientists' job posting. Note that you must create a profile in Holland Bloorview's HR system in order to submit an application.You may apply to a maximum of three (3) scientist postings. Please select from the list of scientists currently accepting Ward Summer Students for 2015.&nbsp; If you are applying to more than one scientist position, please submit separate applications for each. We strongly encourage tailored cover letters for each application indicating how your interests align with that scientist and their research.&nbsp; Please do not contact the scientists directly.A candidate application should consist of a single pdf file that includes the following:First page - answer the following questions:What program of study are you currently enrolled in?What year are you in within your program of study?Please indicate your academic average as a percentage (e.g. 80%) for the last two (2) years of study if applicable.Do you have research experience? If so, please provide details of your research experience.Do you have experience working with children with disabilities? If so, please provide details.If you are applying to more than one position please indicate the scientists' names.A copy of your most recent curriculum vitae (CV) including a cover letterA copy of your most recent unofficial university transcriptOne letter of reference from a professor or previous employerIf any part of the application package is missing the student will not be considered for the position.Due to the volume of applications received, only students selected for an interview will be contacted.When is the application deadline?Applications are due by Friday, January 30th, 2015. Students are encouraged to apply as soon as possible.Other student opportunitiesOther student opportunities may become available throughout the year. Please visit the current openings page for additional information regarding eligibility and funding.Open To All Majors:No",
	"targeted_co-op_programs" : "Targeted ClustersAll ProgramsTargeted ProgramsComputerElectricalIntegratedMaster of Applied Science in Electrical & ComputerMaster of Applied Science Okanagan in ElectricalMaster of Engineering ComputerMaster of Engineering ElectricalMaster of Engineering Okanagan in ElectricalMaster of Software SystemsUBC OkanaganUBC Okanagan ElectricalHours Per Week:0",
	"application_receipt_procedure" : "Employer Website",
	"if_by_website,_go_to" : "http://research.hollandbloorview.ca/TrainwithUs/Wardfamilysummerstudentresearchprogram",
	"additional_application_information" : "Additional Application Information",
	"(i.e._driver's_abstract)" : "(i.e. Driver's Abstract):When is the application deadline?Applications are due by Friday, January 30th, 2015. Students are encouraged to apply as soon as possible.Other student opportunitiesOther student opportunities may become available throughout the year. Please visit the current openings page for additional information regarding eligibility and funding.Company:Holland Bloorview Kids Rehabilitation Hospital",
	"division" : "Bloorview Research Institute",
	"website" : "http://www.hollandbloorview.ca/"
}